{
  "dialog.addelement": "Добавление ссылки на элемент;  Слои глифов содержат элементы. Один и тот же элемент может использоваться в нескольких слоях глифов. Если добавить ссылку на элемент в текущем глифе, новый элемент в глифе будет связан с тем же элементом в других глифах — если изменить ее в одном месте, она изменится везде. Ссылки на именованные элементы отображаются на панели **Галерея**. \n\n**Чтобы найти элемент или глиф для добавления в качестве ссылки**, необходимо ввести его имя в поле фильтра.\n\nИспользуйте кнопки  <i>Глифы</i> и <i>Элементы</i> , расположенные в левом нижнем углу диалогового окна **, это даст возможность выбрать, что необходимо отображать в диалоговом окне только элементы, только глифы или и то, и другое**\n\n**Чтобы использовать предварительную ширину добавленного элемента**, необходимо выбрать опцию  <i>Заменить предварительную ширину</i>. В противном случае необходимо оставить опцию <i>Сохранить метрики</i>.\n\n**Чтобы добавить ссылку на элемент или компонент**, необходимо выбрать элемент или глиф в диалоговом окне и нажать кнопку  <i>OK</i>.\n",
  "dialog.addglyphs": "Добавление глифов; Диалоговое окно **Добавить глифы** можно использовать для добавления к шрифту стандартных форм глифов в кодировке Unicode. В диалоговом окне, в виде сетки, отображается список всех глифов Юникода, известных FontLab. В серых ячейках содержатся глифы, которые уже существуют в шрифте и не могут быть выбраны. Можно выбрать любой из оставшихся глифов (или все).\n\n **Чтобы добавить глиф **, необходимо выбрать его на панели. **Чтобы выбрать все доступные глифы**, следует нажать опцию <i>Выбрать все</i>.\n\n **Чтобы добавить глиф**, следует выбрать его в диалоговом окне, и затем нажать <i>Применить</i>. **Чтобы добавить глиф и закрыть диалоговое окно**, следует нажать <i>OK</i>. По умолчанию вновь добавленные глифы будут отмечены синим цветом. **Чтобы изменить цвет флага**, следует использовать выпадающее меню в левом нижнем углу диалогового окна. **Чтобы снять цветовой флаг для вновь добавленного глифа(ов)**, необходимо использовать опцию <i>Отметить новые глифы</i>.\n\n **Чтобы отфильтровать глифы, которые отображаются в диалоговом окне**, необходимо выбрать одну из опций, расположенные в левом верхнем углу. Опции состоят из переключателей. Для переключения предусмотрено три варианта:\n\n 1. В ** Интеллектуальном** режиме, можно ввести **имя скрипта  и/или категорию или какое-либо другое слово, объединяющее несколько символов Юникода**. В FontLab будут отображены глифы, соответствующие введенным ранее ключевым словам.\n\n 2. В режиме **Категории** будет отображен список категорий глифов, таких как <i>Буквы в верхнем регистре</i>, <i>Математические символы</i> или <i>Частное использование</i>. Выбор одной из категорий приведет к отображению справа всех глифов. Большинство не латинских символов находятся в группе <i>Другие символы</i>, поэтому, если необходимы выбрать не латинские символы, следует использовать вкладку Скрипты для получения конкретных результатов.\n\n 3. В режиме **Скрипты** отображается длинный **список всех доступных скриптов Юникод**. Чтобы просмотреть все доступные символы в списке необходимо кликнуть на одном из скриптов в списке.\n",
  "dialog.addlayer": "Add Layer; The **Add Layer** dialog can be used to add a new layer or master. The dialog has the following fields and options:\n\n- **Name**, where you can enter a name for the new layer.\n- A set of three icons to define the main **Properties** of this layer — whether it will be a <i>service layer</i>, be <i>locked</i> and if it will be displayed as <i>wireframe</i>. By default, a new layer will be added at the top of the list in the panel. **To put the new layer at the bottom of the list**, click the <i>Put to background</i> button.\n- You can choose whether the new layer should be added to the <i>current glyph only</i>, <i>selected glyphs</i> or <i>all glyphs</i>.\n- By default, if a layer already exists, it will not be added and the option <i>Skip</i> will be selected. **To add the layer even if it exists**, select <i>Add anyway</i>. \n- **Fill new layer with content of this font** allows you to copy glyph elements from another opened font to the new layer of the current font, and choose whether you would like this copy to be <i>left</i>, <i>right</i> or <i>center aligned</i>. You can also choose the master of that font. If no other font is open at the time, the contents of the currently selected layer of the same font will be copied.\n- Check the **Make it master layer** if you would like FontLab to name the master in a way that it works as a master. This will be a font master if you add the contents of the opened font, or this a glyph master if you create the layer for just some of the glyphs in the font.\n- If **Use instance layer if available** is checked and the font is axis-based (i.e. a variable font), the #instance layer is used. \n- If **Reuse named elements that exist in new font layer** is checked elements having names will be used.\n- Check the **Rasterize layer to this PPM** and enter the value you need to put the result of the glyphs outline rasterisation to the new layer.\n",
  "dialog.addsuffixtoname": "Add Suffix to Name; The **Add Suffix to Name** dialog can be used to rename selected glyphs by either adding a new suffix or changing the existing glyph name suffix.\n\n**To enter a new suffix**, type it in the <i>Name</i> field or use the <i>suffix</i> dropdown menu to select the standard suffixes for glyphs used in OpenType features.\n\n**To replace the current suffix of the selected glyphs**, check the <i>Replace existing suffix</i> option.\n\nClick <i>Ok</i> to apply the changes.\n",
  "dialog.commands": "Commands; The **Commands** dialog can be used to assign keyboard shortcuts to menu commands, and to execute commands.\n\n**To find a command**, type its name in the <i>Search</i> field. Note that this dialog only shows seventy-five commands, so not every command is visible by default.\n\n**To define a new keyboard shortcut**, select the command in the list and position the cursor on the editing field below the list. When the caret is in position in the field, press the combination of keys that you want to assign. A description of that combination will appear in the editing field, and you can click the <i>Set</i> button **to assign that combination to the currently selected command**. If that keyboard shortcut you have entered is already being used for another command, that command’s name will appear under the editing field in red, and the <i>Set</i> button will appear disabled. The button will also be disabled if you only press a single key. \n\n**To remove the existing keyboard shortcut for a command**, select the command in the list, and click <i>Clear</i>.\n\n**To reset all FontLab keyboard shortcuts to factory defaults**, click the hamburger menu button and select <i>Reset Shortcuts</i>. \n\n**To import keyboard shortcuts**, click the hamburger menu button and select <i>Import Custom Shortcuts…</i>. A standard Open dialog will appear where you can choose the appropriate file to import.\n\n**To export keyboard shortcuts**, click the hamburger menu button and select <i>Export Custom Shortcuts…</i>. A standard Save dialog will appear. Note that exported keyboard shortcuts are saved in a JSON file.\n\n**To save changes and close the dialog**, click <i>Close</i> in the dialog.\n\n**To save the changes and also execute the selected command**, click <i>Go</i> or press <b style=\"font-style: normal;\"><b>↩</b></b>.\n",
  "dialog.exportfonts": "Экспорт шрифтов; Диалоговое окно **Экспорт шрифтов** предназначено для выбора формата экспорта для разработанного шрифта, и директории для его сохранения.\n\n**Чтобы выбрать формат шрифта**, выберите один из <i>Профилей для экспорта</i>, расположенные на панели слева. В списке предусмотрены только активные профили для экспорта, которые были включены в диалоговом окне Профили. В него можно перейти с помощью пункта меню <i>Файл › Профили</i>.\n\nВ FontLab предусмотрены собственные форматы, в которых хранится весь исходный шрифт (.vfc и .vfj), DesignSpace + UFO и вариации OpenType - это профили с несколькими начертаниями. Все остальные профили относятся к профилям с одинарным начертанием шрифтов. Если вы выберете профиль “с одинарным начертанием”, вам нужно будет выбрать, какое содержимое исходного шрифта следует экспортировать. **Чтобы выбрать, какой контент следует экспортировать в профиль с одинарным начертанием**, используйте переключатель <i>Текущий слой / Экземпляры / Мастера</i>. Переключатель предусматривает следующие опции:\n\n1. Если вы выберете **Текущий слой** в качестве содержимого шрифта, то FontLab-ом будет экспортирован текущий активный мастер или слой из вашего исходного шрифта.\n\n2. В списке **Экземпляры** отображаются все предопределенные экземпляры, которые были заданы в диалоговом окне Информация о шрифте, в которое можно перейти через пункт меню <i> Файл › Информация о шрифте › Экземпляры</i>. **Чтобы включить/отключить предопределенные экземпляры, которые вы хотите экспортировать**, используйте переключатели, расположенные в окне слева. Все включенные экземпляры будут сгенерированы с помощью интерполяции, а затем экспортированы в виде отдельных шрифтов.\n\n3. Если в вашем исходном шрифте содержится несколько основных шрифтов, вы можете выбрать **Мастера** в качестве содержимого шрифта. В списке мастеров будут показаны все мастера шрифтов, которые вы задали в диалоговом окне Информация о шрифте, в которое можно перейти через пункт меню <i> Файл › Информация о шрифте › Мастера</i>. **Чтобы включить/отключить мастеров, которые вы хотите экспортировать**, используйте переключатели, расположенные в окне слева. Все включенные шаблоны будут экспортированы в виде отдельных шрифтов.\n\n**Чтобы выбрать директорию для сохранения экспортированных шрифтов**, используйте параметры в разделе <i>Директория</i>, расположенные в нижней части диалогового окна:\n\n- Выберите **Источник**, если хотите экспортировать свои шрифты в ту же папку, в которой сохранен ваш исходный шрифт.\n- Или воспользуйтесь опциями **Папка** и **Выбрать**, чтобы выбрать папку, в которую будут экспортированы ваши шрифты. Для **автоматического создания структуры вложенных папок внутри целевой папки**, активируйте опцию <i>Семейство</i>. **Для создания структуры вложенных папок на основе выбранного профиля для экспорта**, установите флаг <i>Профиль</i>. FontLab автоматически создаст имена файлов для экспортируемых шрифтов на основе “наилучшей совместимости”. Вы можете использовать раскрывающийся список <i>Существующие файлы шрифтов</i>, чтобы решить, что необходимо сделать с файлами с такими же именами, которые уже существуют в целевой папке.\n\nПосле того, как вы выбрали нужный вам вариант, нажмите <i>Экспорт</i>**, для осуществления экспорта шрифтов**.\n",
  "dialog.findglyphs": "Поиск глифов; Диалоговое окно **Поиск глифов** можно использовать для поиска глифов с помощью введенных ключевых слов и нескольких заданных критериев.\n\n**Чтобы найти глиф**, необходимо ввести ключевое(ые) слова в поле <i>Поиск</i>. В зависимости от того, что будет введено, в списке слева будут отображать различные критерии.\n\n**Чтобы выбрать глиф**, кликните по нем в списке (или выберите несколько глифов, с помощью нажатой клавишу  <i><b style=\\\\\"font-style: normal;\\\\\"><b><small>SHIFT</small></b></b></i> or <i>Cmd</i>). **Чтобы выбрать все глифы**, нажмите кнопку <i>Выбрать глифы в списке</i>, она расположена в правом верхнем углу.\n\nЕсли вы находитесь в окне Шриты, то <b style=\\\\\"font-style: normal;\\\\\"><b><small>при 2×КЛИКЕ</small></b></b> на выбранным глифам приведет к закрытию диалогового окна и **выбранные глифы будут отображены в окне Шрифты**. Если вы находились в окне Глифы, то необходимо проделать действия, описанные выше, вследствие чего **выбранные глифы будут открыты в окне Глифов**.\n",
  "dialog.findoutline": "Найти контур; Диалоговое окно **Найти контур** в сочетании с командой <i>Редактировать › Копировать</i> поможет вам заменить один или несколько идентичных контуров, встречающихся в нескольких глифах, на альтернативные варианты.**Чтобы увидеть, в каких глифах присутствует конкретный контур или часть контура**, выделите его в одном глифе с помощью инструмента <i>Контур</i>, а затем откройте диалоговое окно **Найти контур**, перейдя в пункт меню <i>Правка › Найти контур</i> или используя сочетание клавиш <i>Ctrl+F</i>. В диалоговом окне нажмите <i>Найти</i>, чтобы увидеть глиф, содержащий контур или часть контура.**Чтобы выполнить операцию поиска и замены контура или части контура**, выполните следующие действия:1. Выберите контур(ы).\n2. Скопируйте выделенный фрагмент в буфер обмена с помощью команды <i> Правка › Копировать</i>.\n3. Измените исходную форму по своему желанию и выберите новый вариант.\n4. Откройте диалоговое окно **Найти контур**, с помощью пункта меню <i> Правка › Найти контур </i> или используйте сочетание клавиш <i>Ctrl+F</i>. С левой стороны панели будет отображен путь, по которому FontLab будет осуществляться поиск, а с правой стороны панели будет показан путь, который будет использоваться в качестве замены.\n5. На левой стороны панели нажмите <i>Вставить из буфера обмена</i>, а на правой нажмите <i>Использовать текущий выбор</i>.\n6. Нажмите <i>Найти</i>, чтобы осуществить поиск следующий исходный путь в одном из глифов. Первый, найденный такой глиф появится в окне Глифы и будет выбран найденный путь.\n7. Нажмите <i>Заменить</i>, чтобы заменить старый путь на новый, или нажмите <i>Заменить и найти</i>, чтобы заменить и найти следующий пути.**Чтобы выбрать, с какими глифами необходимо выполнить данную операция**, используйте раскрывающийся список <i>Применить к</i>.По умолчанию измененные глифы будут окрашены, синим цветом. **Чтобы изменить цвет флага**, воспользуйтесь выпадающим меню в диалоговом окне, которое расположено в левом нижнем углу. **Чтобы не применять цвет для измененных символов**, снимите флаг <i>Флаг для результата</i>.\n",
  "dialog.fontinfo": "Информация о шрифте; Диалоговое окно <i>Информация о шрифте</i> - это область, в котором вы можете определять свойства для шрифта. \n\nНа локальной панель инструментов будут отображены свойства, какие заданы для шрифта. Используйте стрелки влево и вправо, чтобы внести изменения в текущий шрифт и отредактировать свойства для предыдущего или следующего шрифта соответственно. Вы также можете выбрать, какие свойства для шрифта необходимо отображать, воспользовавшись выпадающим меню <i>Шрифт</i> и <i>Мастера</i>. Поле **Найти** можно использовать для поиска вложенных свойств на панели.\n\nНа панели диалогового окна предусмотрено три кнопки: <i>Отмена</i>, <i>Применить</i> и <i>ОК</i>. Используйте кнопку <i>Применить</i> перед нажатием на кнопку <i>ОК</i> , чтобы применить текущие изменения к открытому шрифту.\n\nЧтобы изменить свойства, следует выбрать раздел, расположенный на панели слева.\n",
  "dialog.fontinfo.axes": "Font Info > Axes; In <i>Font Info › Axes</i>, you can define axes that are typographic properties that change during interpolation. Axes form the coordinate system for your font design space.\n\nIf you have two standard default axes – weight and width – you may have this page empty and still be able to design two-dimensional variations. But if you need to change default axes or add more axes to your design space you need to use this section of the dialog.\n\nTo create a new axis, click the plus-shaped **Add axis** button. Select one among several predefined axes or choose the “Custom” one. When a new axis appears you can change its properties: \n\n* In the **Name** field, add the name of the axes.\n\n* Enter the **FontLab-internal two-letter axis code** in this field. This code will be used within the application while working on variable fonts. If you are adding a custom axis, change the code to something unique.\n\n* Enter the **four-letter axis tag** in this field. The standard registered axes from the OpenType specification are Weight, Width, Optical size, Slant and Italic. If you are adding a custom axis, change the code to something unique. \n\n* Use the **Show/hide in the apps** toggle to specify whether this axes should be visible other applications’ UI.\n\n* Put in the **Minimum**, **Maximum** and **Default** coordinates for the axis in the respective fields. Use the **Auto range** button to automatically generate these range values.\n\n* Use the **Instances** field to enter recipes for instances along this axis, or use the **Auto instances** button to generate these recipes automatically.\n\nTo remove an axis, select it in the list and click the minus-shaped **Remove axis** button.\n\nSelect **Sort Contours and Start Nodes** to ensure that when you add existing fonts as masters, FontLab will sort contours and points on the fly when fonts are added to make the order of elements, contours and points consistent. This operation assumes that both masters have the same number of nodes (only on-curve and TT off-curve points, not handles).\n\nSelect **Check masters geometry** to detect if there are problems with types of nodes (smooth/sharp), types of segments (line/curve) and take care of situations where elements have been rotated. If something is wrong with nodes and contours compatibility FontLab will try to fix this automatically.\n",
  "dialog.fontinfo.codepages": "Font Info > Codepages; Use the <i>Font Info › Codepages</i> section to specify the list of codepages that the font supports, as specified in the OS/2 table.\n\n**To select supported codepages automatically**, click the <i>Detect codepages</i> button. FontLab will analyze the Unicode information available in the font and will automatically detect which codepages this font can support.\n\n**To add a codepage to the list of supported codepages**, select a codepage in the list on the left, and press the <i>Add codepage</i> button.\n\n**To remove a codepage from the list of supported codepages**, select a codepage in the list on the right, and press the <i>Remove codepage</i> button.\n\n**To reset the list of supported codepages**, click the <i>Reset</i> button.\n\n**To edit the CodePageRange1 and CodePageRange2 values of the OS/2 font table directly**, use the field below the selected codepages.\n",
  "dialog.fontinfo.creator": "Font Info > Creator; In <i>Font Info › Creator</i>, you can edit the font description, designer and vendor credits. It has the following options:\n\n**Vendor Code** is an up-to-four letter length code that is assigned to TrueType producers, which must be registered with Microsoft. All registered **Vendor Names** known at the time of FontLab release are placed in the drop-down list box next to the vendor code field. Start typing the vendor name and you will see the drop-down list box. If you want to identify yourself without registering you may enter a lowercase four-letter vendor code.\n\nIn **Vendor URL**, you can add the web site address for the vendor. click the <i>Open in browser</i> button to open the website in your browser.\n\nUse the **Designer** field to enter the name of the designer(s) of the typeface family.\n\nIn **Designer URL**, enter the web site address for the designer. click the <i>Open in browser</i> button to open the website in your browser.\n\nPut the name of the font manufacturer in the **Manufacturer** field.\n\nUse **Creation date** to enter the year and time when the font was created. The year is used to automatically fill in the Copyright field and is exported in OpenType-TT fonts as the Creation year entry.\n\nUnder **Version**, you can enter the major and minor version numbers and click the <i>Auto</i> button to generate the version string.\n\nThe **Description** field is exported in PostScript Type 1 fonts as the Copyright entry, and in TrueType fonts as the Description entry. Enter the approriate text in this field based on the type of font you are creating.\n",
  "dialog.fontinfo.familydimensions": "Font Info > Family Dimensions; In the <i>Family Dimensions</i> section of <i>Font Info</i> you can edit those font metrics that must be identical in all fonts of the same font family:\n\n**Units Per em** is the number of font units that defines the font height and the coordinate grid on which the glyphs are drawn. To modify the UPM, press the <i>Change</i> button, which will bring up a dialog where you can enter the new UPM value. Choose **Scale glyphs and metrics to the new UPM value option** and all the font data will be scaled automatically.\n\nEnter the position of the font’s ascender line in the **Ascender** field. \n\nEnter the position of the font’s descender line in the **Descender** field.\n\nIn the **Line Gap** field, enter the line gap value, i.e. the distance between bottom line of the upper line of text and top line of the lower line of text.\n\nIn the **Safe Top** field, define the topmost line of all non-exceptional characters in the font. \n\nIn the **Safe Bottom** field, define the lowermost line of all non-exceptional characters in the font. \n\nEnter the topmost position of all characters in the font in the **BBox top** field.\n\nEnter the lowest position of all characters in the font in the **BBox bottom** field.\n\nYou can use the <i>Copy dimensions</i> and <i>Paste dimensions</i> buttons on the bottom-right of the dialog to copy/paste all the family dimensions from another font.\n",
  "dialog.fontinfo.fontdimensions": "Font Info > Font Dimensions; In the <i>Font Dimensions</i> section of <i>Font Info</i>, you can modify the following properties:\n\nEnter the height of the font’s uppercase characters in **Caps Height**.\n\nEnter the height of the lowercase characters in **X Height**.\n\nIn the **Italic Angle**, enter the actual italic or oblique angle for the font. The italic angle is measured in the counterclockwise direction, but FontLab shows it positive here. So the default value is 12º. Use this field if you are creating an italic font.\n\nThe **Slope** value is based on the Italic Angle and used to calculate the slope of the cursor.\n\nIn the **Caret Offset** field, enter the amount by which a slanted highlight on a glyph needs to be shifted to produce the best appearance. Non-slanted fonts should have a setting of zero.\n\n**Curve tension** is a measure of how much a curve deviates from a straight line between two points. Enter a value between 0 to 100% in this field.\n\n**Corner Tension** is the tension applied to all Smart Corners in the master.\n\n**Ink-trap Width** controls the amount that the corners or details are removed from the letterforms, when using Smart Corners.\n\nUse the **U-Position** and **U-Thickness** to define the position of the middle and the thickness of the underline line in your font.\n\nYou can use the <i>Copy dimensions</i> and <i>Paste dimensions</i> buttons on the bottom-right of the dialog to copy/paste all the font dimensions from another font.\n",
  "dialog.fontinfo.guides": "Font Info > Guides; In <i>Font Info › Guides</i>, you can view, create and manage font guides. The dialog shows you all the font guides in your font in a list, along with their <i>Name</i>, <i>Position</i>, <i>Expression</i>, <i>Width</i> and <i>Tags</i>.\n\n**To edit a guide or its properties**, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the appropriate cell and type the new value.\n\n**To add a new font guide**, click the plus-shaped <i>Add guide</i> button and then edit the appropriate values.\n\n**To remove a font guide**, select it in the list and click the minus-shaped <i>Remove guide</i> button.\n",
  "dialog.fontinfo.instances": "Font Info > Instances; In <i>Font Info › Instances</i>, you can view and declare predefined instances in your variable font. The predefined axes are displayed in a table with checkboxes to select whether they are active or not, a preview, as well as their <i>Style</i>, <i>Style Group</i> and <i>Location</i>.\n\nTo add new predefined instance to your variable font, click the plus-shaped **Add axis** button at the bottom of the list of instances. The new default instance will be added and you can change its properties.\n\nTo remove the instance from your variable font, select it in the list and click the minus-shaped **Remove axis** button.\n\nclick the **From Axes** button to automatically generate predefined instances based on the recipes specified in <i>Font Info › Axes</i>.\n\nclick the **From Masters** button to automatically generate predefined instances for each master.\n\nclick **Reset** to remove all predefined instances.\n\nTo edit instance properties, select the instance in the list and refer to the properties section below the list:\n\n* In **Style** enter the style of the font, and use the **Weight** and **Width** dropdowns and fields to define those attributes.\n\n* Use the **Location** field to define the what overall location the instance takes in the design space formed by axes, or use the **Axes** dropdowns and fields below it to change the location per axes. Changes made in either fields will automatically reflect in the other.\n\n* Click the arrow on the left of the Location field, to open more details about the **Styling Group**.\n",
  "dialog.fontinfo.legal": "Font Info > Legal; In the <i>Font Info › Legal</i> section, you can enter copyright and licensing information about your typeface.\n\nEnter the copyright notice in the **Copyright** field. It must include the © symbol or the word “Copyright”, the name of the company or person that owns the copyright and the copyright year.\n\nIn the **Trademark** field, enter the font’s trademark notice.\n\nIn the **License URL** field, enter a web site address for the License if any.\n\nPut the font license or EULA in the **License** field.\n\nUse the **Embedding** dropdown menu to select how the font file will be included in electronic documents like PDF or a webpage.\n\nTurn the **Allow subsetting** option off to not allow subsetting of the embedded font.\n\nTurn the **Bitmap embedding only** option on to not allow embedding of font outlines but integrate fonts as bitmaps.\n",
  "dialog.fontinfo.masters": "Font Info > Masters; The <i>Font Info › Masters</i> section is where you can change your font master's properties. It contains a full list of all the font masters in a table.\n\nTo add new font master to your variable font, click the plus-shaped **Add master** button at the bottom of the list at the left of the dialog. The dropdown menu allows you to select the method of creating new master.\n\nTo remove the font master from your variable font, click the minus-shaped **Remove master** button at the bottom of the list at the left of the dialog.\n\nClick the checkbox to the left of a master’s name to make it the default master.\n\nClick the **AAA** button to the right of the master’s name and location to select it (button becomes blue) to specify that it should be used for interpolation. If this button is not selected, the master will not be used for interpolation.\n\nSelect a master in the list to edit its propoerties that are shown below the table:\n\n* Under **Attributes**, you can edit the **Weight**, **Width** and **Slope** using the respective dropdowns or the Weight field. Additionally, you can specify some way in which a style of your font differs that is not weight, width or slope in the **Other** field.\n\n* In the **Location** field, enter the value for the master’s location; or use the **Axes** field below that to do the same.\n",
  "dialog.fontinfo.names": "Font Info > Names; In the <i>Names</i> section of the <i>Font Info dialog</i> you can edit the following properties:\n\n**Family Name** or typographic family name is the field for the name under which all fonts from one family are grouped in the font menu of a modern application. The name should be no more than 31 characters, and it is recommended that only uppercase and lowercase English letters, spaces and numerals are used.\n\nUse the **Weight** dropdown menu to select the typographic weight of the typeface. This can range between Thin (100) to Extra Black (950), and defaulting to Regular (400).\n\nUse the **Width** dropdown to select the typographic width of a typeface, ranging from Ultra Condensed to Ultra Expanded, and defaulting to Normal for most fonts.\n\nSelect **Monospaced** if you are designing a monospaced typeface.\n\nUse the **Slope** dropwdown menu define whether the typeface is upright, italic or oblique.\n\nIn **Other**, specify some way in which a style of your font differs that is not weight, width or slope.\n\n**Style** or the typographic style name is the field for the name under which a certain font within a family appears in the font menu of modern applications. Use the <i>Auto</i> button to generate the field automatically.\n\n**Full Name** or Full font name is the field for a more detailed font name. It is sometimes used by applications to refer to a font by its name. Use the <i>Auto</i> button to generate the field automatically. \n\nIn the **PostScript** field, enter the PostScript name is a name used internally by a PostScript printer to identify the font within a printing job. Its length cannot exceed 29 characters, and it must only consist of uppercase or lowercase English letters or digits. Use the <i>Auto</i> button to generate the field automatically.\n\nIn **Style group** field, enter the Styling group name, which is the name that appears in older Windows applications as the “Family” or “Font” name. Use the <i>Auto</i> button to generate the field automatically.\n\nUse the **Style link** dropdown to choose between “Regular”, “Italic”, “Bold”, “Bold Italic”, which are used as the name which appears as the name of the “Font style” in a font selection menu in applications that do not support Typographic families. \n\nPress the **Build Names** button to to automatto automatically generate the Full name, PostScript name and Style group name fields.\n\nIf you designed several font masters for your variable font, you can rename them here using the **Master name field**. Master name is identical to the layer name where the master lives. If you rename a master, the change is instantly visible in the top and bottom-left master selectors.\n",
  "dialog.fontinfo.note": "Font Info > Note; In the <i>Note</i> section of <i>Font Info</i>, you can add any internal design comments, which will not be exported in the final font.\n",
  "dialog.fontinfo.othervalues": "Font Info > Other Values; In <i>Font Info › Other Values</i>, you can define additional technical font master properties.\n\nUnder **Font Dimensions**, you can control the X and Y coordinates and size of the **superscript** and **subscript** characters, as well as the position and the width of the **strikeout line**.\n\nIn **Family Dimensions**, you can define **platform-specific linespacing** settings for the entire font family.\n\nUnder **PostScript Hinting**, you can define extra parameters to control the PostScript hinting (CFF, Type 1) of the font:\n\n* If **ForceBold** is turned on, PS hinting algorithm makes the font looking “bold.”\n* **BlueScale** controls PPM when overshoot depression is switched off. If PPM is less than BlueScale, then overshoot suppression is applied. If it is equal to or exceeds BlueScale, overshoot suppression works only if the distance from the aligned point to the base line of the alignment zone is less than the BlueShift value and the scaled distance is less then half of a pixel.\n* **BlueShift** gives more precise control over overshoot description.\n* **BlueFuzz** lets you expand alignment zones in both directions. If you have defined a zone like (700-715), and BlueFuzz is equal to 2, then the actual zone used will be (698-717).\n\n**TrueType Hinting and Smoothing** controls the hinting process and antialiasing parameters of a TrueType font:\n\t\n* From the **Use TT hinting** dropdown,\tselect among FontLab TrueType hinting algorithms, TTFAutohint, and no hinting for this particular font.\n* If you enter 0 in **No smoothing up to PPM**, smoothing will be on for all PPMs.\n* If you enter 0 in **No vertical smoothing up to PPM**, vertical smoothing will be on for all PPMs.\n",
  "dialog.fontinfo.parameters": "Font Info > Parameters; In <i>Font Info › Parameters</i>, you can manage parameters, which are named numeric variables that are used in expressions. Values you can reference in expressions font-wide — parameters, font guidelines and selected variables — are listed in this section. Variables are preceded by <i>three grey dotted horizontal lines</i>; parameters by a <i>calculator</i>; and font guidelines by <i>two horizontal blue dotted line intersected by a vertical one</i>. \n\n**To define a new parameter**, click the plus-shaped <i>Add parameter</i> button, name the variable and <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the slider to define its value.\n\n**To remove an existing parameter**, select it in the list and click the minus-shaped <i>Remove parameter</i> button.\n\n**To modify the value of a parameter**, enter the new value in the input area, use the number steppers or the slider. Note that changing the value of a pre-defined variable will also change your font’s dimensions listed on other pages.\n",
  "dialog.fontinfo.stems": "Font Info > Stems; In <i>Font Info › Stems</i>, you can control the vertical standard stems that correspond to x-direction hinting, as well as the horizontal PS standard stems that correspond to y-direction hinting. The table in the dialog shows the <i>Name</i>, <i>Width</i> and <i>Tags</i> of the stems.\n\nClick the diamond-shaped **Auto-detect stems** to automatically build a list of standard stems found in the font. This will be done by analyzing the PS hint values found in the font, which means that the font needs to have hinting.\n\n<b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> any of the stems in the table to edit the information.\n\nUse the **Add horizontal stem** or **Add vertical stem** buttons to add horizontal or vertical stems perfectly. <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the newly added entry to edit the details.\n\nUse the **Remove stem** button to delete a stem selected in the table.\n\nSelect **Horizontal Stems**, **Vertical Stems** or both to choose whether which ones to edit in the text boxes above.\n\nUse the **Copy stems** or **Paste stems** buttons at the bottom-right to copy or paste all the stems from one font to another.\n",
  "dialog.fontinfo.unicoderanges": "Font Info > Unicode Ranges; Use the <i>Font Info › Unicode Ranges</i> section to specify the supported Unicode ranges in the font, as specified in the OS/2 table.\n\n**To select supported Unicode ranges automatically**, click the <i>Detect Unicode ranges</i> button. FontLab will analyze the Unicode information available in the font and will automatically detect which unicode ranges this font supports.\n\n**To add a Unicode range to the list of supported ranges**, select a Unicode range in the list.\n\n**To remove a Unicode range to the list of supported ranges**, uncheck it in the list.\n\n**To reset the list of supported Unicode ranges**, click the <i>Remove all selected Unicode ranges</i> button.\n\nUse the <i>Filter</i> field below the list to search for a Unicode range.\n",
  "dialog.fontinfo.zones": "Font Info > Zones; In <i>Font Info › Zones</i>, you can define zones or areas where hinting will align points. The dialog is divided into two: the table on the left shows top zones, and on the right shows bottom zones. Each table shows the <i>Name</i>, <i>Position</i>, <i>Height</i> and <i>Tags</i>.\n\nUse the **Local zones / Family zones** toggle to choose whether you want to edit zones locally or for the entire family.\n\nClick the diamond-shaped <i>Auto-detect zones</i> **to automatically (re)build alignment zones** for the font. FontLab will do so by analyzing the bounding boxes of a hardcoded list of uppercase and lowercase English letters.\n\nTo add a top or bottom zone, click the appropriate plus-shaped **Add zone** button, and then <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the newly added entry to edit the details.\n\nTo remove a top or bottom zone, select it in the list and click the appropriate minus-shaped **Remove zone** button.\n\nUse the **Copy zones** or **Paste zones** buttons at the bottom-right to copy or paste all the zones from one font to another. \n",
  "dialog.generateglyphs": "Generate Glyphs; The <i>Generate Glyphs</i> dialog is used to generate new glyphs with greater control than the <i>Add Glyphs</i> command. With <i>Generate Glyphs</i>, you can choose whether the resulting glyphs should be simple, composite or auto glyphs.\n\nIn the dialog’s status bar, you can select between five options: <i>Characters</i>, <i>Ligature</i>, <i>Variants</i>, <i>Precomposed</i> and <i>Custom</i>. The first four tabs work based on a selection in the <i>Font Window</i> or <i>Glyph Window</i>. The <i>Custom</i> tab allows you to type or paste your own glyph recipes using a special syntax. Use the **Size** dropdown to change the size of the preview text string at the bottom of the dialog.\n\nOn the left of the dialog, you can control the following:\n\n* Select **Use anchors** to make use of any anchors you have created in the source glyphs to position them together. This is usually desirable, and is most commonly used for better positioning of diacritical marks (accents).\n\n* Select **Link as references** to create the generated glyphs using References to the Elements in the original glyphs. This too is commonly used for accented glyphs, and sometimes for ligatures as long as no changes are needed to the elements.\n\n* Select **Rebuild existing glyphs** to overwrite existing glyphs if the newly added glyphs have the same names.\n\n* Select **Create auto layers** to generate the glyphs as auto glyphs: elements will be added as references, anchors will be used to position them if present in the primary glyphs, the advance width will be inherited from the base glyphs, and the contents of the generated glyphs will automatically fill and update over time as you add new base and mark glyphs. The recipes that you’ve used to generate the auto glyphs will be copied into the glyph recipe field of the glyphs’ auto layers.\n\n* When **Open new glyphs for editing** is turned on, FontLab will generate the requested glyphs and then immediately open them for editing in a new Glyph window. When turned off, FontLab will just generate the glyphs.\n\nAt the bottom of the dialog, in the status bar, select **Flag new glyphs** and use the adjoining **Color** dropdown to color-code the cells for your newly-generated glyphs. Click **OK** to generate glyphs.\n",
  "dialog.generateglyphs.characters": "Generate Glyphs > Characters; To generate glyphs using <i>Generate Glyphs › Characters</i>, first select them in the <i>Font window</i> or type/paste/select a string in the <i>Glyph window</i> using the <i>Text tool</i>, and then open this tab of the dialog. \n\nFontLab will try to **generate a glyph for every character of your input selection**. Eg: if your input selection was the text `fön`, FontLab will try to generate the glyphs `f`, `odieresis` and `n`.\n",
  "dialog.generateglyphs.custom": "Generate Glyphs > Custom; In <i>Font › Generate Glyphs › Custom</i>:\n\n- Put multiple glyph names in one or more lines to use built-in glyph recipes.\n- Turn **on** <i>Use simple (FLS5) syntax</i> and put each glyph recipe in a separate line to mix both simple and extended syntax: a recipe prefixed with `!` uses extended syntax (`!Aacute = A + acute`), otherwise simple syntax (`A+acute=Aacute`).\n- Turn **off** <i>Use simple (FLS5) syntax</i> to only use extended syntax (one glyph recipe per line).\n",
  "dialog.generateglyphs.ligature": "Generate Glyphs > Ligature; <i>Generate Glyphs › Ligature</i> can be used to **generate generate a single glyph which horizontally combines the glyphs** from the input selection. Eg: if your input selection was the text <i>fön</i>, FontLab will try to generate the glyph <i>f</i>odieresis<i>n</i>. To make your input selection, select the relevant glyphs in the <i>Font window</i> or type/paste/select them in the correct order in the <i>Glyph window</i> using the <i>Text tool</i>.\n",
  "dialog.generateglyphs.precomposed": "Generate Glyphs > Precomposed; Use <i>Generate Glyphs › Precomposed</i> to **generate a single glyph that overlays all glyphs from the input** you have selected in the <i>Font window</i> or <i>Glyph window</i>. The advance width of the new glyph will be equal to the width of the first glyph from the input selection, and this method will position the overlaid glyphs using anchors if they are present in the source glyphs.\n",
  "dialog.generateglyphs.variants": "Generate Glyphs > Variants; Using <i>Generate Glyphs › Variants</i>, you can **automatically generate variant glyphs** for each glyph that you have selected in the <i>Font window</i> or <i>Glyph window</i> as input.\n\nEnter the appropriate **Suffix** for the variants in the field on the left of the dialog, or use the dropdown to select from suffixes used for OpenType features.\n\nEg: if your input selection is the text `fön` and you specify the suffix `ss01`, FontLab will try to generate the glyphs `f.ss01`, `odieresis.ss01` and `n.ss01`.\n",
  "dialog.generateinstance": "Generate Instance; The <i>Generate Instance</i> dialog is used to add new instances to the list of predefined instances of a variable font, to create a font master or a separate single-master font based on the selected position in the design space.\n\nIn the top **list of predefined instances** select one of the instances that are already in the variable font. Use the **axes sliders** to pick a position in the design space. The current **instance preview** is shown below the list of sliders.\n\n**To add the current position to the list of predefined instances**, click the <i>Add Instance</i> button.\n\n**To create new font master using the current design position**, click the <i>Add as Master</i> button.\n\n**To create new single-master font using the current design position**, click the <i>Create as Font</i> button. New font will be opened in the separate Font window.\n",
  "dialog.manageworkspaces": "Workspaces; Use the Workspaces dialog to manage your workspaces. The dialog shows a list of all workspaces.\n\n**To rename a workspace**, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> its name.\n\n**To activate a workspace**, select in the list and click <i>Activate</i>.\n\n**To delete a workspace**, select it in the list and click the minus-shaped <i>Remove selected workspace</i>.\n\n**To add an external workspace file**, click the <i>Open workspace file</i> button.\n\n**To export a workspace**, select it in the list and click the <i>Save selected workspace to the file</i> button.\n",
  "dialog.overlayfonts": "Overlay Fonts; Use the <i>Overlay Fonts</i> dialog to apply a different colors to every layer of one or more selected fonts to create chromatic fonts. The dialog has a local toolbar on the top, the list of source fonts used below that, current layer properties on the left and overlay preview at the bottom.\n\nClick **Add Family Members** to add any open fonts belonging to the same family as the fonts already in the sources in this dialog.\n\nClick the **Duplicate current font** button in the local toolbar to create a copy of the currently selected source in this dialog.\n\nUse the **Size** dropdown to change the size of the preview string.\n\nClick inside the overlay preview to modify the preview string.\n\nSelect a font in the list of sources by clicking on it in the list. Now you can edit its properties on the left of the dialog:\n\n* **Font layer color** is shown as a standard color palette that includes the grayscale bar, black and white colors; and an additional popup palette with common colors below it. Use either to apply a color to the glyphs of the current layer.\n\n* Set the **Opacity** of the current layer using this slider.\n\n* You can also use the numeric **Color value** (RGB and hex) to set the color.\n\n* Enter the **X and Y offset** values in font units to move the layer. Use negative values to move left and/or down.\n\n* Use the **Scale factor** to reduce or enlarge glyph images.\n\n* Use the **Align** dropdown to align the glyph images to the left, right or center.\n\n* Enter the **Blur** value to soften edges of glyph images on the current layer. This effect can be used to imitate glyphs’ shadows. Use values below 10% for better results. Blurring by 50% and more may take several minutes.\n\nSelect **Overlay to elements** to create the overlayed font with a single layer. FontLab will put two (or more) overlapping elements in each glyph.\n\nSelect **Overlay to layers** to create the overlayed font with two (or more) layers.\n\nWhen you are satisfied with the overlay preview, click **OK** to create the new font.\n",
  "dialog.preferences": "Preferences; The **Preferences** dialog allows you to search, open, save, and reset preferences.\n\nUse the <i>Search</i> field on the top-right of the dialog **to search for any section of Preferences**.\n\n**To apply the changes you have made** in the dialog, click <i>Apply</i> then <i>Ok</i>.\n\n**To save your preferences**, use the hamburger menu on the left and click <i>Save Preferences...</i>. When you save your Preferences, all your settings are saved in an external file, including your password for your Digital Signature (DSIG) (if you saved that in your Preferences).\n\n**To open a preference file**, select <i>Open Preferences...</i> in the hamburger menu and a default Open dialog comes up. You can select a preferences file here.\n\n**To reset preferences** and go back to default settings, choose <i>Reset to Defaults</i> in the hamburger menu on the top-left of the dialog. \n",
  "dialog.preferences.autohinting": "Preferences > Autohinting; You can customize the following options for PostScript and TrueType Autohinting in <i>Preferences › Autohinting</i>:\n\n* **PostScript Autohinting**\n  \n  * If **Remove existing hints when autohinting a glyph** is on, and you run <i>Tools › Autohint</i>, FontLab will remove the existing glyph hints before calculating new hints.\n  \n  * If **Convert hints to links when autohinting** is on, and you run <i>Tools › Autohint</i>, hints will be converted to links. Links are “dynamic hints” — when you move nodes, the links will follow your design changes.\n\n* **TrueType Autohinting**\n\n  * If **Generate triple hints** is active, FontLab will try to generate TrueType instructions that simulate PostScript triple hints for characters like ‘m’ where the distance between stems must be kept the same at all PPMs.\n  \n  * Use **Direct links to the center of the glyphs where possible** to customize the hinting direction.\n  \n  * If **Automatically interpolate positions of the cusp points** is on, FontLab will generate an Interpolate command that will link cusp points to one of the links.\n  \n  * If **Try to automatically generate middle delta instructions** is on, FontLab will attempt to generate small middle delta commands at the end of links that connect round parts of the glyph.\n  \n  * Use **Add link to the right sidebearing point** to generate a single, distance-rounded link that will go from the rightmost hinted point to the right sidebearing point. This feature guarantees at least one pixel distance between glyphs on all PPMs.\n  \n  * Select **Interpolate positions of the double links** if you would like FontLab to hint the first stem in a letter like B, which has overlapping stems, and then interpolate the position of the second stem using the interpolation command with the final point aligned to the grid.\n  \n  * In **Single link attachment precision** you can enter a value in this field so FontLab will have a threshold to decide when several points are located along a line. For precise fonts set this value to 1 or 0.\n",
  "dialog.preferences.cousins": "Preferences > Cousins; In <i>Preferences › Cousins</i>, you control the following:\n\n* Whether **Cousin glyphs are filled** <i>if true fill is active</i>, <i>always</i> or <i>never</i>.\n\n* Similarly, you can select whether the outline should be shown, or hidden or mask should be shown **If mask layer is active**.\n\n* Use the **Content appearance** dropdown to select the color for cousins and the accompanying **slider** to define opacity.\n\n* In <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> cousin glyphs++, you can decide whether to use metrics or <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> by a X/Y unit distance. Additionally, you can choose whether it will aligned to the left, right or center of the current glyph.\n\n* Enable **Double+click++ to edit the glyph** if you want to be able to switch between cousins that you’re editing.\n\n* The list shows which glyphs are defined as cousins. Each line shows one group with space-separated Unicode characters or glyph names. **To edit the list of cousins**, click within the blue box and add/delete glyphs.\n",
  "dialog.preferences.curveconversion": "Preferences > Curve Conversion; In <i>Preferences › Curve Conversion</i>, you can customize the following:\n\n* The **Curve conversion** tolerance options are used whenever you convert TrueType to PostScript or vice versa. Use the tolerance controls to define how close to the original should the result be. The less the value the more precise the conversion is. But note that FontLab may add points to make conversion more precise.\n\n* When **Add nodes every two TT off-curve points is active**, FontLab may add unnecessary nodes between off-curve points. If this option is off, unnecessary nodes won't be added.\n",
  "dialog.preferences.defaulttexts": "Preferences > Default Texts; In <i>Preferences › Default Texts</i>, you can edit the default texts for a new text block, sample used in the <i>Preview panel</i> and the sample used in <i>Fonts panel</i>. click any of the texts in the blue box to start editing.\n",
  "dialog.preferences.digitalsignature": "Preferences > Digital Signature; In <i>Preferences › Digital Signature</i>, you can control settings for digital signatures that can be included in the OpenType (TT or PS) fonts that you generate.\n\nIf **Digitally sign exported OpenType fonts** is enabled, a DSIG table will be generated that includes a digital signature. You will also be able to control the following options:\n\n* In **Path to the certificate file (.spc or .cer)**, enter the location of the certificate file you have received from your certification authority.\n\n* In **Path to the private key file (.pvk)**, enter the location of the private key file you have received from your certification authority.\n\n* If **Request private key password every time** is selected, FontLab will ask you for the password for your private key every time you generate a font.\n\n* Or FontLab can remember the password for your private key in the preferences file, if you selet **Use the following password**. Note that when you save your Preferences to an external file, all your settings are saved, including the password for your Digital Signature.\n\n* Select **Generate the time stamp using the following URL** and enter the link to the service that is making time stamps to create time stamps. If empty, a time stamp will not be generated.\n\n* From the **Algorithm to build font data hash** dropdown, choose the algorithm, MD5 or SHA1, that will be used to build the font data hash. MD5 is the default.\n\n* In **Font vendor URL**, you can enter the the URL of the font vendor. This URL must match the one in the certificate file.\n\nIf **Digitally sign exported OpenType fonts** disabled, a “dummy” empty DSIG table is generated and all options described above will be disabled as well.\n",
  "dialog.preferences.distances": "Preferences > Distances; In <i>Preferences › Distances</i>, you can tweak distances to customize the behavior of editing tools:\n\n* In the **Hit to node** field, you can enter the distance around a node where you can click to select it, instead of only clicking on it precisely.\n\n* In the **Hit to guidelines** field, you can enter the distance around a guideline where you can click to select it, instead of only clicking on it precisely.\n\n* In the **Join distance** field, you can define the distance within which two nodes will join when you move one to another.\n\n* If any objects in the <i>Glyph window</i> has “snap-to” turned on, moving a node will cause it to snap to those particular objects if the distance between the node and the object is not larger than **Snap distance** specified here.\n\n* Use **Min curve handle length** to define the minimum length of the handles to display them. To display handles whenever possible, set the value to 1.\n\n* Use **Outline arrow key moves** to define the distance (in font units) by which objects are moved when <i>Arrow</i> keys are used.\n\n* Use **Metrics arrow key moves** to define the distance (in font units) by which sidebearings are moved or kerning value is changed when <i>Arrow</i> keys are used.\n\n* Use **Outline ++Shift+arrow key moves** to define the distance by which objects are moved when <i>++Shift+Arrow</i> keys are used.\n\n* Use **Metrics ++Shift+arrow key moves** to define the distance by which sidebearings are moved or kerning value is changed when <i>++Shift+Arrow</i> keys are used.\n\n* In **Glyph window default zoom level**, you can define what zoom at 100% (<i>View › Zoom 100%</i> or <i>Cmd</i>+3) means. There are four options you can choose from.\n",
  "dialog.preferences.editing": "Preferences > Editing; You can customize how FontLab glyph editing looks and works in <i>Preferences › Editing</i>:\n\n* **Show scroll bars in the Glyph window** is on by default, and you should turn it off if you don’t need scroll bars in the <i>Glyph Window</i> and scroll with the mouse wheel or pan by pressing <i>Space</i> instead.\n\n* Enable **Pinch gesture zooms in the Glyph window** if you would like to zoom in the <i>Glyph Window</i> using pinching gestures. On Windows, if this option is enabled, you need to use <i>Ctrl+Alt</i>-mouse wheel to change the current glyph in the Glyph window. If it is turned off, <i>Ctrl</i>-mouse wheel needs to be used instead.\n\n* If alignment zones are not visible and **Highlight nodes on alignment zones** is enabled, and you move a point into an alignment zone, the zone will become visible again and the node will be highlighted. The highlighting is in a different style when the node is on the zone line versus when it is within the zone.\n\n* When **Pen and Pencil tools can change contour** is turned on drawing with the <i>Pen tool</i> and <i>Pencil tool</i> can add to existing contours.\n\n* When **Force snap to guides** is turned off, a node snaps to a guide only at idle, when you stop your mouse move, so you can move nodes smoothly. But when it is on, the node will snap when the mouse moves.\n\n* Turn on **Marquee selection selects nodes but not handles** if you would like handles inside the marquee selection rectangle to be selected whether or not the nodes on either side are selected. Note that even when this option is turned off, handles between selected nodes are selected.\n\n* Turn on **Clicking on outline selects segment** if you would like to select a segment by clicking on its outline. When this option is off, you can select a segment by <i><b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b></i>-clicking on it.\n\n* When **Pasting contour to another element preserves appearance** is on, copying and pasting contours from/to transformed elements is WYSIWYG: original contours are copied transformed to keep their look in the source element and so are pasted to the destination element.\n\n* When you <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> any point on a curve segment (not the node) and **Curve handles have fixed direction when curve point is dragged** is off, the direction of the handles changes, so you can freely change the shape of the curve segment but you will also change the shape of neighboring curve segments if they connect via a smooth node. If this option is on, the direction of the handles stays fixed, so the change of the current curve segment will be limited, and neighboring segments stay intact.\n\n* If **Show cross** enabled, a crosshair cursor is shown whenever the user moves any nodes.\n\n* When **Holding <b style=\"font-style: normal;\"><b><small>CMD</small></b></b> activates Contour tool** is turned on and some other tool is selected holding down <b style=\"font-style: normal;\"><b><small>CMD</small></b></b> activates the Contour tool temporarily. This option is not available on Windows.\n\n* When **Always show anchor names** is turned on, anchor/pin names are always visible. Otherwise names become visible when the cursor approaches the anchor/pin.\n\n* When **Rapid tool remembers last state** is turned on, the Rapid tool remembers the type of added node (straight or smooth) and continues to add nodes of this type until you <i>Ctrl</i>+click++.\n\n* When **Live preview** is turned on and you edit a contour, you can see the “live” preview of the glyph in other windows or in the Preview panel while you <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the mouse. If turned off, the preview is updated at idle or when you release the mouse. This preview may be slow. \n\n* Use the options in **Glyph window property bar** to select where the <i>Property bar</i> will be placed in the <i>GLyph window</i>: at the top (default) or the bottom.\n",
  "dialog.preferences.fontwindow": "Preferences > Font Window; In <i>Preferences › Font Window</i>, you can customize how the <i>Font Window</i> looks and works:\n\n* In **Default Mode**, you can select whether you want to see new, imported or opened fonts in <i>Encodings</i>, <i>Unicode</i>, <i>Codepage</i>, <i>Category</i>, <i>Script</i> or <i>Index mode</i>. The default option is <i>Encodings</i>.\n\n* From the **Default encoding** dropdown, you can choose between a variety of OpenType or Type 1 encodings to filter glyphs in the Font window/Font Map panel. The default encoding is used for all new and imported fonts.\n\n* In **Default sorting**, which is set to <i>Unicode</i> by default, you can select your preferred mode of sorting in the Font window. \n\n* In **Cell caption properties**, you can select:\n  1. Whether **Cell caption** will be positioned at the top or bottom of the the cell. \n  2. A different **Caption font** or reset it to the original.\n  3. The **Caption size** to auto, small, medium or large. \n  4. Whether **Caption content is editable** is on or off. The option is off by default, and ff you turn it on you can edit the caption directly in the cells of the Font Window. \n  5. If the **Colorize numeric captions** is checked. If it is, cell captions with numeric information will be automatically colorized. Numeric captions are those showing glyph width, LSB, RSB, top or bottom of the glyph bounding box, number of elements, script or age. Cells in the List sidebar will also be colorized.\n\n* If **Open single glyph in existing Glyph window** is checked, then every time you open a single glyph from the <i>Font window</i>, it will be opened in the existing <i>Glyph window</i> replacing what is in the window at the time.\n\n* Use the **Background** dropdown to select the background color for cells with glyphs. This is white by default.\n\n* Use the **Highlight** dropdown to select the background color for cell captions.\n\n* Use the **Brightness** dropdown to select the color for the color flags. Color flags for cells are pale and desaturated by default. By modifying the transparency of the color flags using this slider, you can make them more or less bright.\n\n* Use the **Placeholder Font** option to select the font that will be used as template for empty glyph cells. click <i>Reset</i> to set the font back to the default. \n\n* Choose one of the options from **Absent glyphs** to select how absent glyphs will be shown in the <i>Font window</i>.\n\n* Check **Show grid lines** to see the lines that define the cell grid.\n\n* If **Show glyph metrics if cell is larger than “x” pixels** is selected then advance width is shown with a lighter background so left and right glyph sidebearings are visible.\n\n* **Show hinting icons** small hinting marks in the lower left corner of glyph cells that have hints.\n\n* **Show note icon** shows the note icon on glyphs that have notes.\n\n* If **Show note text if possible** is checked, FontLab will try to display the note text if the cell size is large enough to fit it.\n\n* In the **Unicode-name mapping** field, you can enter the path to the external file that contains glyph name to Unicode mapping rules. This operation requires the application to be restarted to be applied.\n\n* If **Interpret glyph name to generate Unicode index** is selected, FontLab will generate Unicode indices XXXX from names such as uniXXXX or uXXXX .\n\n* Use **Unicode index format** to select how Unicode numbers are shown: uppercase XXXX or lowercase xxxx. This doesn't affect  exported fonts.\n",
  "dialog.preferences.general": "Preferences > General; In <i>Preferences › General</i>, you can make the following customizations:\n\n* There are three types of **Windows and tabs configuration** in FontLab that you can choose from:\n\n  1. <i>All fonts and glyphs open in tabs</i>. In this option, you can undock tabs to turn them into separate windows, and you can dock windows back.\n  2. <i>Fonts open in windows, glyphs open in tabs</i> \n  3. <i>Fonts and glyphs open in windows</i>. In this option, windows can still be docked manually to form tabs.\n\n* If **Font has at least one Font window** is active, a new Font Window appears every time you open, import or create new font, and closing the last Font window means closing the font.\n\n* If **Font Map and Fonts panels control fonts** is active and you open a font, a new Font Window doesn't appear. Instead you can control opened fonts in the Fonts panel and see glyph cells in the Font Map panel. Closing the last font window for the font won't close the font itself. It will remain open and seen in the Fonts panel.\n\n* When **Activate panels depending on type of activated objects** is active and you have multiple panels open in a tabbed panel group, selecting a particular object in the Glyph Window will bring the corresponding panel to the front. The panel is activated only if it was opened through <i>Window › Panels</i>.\n\n* **Close Glyph window sidebar after “x” minutes of inactivity** allows you to change the idle time after which the Glyph window sidebar is automatically closed. If you do not want it to close based on inactivity, uncheck this option.\n\n* **Open Sketchboard on startup** becomes available if you have chosen the second or third Windows and tabs configuration option. With this option, you can choose to open or not open the Sketchboard automatically on startup. In the first configuration, the Sketchboard always opens regardless of the setting.\n\n* **Autosave Sketchboard every x minutes** allows you to set the interval of saving the Sketcboard in minutes. FontLab saves the contents of the Sketchboard window in <i>~/Library/Application Support/FontLab/FontLab/sketchboard.vfc</i> on macOS or in <i>~\\AppData\\Local\\Fontlab\\Fontlab VI\\sketchboard.vfc</i> on Windows on exit.\n\n* FontLab checks for updates and notifies you when an update is available. Updates are downloaded and installed only when you choose to download and install them. To not allow FontLab checking for updates every time it starts, turn off **Check for updates at startup**. **To manually check for the latest updates**, click the <i>Check for updates now</i> button or use the <i>FontLab › Check for Updates</i> menu.\n\n* Use the option in **Developer/Experimental Preferences** to do tests and identify possible issues:\n\n  1. **OpenGL** allows you to turn on OpenGL, a library for graphic computing.\n  2. **Preview keystrokes** shows every typed key on the screen, what can be used while doing a screen recording to report a problem. \n",
  "dialog.preferences.glyphwindow": "Preferences > Glyph Window; In <i>Preferences › Glyph Window</i>, you can make the following customizations:\n\n* You can select between five different options for **Node size**.\n\n* When the middle **Node style** option is selected (default), any node whose handles are aligned perfectly vertically or horizontally (or corner node whose adjacent line is almost vertical/horizontal) will be a darker solid color. Any node that does not meet such a test will be lighter and outlined. This helps identify points that are not quite where you intended, or are not quite proper extrema.\n\n* You can also select between three options for **Node color**.\n\n* Similarly, you can select how **Inactive nodes** are displayed — invisible, black or in color.\n\n* In **Open contours**, you can select whether they should rendered filled or unfilled.\n\n* Use the dropdown in **Show coordinates for current node and selected/all nodes** to select whether you want to see the coordinates of only selected nodes or all nodes when <i>View › Show › Coordinates</i> is on. If you choose the first option, coordinates of unselected nodes will only be shown when they are under the cursor.\n\n* You can set the size of text for coordinates of the current node using the field in **Font size for the current node coordinates**.\n\n* In **Show node name**, you can select whether the names of nodes (if they have a name) should be visible, invisible or along with the node’s coordinates.\n\n* If **High contrast rendering** is selected, items like metrics lines, guides, grid, etc. will be displayed with more contrast.\n\n* If **Glow contour selection** is selected, the selected contour gets an additional glowing effect (which is invisible on non-Retina screens).\n\n* Use the **Outline thickness** dropdown, you can choose how thick glyph outlines should be in the <i>Glyph window</i> — thin, normal or thick.\n\n* When **Pixel-perfect rendering** is turned on, the rendering of outlines, nodes, guides, sidebearings, font metrics and the crosshair will be rounded to full screen pixels, so all lines drawn in the <i>Glyph window</i> will be sharper, especially on non-Retina screens.\n\n* Use the **Quick measurement** dropdown to choose whether FontLab will show the stem thickness only <i>on the stem</i> (which is default), <i>never</i>, when the cursor is <i>on the contour edge</i> or <i>everywhere</i>, when it will measures not only stem thickness but also the distance between stems or stems and sidebearings.\n\n* Use the **Glyph fill transparency** slider to choose the opacity of filled outlines when you edit them. \n\n* Use the **Curvature** slider to customize the transparency for curvature.\n\n* Use the **Workspace b/g** dropdown to customize the background color for the <i>Glyph window</i> in the <i>Text</i> and <i>Editing</i> modes.\n\n* Use the **Mask b/g** dropdown to customize the background color for the <i>Mask layer</i>. \n\n* Use the **Mask color** dropdown to choose the color for outlines in the <i>Mask layer</i>.\n\n* Use the **Global mask color** dropdown to choose the color for outlines in the <i>Global Mask</i>.\n",
  "dialog.preferences.grid": "Preferences > Grid; In <i>Preferences › Grid</i>, you can customize the following:\n\n* In **Gridline distance**, you can define the distance between vertical and horizontal gridlines.\n\n* In **Slant angle**, you can define the angle for slanted vertical gridlines, which has to be within the -45˚+45˚ range. If you select **Follow the font’s italic angle**, an oblique font will be displayed with a slanted grid and sidebearings, and an upright font will be displayed with a vertical grid regardless of the slant angle that has been defined.\n\n* Use the **Gridlines color** dropdown let you to change the color of guidelines, and the use the **slider** to define their opacity.\n\n* Use the **Dots opacity** slider to change the opacity of gridlines intersections.\n\n* If **Round nodes, guides and anchors to grid points** is turned on, snapping to the grid becomes “strong” so that nodes, guides and anchors (but not handles) will snap to it immediately. If this setting is off, it will override the setting <i>Show › Snap › Grid</i> for nodes, anchors and guidelines. \n",
  "dialog.preferences.openfonts": "Preferences > Open Fonts; Options in <i>Preferences › Open Fonts</i> are applied to fonts when they are opened and imported in the application:\n\n* If **Detect tags for alignment zones** is on, FontLab will automatically assign tags to alignment zones when a font is imported.\n\n* If **Make friendly glyph names** is on, glyphs with names like \"uniXXXX\", \"uXXXXX\" and \"afiiXXXXX\" will be renamed to friendly names during import.\n\n* If **Change CID names to Unicode names when Unicode index in known** is on, which is default, FontLab names glyphs using its regular glyph naming heuristics when importing CID-keyed PostScript fonts. If you want glyphs named by CID number turn this option off.\n\n* If **Detect element references** is selected, FontLab will check glyphs in the font being opened or imported, and find identical elements. One of the found identical element will become the primary element, while others will be replaced by locked references to the primary one. If this option is unchecked, you can detect element references manually using <i>Font › Detect Element References</i>.\n\n* In the **Composite glyphs** section you can choose how composite glyphs in the font being opened or imported should be handled:\n  1. If you select **Convert to elements**, the components of the glyph will be converted to **element references** that can be manually unlocked and edited in place.\n  2. If you select **Keep as component elements**, the components will be references to **primary glyphs** that change when the primary is modified and cannot be manually edited in the glyph. \n\n* **OpenType features** controls the decompilation and compilation features:\n  1. If **Decompile binary features** is checked, the application will decompile any OpenType features in the font being imported, and present them as text that can be edited in the <i>Features panel</i>.\n  2. If **Compile feature definitions** is checked, FontLab will try to compile features imported from VFB and UFO file formats. This builds binary GPOS and GSUB tables (in memory), so they can be applied in the <i>Glyph window</i>.\n\n* In **Glyph contours**, if you check **Convert TrueType curves into PostScript curves**, the application will automatically convert the outlines on import. Curves are converted according to the settings set on the <i>Curve Conversion</i> section of the Preferences dialog.\n\n* FontLab can detect smart nodes automatically. In the **Detect smart nodes**, you can check whether you would like the application to detect **Servant nodes**, **Genius nodes** or both.\n",
  "dialog.preferences.operations": "Preferences > Operations; <i>Preferences › Operations</i> allows you to customize a number of different commands from <i>Font</i>, <i>Glyph</i> and <i>Element</i> menus:\n\n* Within **New glyph**, if **fill created glyphs with content when available** is turned on (which is the default), then when you <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> an empty glyph cell in the Font window or when you use the <i>Font › Add Glyphs</i> command, FontLab will create the glyph, and then it tries to generate the glyph as a composite or auto glyph in all font masters: the glyph layers are created and element references are added to the them. If <i>create auto layers is possible</i> is also checked, FontLab will generate the glyphs as auto glyphs, so their contents will automatically update when you add or modify primary glyphs later.\n\n* Use the **Power guides** dropdown to select whether <i>element and glyph guides</i> (which default), <i>only element guides</i>, <i>element, glyph and font guides</i>, <i>element, glyph and font guides and zones</i> or <i>all guides, zones and font metrics</i> should be used when you call the <i>Glyph › Add Power Guides</i> command.\n\n* **Precision** and **Smoothness** inside **Autotrace** can be used to tune up the autotracing algorithm which is called from the <i>Element › Image › Autotrace</i> and <i>Element › Image › Separate and Trace</i> operations.\n\n* If **Lock all element references except the primary element** is selected, when FontLab automatically creates element references, it will lock all references except the primary element. To keep all references unlocked, unselect this option.\n\n* If **recognize alphabetic characters during optical separation** is selected, FontLab will recognize characters and convert to outlines letters during <i>Element › Image › Separate and Trace</i>. Currently, this can be done in two languages: English and Russian, which can also be selected here.\n",
  "dialog.preferences.pasteduplicate": "Preferences > Paste & Duplicate; <i>Preferences › Paste & Duplicate</i> contains the following options:\n\n* **Duplicate offset**, set to 100/50 by default, controls the distance by which duplicated outlines are offset from original ones when they appear.\n\n* **Copy/Paste offse**, set to 0/0 by default, controls the distance by which copied outlines are offset when they are pasted.\n\n* Use **Scale artwork** to choose how artwork should be scaled and aligned. The options are <i>Do not scale or align</i>, <i>Align only</i>, <i>Scale to UPM, align to descender</i>, <i>Scale to ascender - descender</i>, <i>Scale to caps height - baseline</i> and <i>Scale to caps height - descender</i>.\n",
  "dialog.preferences.savefonts": "Preferences > Save Fonts; In <i>Preferences › Save Fonts</i>, you can make the following customizations:\n\n* Choose between a **Silent first save** or opening the **Save File dialog**:\n  1. If you choose the first option, **First save in specified folder with autogenerated file name** and you save a font for the first time, in will be saved in the <i>First save folder</i> specified below. \n  2. If **Ask for the font file name** is selected, the application will show you the Save File dialog where you can enter both the name and location for the file you are saving.\n\n* In **Save VFC and also**, you can select what font formats you want the files to be saved by default, apart from the proprietary binary format .VFC. The other formats available are UFO, VFB and VFJ.\n\n* In the **First save folder** field, you can enter the path to the location where new and imported fonts will be saved by default.\n\n* Use **Autosave opened fonts every _n_ minutes** to activate autosave and enter the time interval (in minutes) at which you want to save the font. Font will be saved in the <i>Autosave</i> folder within the FontLab user data folder. If Autosave was active and you have a system or program crash, you can open your last saved font here.\n\n* In the **Default rasterization PPM** field, you can add the value that will be used to set the resolution for rasterization if it has not been explicitly set.\n\n* Check **Add indentation and spaces while exporting FontLab JSON (.vfj) font file** if you would like the JSON to be indented. Bear in mind that this will increase the file size.\n",
  "dialog.preferences.spacing": "Preferences > Spacing; In <i>Preferences › Spacing</i>, you can control the following:\n\n* If **Align text to top-left when spacing mode is activated** is selected, in the <i>Metrics</i>, <i>Kerning</i> or <i>Text mode</i> the text block showing glyphs is aligned to the top and left of the window. You cannot pan the contents until you zoom-in close enough.\n\n* When **Double-clicking to glyph in Metrics mode opens it for editing** is selected, it emulates the FLS 5 behavior of opening glyphs for editing if they are double-clicked in the <i>Metrics mode</i>.\n\n* Turn off **Glyph can be dragged within the advance width in Metrics mode** to not allow dragging glyphs when editing metrics. Only sidebearing lines can be dragged if this option is off.\n\n* When **Inactive kerning pairs are editable** is turned on, all glyphs (except the first one) in a line can be dragged to change kerning. It is off by default so only the current and the following glyph can be dragged.\n\n* If **Automatically update linked metrics** is selected, linked metrics will be updated on the fly. This operation may be very slow. If this option is turned off, you must use the <i>Font › Update metrics</i> menu command to update linked metrics.\n\n* Use the **Metrics lines** dropdown to select a custom color for the vertical lines representing left and right sidebearings.\n\n* Use the **Metrics b/g** dropdown to customize the background color of the <i>Glyph window</i> when the <i>Metrics tool</i> is activated.\n\n* Use the **Kerning b/g** dropdown to customize the background color  of the <i>Glyph window</i> when the <i>Kerning tool</i> is activated.\n\n* You can edit the tolerance values in **Auto kerning** to control automatic kerning creation in the <i>Pairs and Phrases panel</i>.\n",
  "dialog.preferences.texts": "Preferences > Texts; In <i>Preferences › Texts</i>, you can define the sample texts that appear in the <i>Text</i> dropdown in the Property bar of the Glyph window. The left pane lists all the titles, and on the right you can see the selected sample.\n\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> a text title to see the sample on the right. The samples are editable.\n\n- <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> a title to edit it.\n\n- Use <i>+</i> to add a new sample.\n\n- Use <i>-</i> to remove a selected title.\n",
  "dialog.preferences.variations": "Preferences > Variations; In <i>Preferences › Variations</i>, you can make the following customizations:\n\n* Turn on **Preview master color** to see either a bar on top of the <i>Glyph window</i> in the color selected for the master you are currently editing; or the same color as background. Under this section, you can choose between the **Bar** and **Background**, define the thickness of the bar and the brightness of the background (the color of both is defined in the <i>Layers & Masters panel</i>).\n\n* Turn off **Show #instance layer** to hide the #instance layer containing interpolation results.\n\n* The settings in **Synchronize in matching masters** allow you to perform an editing action on the current master and have the same action “replayed” on all other masters that match the current master. As a result, your editing actions affect all compatible masters at once. The setting are:\n  * If **Insert node** is selected, it keeps masters compatible when you add a node to a contour on one of the masters. The new interpolated node is added on the corresponding contour in other masters automatically. But if you add a new contour, masters will lose their compatibility.\n  * **Rename node**, if selected, renames nodes across masters.\n  * If **Remove node** is selected, it keeps masters compatible when you delete a node on one of the masters. The corresponding node is deleted in other masters automatically. If you delete a contour, the corresponding contour is removed on other masters as well.\n  * **Add and rename guide**, if selected, adds a guide on all matching masters whenever you add a guide in the current master. If you rename a guide in one master, the guides with the same old name on other matching masters will get the same new name.\n  * **Add hint**, if selected, allows you to add a hint on all matching masters.\n  * If **Add or remove anchor** is selected, it allows you to add an anchor on all matching masters in the same position, and removes anchors from all matching masters that have the same name as the anchor you’re removing from the current master.\n",
  "dialog.profiles": "Profiles; In the Profiles dialog, you can activate/deactive default profiles and create/remove custom ones. A profile is a group of settings for exporting fonts, in a particular format.\n\nOn the left of the dialog are names of profiles. FontLab has the following default profiles: OpenType TT (.ttf), OpenType PS (.otf), FontLab (.vfc), FontLab JSON (.vfj), UFO Package (.ufo), FontLab Classic (.vfb), PostScript Type 1 (.pfb), DesignSpace+UFO (.designspace), OpenType Variations (.ttf), Web TT (.ttf, .eot, .woff) and Web PS (.woff2, .woff). These profiles are not editable. \n\n**To see the details of a profile**, select it in the list on the left.\n\n**To activate a profile, i.e. see it in the Export Font As dialog**, select the checkbox to the left of the profile name in the list. If the checkbox is blue, the profile is activated.\n\n**To deactivate a profile, i.e. remove it from the Export Font as dialog**, unselect the checkbox to the left of the profile name in the list.\n\n**To add a new profile**, select a profile in the list and press the plus-shaped <i>Add profile</i> button. This will create a duplicate of the selected profile that you can now edit. In a custom profile, you can edit the following options:\n\n* **Parameter**\n  \n  * In **Profile name**, enter the name of the profile as it appears in the Export Font dialog.\n\n  * In **Profile subfolder**, enter the name for the folder where exported fonts appear if the <i>Profile</i> option in the Export Font dialog is turned on.\n\n* **Format Settings**\n\n  * Use the **Format** dropdown to select the\tgeneral font file format\n  \n  * Select **Use legacy format version** if you would like FontLab to do that.\n  \n* **Outlines**\n\n  * Use the **Curve Conversion** dropdown to choose whether all curves should be converted to PostScript or TrueType or be lest as they are. Note that curves will be converted if the particular format requires it.\n  \n  * In the **Conversion tolerance** dropdown you can choose whether to keep the tolerance for conversion the same as has been specified in <i>Preferences</i>, or a different value depending on the size of the file.\n  \n  * Select **Correct contour direction** if you would like FontLab to fix the contour direction according to specification requirements.\n  \n  * Select **Remove overlaps** if you would like FontLab to merge overlapping parts of contours. This is needed for traditional non-variable final font formats but is not needed for development or variable formats.\n  \n  * Turn on **Nodes at X extremes** to place nodes at horizontal extreme coordinates.\n  \n  * Turn on **Nodes at Y extremes** to place nodes at vertical extreme coordinates.\n  \n  * Select **Clean Up** to remove unnecessary nodes.\n  \n  * Use the **Round Coordinates to UPM grid** dropdown to choose how rounding of the contour points to the integer grid is performed. <i>Keep fractional nodes and handles</i> is the default, but rounding is always performed for TTF and VFB.\n  \n  * Select **Open contours** if you would like open contours to be exported.\n  \n* **Compression**\n\n  * Use the **TTF: use composites** dropdown to choose how TrueType outlines will be compressed by defining how composite and auto glyphs will be exported.\n  \n  * Select **OTF: use subroutines** to use CFF subroutine compression to reduce file size of OTF fonts. Checking this option leads to lossless compression, but export may be slow in large fonts or fonts will many repeating elements.\n  \n  * Select **UFO: compress as .ufoz** to save UFO files in compressed form (.ufoz). Note that this format may not be compatible with other 3rd aprty apps.\n  \n* **Hinting**\n\n  * Turn on **Use Hinting** to export hints and generate a hinted font. This option should be off for very complex or rough designs.\n  \n  * Use the **Autohint** dropdown to select what glyphs should be autohinted: none, unhinted ones or all.\n  \n  * Select **Use x-direction hints** to exported vertical hints.\n  \n  * Select **Recalc zones** to automatically recalculate safe top and bottom zones. If this option us turned off, existing zones are used.\n  \n  * Select **Recalc stems** to automatically recalculate standard stems. If this option is turned off, existing defined stems are used.\n  \n* **TrueType Hinting**\n\n  * Use the **TrueType hinter** dropdown to choose the hinting method: the one specified in FontInfo, <i>FontLab TTH</i> that allows manual hinting, or <i>TTF Autohint</i> that always autohints the font.\n  \n  * Select **Use existing visual TTH commands** if you would like FontLab to compile visual hints (if defined) into low-level TT hinting instructions (FontLab TTH only).\n\n  * Select **Use imported TrueType native hinting** if you would like FontLab to write the imported low-level TT hinting instructions (FontLab TTH only).\n  \n  * Select **Rebuild PS hints** if you would like PostScript hints to be automatically rebuilt before running FontLab TTH (FontLab TTH only).\n\n* **Glyph Organization**\n\n  * Turn on **Add required glyphs** to add missing required glyphs: .notdef, NULL, CR, space.\n  \n  * Select **Sort glyphs in optimal order** to apply the glyph ordering (physically reorders glyphs in the font) which is optimal for the Format.\n  \n  * Use the **Glyph names** dropdown to select how glyph names are included in the font.\n  \n* **Features and Kerning**\n\n  * Use the **Export OpenType features** dropdown to choose if feature code should be compiled only if binary is not present, or of it should be always compiled, or never.\n  \n  * Use the **OpenType kerning** dropdown to choose if the <i>kern</i> feature is created, if it should export the existing <i>kern</i> feature, or if it should be exported without OT <i>kern</i>.\n  \n  * Use the **OpenType mark attachment** dropdown to choose if <i>mark</i> and <i>mkmk</i> features are created, the existing ones are exported, or if it should be exported without the features.\n  \n  * Turn on **Export legacy TrueType kerning** to export the plain 'kern' table, which is used in old applications. FontLab will expand class kerning to build plain pairs.\n  \n  * In the **Max legacy TrueType kerning pairs** field, enter the number of pairs in <i>kern</i> table that will be exported; extra pairs will be ignored.\n\n* **Export Web font files**\n\n  * Turn on **WOFF2: modern browsers** to export WOFF2 font file.\n  \n  * Turn on **WOFF: most browsers** to export WOFF font file.\n  \n  * Turn on **EOT: for IE (TT-only)** to export Microsoft EOT font file.\n\n* **Export color font files**\n\n  * Select **OpenType+SVG: Adobe/Mozilla** to export color OpenType+SVG font.\n  \n  * Select **OpenType+COLR: Windows** to export color OpenType font with COLR+CPAL tables.\n  \n  * Select **OpenType+sbix: macOS & iOS** to export OpenType font with Apple's sbix bitmap table.\n  \n  * Select **OpenType+CBDT: Android** to export OpenType font with CBDT bitmap table.\n",
  "dialog.renameglyph": "Rename Glyph; The <i>Rename Glyph</i> dialog can be used to rename the current glyph. The dialog shows the current name and unicode of the glyph, followed by the following options:\n\n* To change a glyph’s name enter a new one in the **New name** field. If this glyph has a properly assigned Unicode codepoint and you want to find the name mapped to that index in FontLab database press the **Update** button to the right of the field.\n\n* Use the **New Unicode** field to enter the glyph’s new Unicode codepoint(s). You may enter more than one Unicode codepoint separated by a space: this will cause the glyph to be associated with multiple codepoints. Use the **Update** button to find the Unicode codepoint(s) mapped to a glyph’s name in FontLab’s database.\n\n* If the option **Replace existing glyphs with the same name** is not checked, and you enter a name that is already assigned to one of the font’s glyphs, the <i>Rename</i> button will be disabled and you will not be able to assign that name. Switch the option on to allow FontLab to replace glyphs.\n\n* Select **Keep replaced glyphs with the new name** to keep a copy of the replaced glyph under a new name.\n\n* Select **Rename glyph in OT features and classes** to automatically change the glyph name in OpenType classes that contain the glyph name, and in OpenType feature text.\n\n* Select **Rename glyph in kerning pairs and classes** to automatically change the glyph name in kerning classes that contain the glyph being renamed and in the 'kern' feature text.\n\nPress the **Rename** button to assign a new name to the glyph.\n\nIf you want to rename more glyphs in sequence, instead press the **Rename Next Glyph** button. A new name will be assigned to the current glyph (as if you had pressed the <i>OK</i> button) and data from the next glyph will appear for editing.\n",
  "font.focus": "Font window; The Font window enables you to view the entire glyph set as a table of cells, sort and filter them, and select one or multiple glyphs to change.\n\nIn the <i>property bar</i>, choose what’s shown as the cell captions and how the glyph cells are sorted. Change the cell size in the bottom <i>status bar</i>. Use the colorful rectangles to <i>flag</i> glyphs so you can tell what’s “done” or “important”. \n\nAdd a <i>filter</i> to focus on a particular subset of your glyphs. The glyphs that match the filter will be shown first, and their cell captions will be yellow. \n\nTo add a filter, type into the <i>Search</i> box, use the <i>History</i> sidebar or use the <i>View mode</i> dropdown. Some filters are “strict”: they only show the glyphs that match and exist in your font. Other filters are “loose”: they show <i>existing glyphs</i> (white cell background) and <i>empty glyph cells</i> for glyphs that don’t yet exist but would match the filter (gray cell background). \n\nSelect one or more <i>empty glyph cells</i> and <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> to create these glyphs. Select one or more <i>existing glyphs</i> and <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> or click any tool in the Toolbar to open these glyphs in a Glyph window. \n\nSelect one or more existing glyphs and use items from the <i>Glyph</i>, <i>Element</i>, <i>Contour</i> or <i>Tools</i> menus to perform changes on the current layer of the selected glyphs. Use <i>Tools › Actions</i> to perform changes on all layers. \n\n<b style=\"font-style: normal;\"><b><small>DRAG-DROP</small></b></b> cells when the <i>View mode</i> and <i>Sort</i> are both **Index** to manually rearrange the glyph order. <b style=\"font-style: normal;\"><b><small>DRAG-DROP</small></b></b> cells in other modes onto empty glyph cells to assign new names and Unicodes, and onto existing glyphs to replace them. \n\nThe <i>List sidebar</i> shows more details about each glyph in a multi-column text view. Change the <i>Cell caption</i> dropdown to show different columns; click the column headers to sort. \n\n<b style=\"font-style: normal;\"><sup>M</sup><b><small>CMD</small></b>­·<b><small>CLICK</small></b></b> <b style=\"font-style: normal;\"><sup>W</sup><b><small>CTRL</small></b>­·<b><small>CLICK</small></b></b> the tab title or on the icon left of the Family name in the Font window title bar to see the file path for your font.\n",
  "glyph.focus": "Glyph window; Draw, edit, space, kern and preview glyphs in the Glyph window.\n\nTo open a Glyph window, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> any existing glyph cell in the Font window or Font Map panel, or select one or more glyphs and tap <b style=\"font-style: normal;\"><b>↩</b></b>. If <i>Preferences › General › Fonts and glyphs open in windows</i> is off, a new tab with the glyph(s) will be opened. Otherwise the glyph(s) will opened in a new separate window. \n\n",
  "panel.anchorspins": "Anchors and Pins panel; See and manage anchors and pins of the current glyph layer with the **Anchors and Pins panel**. Use the <i>Anchors/Pins toggle</i> at the top left of the panel to view either the **anchors** that position and attach glyphs together, or **pins** that position and attach elements. \n\n**To see the properties of an anchor or pin**, click it in the list, or in the glyph window. The panel will display its **name**, **position** and **location expression** below the list. Use the expression field to position the anchor or pin dynamically in relation to other named guides, anchors and pins. \n\n**To activate/deactivate an anchor or pin**, click the icon before its name in the list (diamond-shaped for anchors, circular for pins). If the icon is filled, it means the anchor or pin is activated; if it is only an outline, it means deactivated. To activate all anchors or pins in the list, click the <i>check-mark button</i> in the panel header. To deactivate everything in the list, click the <i>cross-mark button</i>.\n\n**To view the list of glyphs or elements that are linked to the selected anchor or pin**, select it and click the grid-shaped <i>Show linked glyphs or elements button</i>. If the Font window is active, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the glyph in the list selects this glyph cell in the font. If the Glyph window is active, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the glyph in the list adds this glyph to the window for edit.\n\n**To remove an anchor or pin**, select it in the list and click the <i>–</i> button at the panel's bottom.\n",
  "panel.brush": "Brush panel; The **Brush panel** allows you to change the size and shape of the **Brush tool**, and apply the brush to glyphs or elements.\n\n**To set the brush angle**, <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the blue arrowhead in the illustration of the brush tip, or manually edit the angle value (in degrees).\n\n**To set the brush roundness**, <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the blue dot in the illustration of the brush tip. Move the dot to the left to make the brush less round, and to the right to make it rounder. You can also enter a specific number from 0 (no rounding) to 100 (completely circular) manually. \n\n**To set the brush size**, use the slider, or manually enter a value between 0 to 300, or choose a predefined size from the dropdown menu.\n\n**To define the stroke shape**, use the blue control points on the horizontal edge of the illustration of the stroke. Each control point can be dragged between a value of 0 to 100%, which can also be entered manually.\n\n**To define the shape of the stroke’s beginning or end cap**, click the blue control point on the respective end of the stroke shape illustration. The default setting is a <i>round cap</i>, which is represented by a filled blue circle, and creates a stroke with semicircular ends. Clicking on the circle once will create a <i>butt cap</i>, i.e. a stroke with squared ends. This is represented by a square with a blue outline. Clicking on it one more time will convert it to a <i>projected cap</i>, i.e with squared ends that extend half the line width beyond the end of the stroke. This is represented by a half-filled blue square.\n\n**To choose a predefined brush**, select it in the list of predefined brushes.\n\n**To add a new brush to the list**, edit the brush’s size and shape using the option described above, and then click the <i>+</i> button below the list. **To delete a brush**, select it and click <i>-</i> button below the list. Finally, use the harmburger menu **to save the whole list** of brushes to an external file, or **load them from an external file** or **reset the list** to factory defaults.\n\n**To apply a Power Brush filter to the current glyph or glyph cells selected in the Font window**, click <i>Set</i>. **To remove the Power Brush filter**, click <i>Remove</i>.\n\n**To convert the Power Brush filter effect to regular contours**, click <i>Expand</i>.\n\n",
  "panel.classes": "Classes panel; The **Classes panel** helps you define, view and edit the OpenType and kerning classes in your font.\n\n**To select viewing modes**, use the <i>Preview area</i>, <i>Table area</i> and <i>List sidebar</i> buttons at the far right of the local toolbar. The panel has the following viewing modes:\n\n1. The **Preview** area shows the preview of all glyphs included in the selected class(es). **To preview kerning classes in this mode**, select the first (left) kerning class and then <b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b><small>CLICK</small></b></b> to select the second (right) kerning class, or select the same classes in the Kerning panel. \n\n2. The **Table area** shows glyphs belonging to the selected class(es) as cells along with their names.\n\n3. The **List sidebar** shows glyphs belonging to the selected class(es) along with information about them, as a list of either glyph names, Unicode or the character (which can be changed using the menu under the List sidebar). Information includes Name, Unicode, LSB, Width, RSB and OT Class, and the list can be sorted based on any of these. \n\nBy default, all classes are shown in this panel. **To filter which classes or tags are shown**, click the <i>Class type</i> dropdown at the left of the local toolbar. In this menu, you can choose between <i>all classes</i>, <i>first kerning classes</i>, <i>second kerning classes</i>, <i>first and second kerning classes</i>, <i>OpenType classes</i>, <i>tags</i> and <i>virtual tags</i>. \n\n**To find a particular class**, type its name in the <i>Filter</i> field.\n\n**To import classes from another open font (or font master)**, select the <i>Import</i> submenu in the panel's local menu, accessed via the <i>hamburger icon</i>. This submenu contains names of all opened fonts/masters. Selecting one of the fonts/masters opens a dialog box, where you can choose what classes will be imported and how existing classes will be dealt with.\n\n**To define a new tag or class**, click the plus-shaped <i>Add class button</i> below the list of classes in the sidebar. Clicking on this button brings up a dropdown menu where you can select whether you want to add a 1st Kerning Class, 2nd Kerning Class, OpenType Class or Tag. Select the option you need. Once you do that, a new class or tag with a default name will be created, with the glyphs selected in the Font Window as its members.\n\n**To rename a class or tag**, select it in the list, enter a new name in the <i>Name</i> field in the local toolbar of the panel and click anywhere to apply the change.\n\n**To add glyphs to a class or tag**, enter glyph names to the text field under the Table area; or select glyphs in the Font Window and press the plus-shaped <i>Add glyphs to class button</i> under the view area; or <b style=\"font-style: normal;\"><b><small>DRAG-DROP</small></b></b> glyphs from the Font window to the Table area or List sidebar.\n\n**To sort classes by their type and names**, click the <i>Class</i> column title in the list of classes. OpenType classes sorted by their names go first in the list, then 1st classes and finally 2nd classes.\n\n**To sort classes by the number of members**, click the <i>Size</i> column title in the list of classes.\n\n**To manually reorder classes**, select them and <b style=\"font-style: normal;\"><b><small>DRAG-DROP</small></b></b> lower or higher in the list.\n\n**To merge two or more classes**, select them in the list sidebar, click the <i>Select Glyphs button</i>, and then on the plus-shaped <i>Add glyphs to class button</i> under the Preview/Table Area. The selected glyphs will be added to the first class that you’ve selected, and — if this was a kerning class — they will be removed from the other kerning classes of the same type.\n\n**To assign a color mark to class**, select it in the list and use the color list and dropdown in the local toolbar.\n\n**To remove a class or tag group**, select it in the list sidebar and click the minus-shaped <i>Remove selected classes button</i>.\n\n**To remove all classes**, click the local menu button and choose <i>Remove All Classes</i>. This will remove classes but leave the tags intact.\n\n**To automatically generate kerning classes**, click the local menu button and choose <i>Generate Kerning Classes</i>.\n\n**To remove any glyphs from selected classes that are not present in the font**, choose <i>Clean Up Selected Classes</i> in the local menu.\n\n**To select glyph cells in the Font window belonging to the selected class**, click the <i>Select glyphs</i> rectangle-shaped button.\n\n**To delete a glyph**, select it in the list sidebar and press <i>Delete</i> on your keyboard.\n",
  "panel.color": "Color panel; The **Color panel** is a color picker for selecting and applying colors to contours and their fills. Colors are applied to entire Elements, which means that contours in the same element cannot have different colors. However, different Element References can be colored differently. The colors you apply will be maintained if you generate fonts in a format that supports color.\n\nTo save and remember predefined colors, use the **Swatches Panel** instead.\n\nThe Color panel can be used in three different interface modes – <i>wheel panel</i>, <i>sliders panel</i> and <i>box panel</i>. **To select the interface mode of your choice**, use the toggle in the panel header. No matter which mode you choose, the panel will show the details of the selected color at the bottom of the panel in RGB, HSL, hexadecimal or Lab format depending on what you choose in that dropdown.\n\n**To change a contour color**, click the unfilled circle in the top left corner, select a color and click <i>Apply</i>.\n\n**To change a fill color**, click the filled circle, select a color and click <i>Apply</i>.\n\nHold <b style=\"font-style: normal;\"><b><small>ALT</small></b></b> and click <i>Apply</i> to apply the color to the current layer of all selected glyphs in a Font window.\n\nIn the **Color name or code** field, enter color in `#RRGGBB` format or a color name:\n\n<span style=\"background:black;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;black <span style=\"background:white;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;white <span style=\"background:transparent;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;transparent <span style=\"background:pink;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;pink <span style=\"background:lightpink;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightpink <span style=\"background:hotpink;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;hotpink <span style=\"background:deeppink;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;deeppink <span style=\"background:palevioletred;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;palevioletred <span style=\"background:mediumvioletred;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mediumvioletred <span style=\"background:lightsalmon;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightsalmon <span style=\"background:salmon;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;salmon <span style=\"background:darksalmon;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darksalmon <span style=\"background:lightcoral;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightcoral <span style=\"background:indianred;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;indianred <span style=\"background:crimson;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;crimson <span style=\"background:firebrick;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;firebrick <span style=\"background:darkred;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkred <span style=\"background:red;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;red <span style=\"background:orangered;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;orangered <span style=\"background:tomato;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;tomato <span style=\"background:coral;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;coral <span style=\"background:darkorange;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkorange <span style=\"background:orange;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;orange <span style=\"background:yellow;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;yellow <span style=\"background:lightyellow;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightyellow <span style=\"background:lemonchiffon;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lemonchiffon <span style=\"background:lightgoldenrodyellow;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightgoldenrodyellow <span style=\"background:papayawhip;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;papayawhip <span style=\"background:moccasin;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;moccasin <span style=\"background:peachpuff;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;peachpuff <span style=\"background:palegoldenrod;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;palegoldenrod <span style=\"background:khaki;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;khaki <span style=\"background:darkkhaki;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkkhaki <span style=\"background:gold;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;gold <span style=\"background:cornsilk;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;cornsilk <span style=\"background:blanchedalmond;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;blanchedalmond <span style=\"background:bisque;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;bisque <span style=\"background:navajowhite;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;navajowhite <span style=\"background:wheat;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;wheat <span style=\"background:burlywood;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;burlywood <span style=\"background:tan;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;tan <span style=\"background:rosybrown;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;rosybrown <span style=\"background:sandybrown;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;sandybrown <span style=\"background:goldenrod;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;goldenrod <span style=\"background:darkgoldenrod;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkgoldenrod <span style=\"background:peru;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;peru <span style=\"background:chocolate;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;chocolate <span style=\"background:saddlebrown;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;saddlebrown <span style=\"background:sienna;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;sienna <span style=\"background:brown;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;brown <span style=\"background:maroon;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;maroon <span style=\"background:darkolivegreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkolivegreen <span style=\"background:olive;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;olive <span style=\"background:olivedrab;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;olivedrab <span style=\"background:yellowgreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;yellowgreen <span style=\"background:limegreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;limegreen <span style=\"background:lime;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lime <span style=\"background:lawngreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lawngreen <span style=\"background:chartreuse;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;chartreuse <span style=\"background:greenyellow;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;greenyellow <span style=\"background:springgreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;springgreen <span style=\"background:mediumspringgreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mediumspringgreen <span style=\"background:lightgreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightgreen <span style=\"background:palegreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;palegreen <span style=\"background:darkseagreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkseagreen <span style=\"background:mediumaquamarine;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mediumaquamarine <span style=\"background:mediumseagreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mediumseagreen <span style=\"background:seagreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;seagreen <span style=\"background:forestgreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;forestgreen <span style=\"background:green;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;green <span style=\"background:darkgreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkgreen <span style=\"background:aqua;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;aqua <span style=\"background:cyan;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;cyan <span style=\"background:lightcyan;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightcyan <span style=\"background:paleturquoise;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;paleturquoise <span style=\"background:aquamarine;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;aquamarine <span style=\"background:turquoise;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;turquoise <span style=\"background:mediumturquoise;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mediumturquoise <span style=\"background:darkturquoise;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkturquoise <span style=\"background:lightseagreen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightseagreen <span style=\"background:cadetblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;cadetblue <span style=\"background:darkcyan;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkcyan <span style=\"background:teal;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;teal <span style=\"background:lightsteelblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightsteelblue <span style=\"background:powderblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;powderblue <span style=\"background:lightblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightblue <span style=\"background:skyblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;skyblue <span style=\"background:lightskyblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightskyblue <span style=\"background:deepskyblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;deepskyblue <span style=\"background:dodgerblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;dodgerblue <span style=\"background:cornflowerblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;cornflowerblue <span style=\"background:steelblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;steelblue <span style=\"background:royalblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;royalblue <span style=\"background:blue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;blue <span style=\"background:mediumblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mediumblue <span style=\"background:darkblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkblue <span style=\"background:navy;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;navy <span style=\"background:midnightblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;midnightblue <span style=\"background:lavender;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lavender <span style=\"background:thistle;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;thistle <span style=\"background:plum;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;plum <span style=\"background:violet;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;violet <span style=\"background:orchid;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;orchid <span style=\"background:fuchsia;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;fuchsia <span style=\"background:Magenta;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;Magenta <span style=\"background:mediumorchid;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mediumorchid <span style=\"background:mediumpurple;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mediumpurple <span style=\"background:blueviolet;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;blueviolet <span style=\"background:darkviolet;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkviolet <span style=\"background:darkorchid;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkorchid <span style=\"background:darkmagenta;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkmagenta <span style=\"background:purple;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;purple <span style=\"background:indigo;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;indigo <span style=\"background:darkslateblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkslateblue <span style=\"background:slateblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;slateblue <span style=\"background:mediumslateblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mediumslateblue <span style=\"background:snow;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;snow <span style=\"background:honeydew;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;honeydew <span style=\"background:mintcream;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mintcream <span style=\"background:azure;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;azure <span style=\"background:aliceblue;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;aliceblue <span style=\"background:ghostwhite;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;ghostwhite <span style=\"background:whitesmoke;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;whitesmoke <span style=\"background:seashell;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;seashell <span style=\"background:beige;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;beige <span style=\"background:oldlace;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;oldlace <span style=\"background:floralwhite;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;floralwhite <span style=\"background:ivory;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;ivory <span style=\"background:antiquewhite;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;antiquewhite <span style=\"background:linen;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;linen <span style=\"background:lavenderblush;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lavenderblush <span style=\"background:mistyrose;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;mistyrose <span style=\"background:gainsboro;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;gainsboro <span style=\"background:lightgray;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightgray <span style=\"background:silver;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;silver <span style=\"background:darkgray;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkgray <span style=\"background:gray;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;gray <span style=\"background:dimgray;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;dimgray <span style=\"background:lightslategray;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;lightslategray <span style=\"background:slategray;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;slategray <span style=\"background:darkslategray;\">&nbsp;&nbsp;&nbsp;</span>&nbsp;darkslategray\n",
  "panel.elements": "Elements panel; The **Elements panel** helps you manage all the Elements in the current glyph.\n\nThe list shows the basic properties of each element: name, position in the glyph, whether they are locked or unlocked, number of references the element has and its colour(s). **To see and edit all properties of elements**, click the <i>Show element properties</i> button in the panel header.\n\nThe **Element name** can be modified by typing a new name in the field and pressing <i>Return</i>. **To create a new glyph with a selected element as a reference**, first select an element, type a name in the Name field and click the <i>Create glyph</i> button.\n\n**Element transformations** are attributes of the selected element or element reference. They include position/shift, scale, flip, rotate, slant, body color, stroke width, color and opacity. Different element transformations can be applied to different references of the same element.\n\nThe **Position** of the selected element is shown as X and Y co-ordinates. **To <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> the element**, modify these values and press <i>Return</i>. **To set the position to 0,0**, click the <i>Reset</i> button. **To center the element between glyph sidebearings**, click the <i>Center in metrics</i> button.\n\nThe **Scale** of the selected element is shown as its width and height. **To scale an element**, modify the values for its width and height. Values above 100% will make it larger, and below 100% will make it smaller. **To scale an element proportionally**, enter the same value for its width and height. **To revert the element to its original size**, click the <i>Reset</i> button.\n\nUse the <i>Flip horizontally</i> and/or <i>Flip vertically</i> buttons to **Flip** the selected element.\n\nEnter values in degrees to the **Rotate** or **Slant** fields to transform the selected element by that angle. The point of origin is the bottom left. **To bring the element back to its original form**, use the <i>Reset</i> button.\n\nUse **Body Color** to set the fill color of a contour element. Color information is always preserved in VFCs, and also in exported fonts if the export format supports color. Changing the body color of a sticker element changes its background color.\n\nUse **Stroke width and color** to add a stroke of your chosen width and color to the selected contour element. Stroke color is always preserved in VFCs, and also in exported fonts if the export format supports color. Changing the stroke color of a sticker element changes its arrow and text color.\n\nModify the **Opacity** of the selected element either with the slider or by entering a value between 0 (completely transparent) and 100 (completely opaque) in the input field. Opacity changes affect both body color and stroke of the element.\n\nYou can also add **Element notes** in the form of text. Each element note is shared by all references to the element.\n\n**To see all references of the selected element**, click the <i>Show element references</i> button in the panel header. All glyphs referencing the selected element will be shown in a grid at the bottom of the panel. **To change the size of the grid cells**, use the <i>Smaller cells</i> or <i>Bigger cells</i> buttons above the grid. <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> (or Cmd+double-click++) on any glyphs in the grid **to add them to the Glyph window for editing**. Use the <i>Set Metrics</i> button **to copy metrics from the base glyph to the selected glyphs containing it as reference**.\n\n**To delete an element**, select it and press the <i>-</i> button at the bottom-left of the panel.\n\n**To make more space for the list of elements**, click the downward arrow shaped <i>Contract properties</i> button. This will hide the color and notes sections.\n\n",
  "panel.features": "Features panel; Use the **Features panel** helps you view, manage and edit the OpenType feature definitions in your font. You write feature definitions in the industry-standard Adobe FEA syntax. Features are defined per font. When you export OpenType fonts, the app preprocesses and **compiles** the feature definition code.\n\nWhen FontLab finds special _auto code lines_ (the opening line starts with `#>`, the closing line starts with `#<`), the app automatically generates code between the lines depending on the `#> keyword` (see below):\n\n```\n#> keyword\n#< keyword\n```\nFontLab replaces the auto code liens with an _auto code block_ and updates it automatically. To prevent the auto code block from updating, change `#>` to `#/>`.\n\n#### Managing features\n\n**To add a new feature**, click <i>+</i> in the bottom-left corner. This lists common features that are not yet defined in your font. Choose a feature marked with ☆ to add the feature and to autogenerate its code. Choose a feature without a mark to add placeholder code that you can edit. Choose <i>Empty feature</i>, then enter the feature tag and press <b style=\"font-style: normal;\"><b>↩</b></b> to add placeholder code for an unlisted feature. Then edit the placeholder code. **To add all features that can be autogenerated**, choose <i><b style=\"font-style: normal;\"><b>☰</b></b> › Add Auto Features</i>.\n\nEach feature block must start with `feature xxxx {` and must end with `} xxxx;`, where `xxxx` is the 4-letter feature tag. Inside, you can define named lookup definition blocks that start with `lookup nnnnn {` and end with `} nnnnn;`, where `nnnnn` is a lookup name (any length, plain English letters and digits, no spaces). In later feature definitions, you can refer to them with `lookup nnnnn;`. If you don’t define a named lookup block, the whole feature block defines a name-less lookup. Inside the lookup block (or feature block), you can specify substitution rules (with the `sub` keyword) or positioning rules (with the `pos` keyword).\n\n**To autogenerate the auto code** for existing features marked with ☆, select them and <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the <i>Autogenerate code for selected features</i> button. This replaces the manual code with an auto code block inserted between the auto code lines `#> feature` and `#< feature`, and changes the indicator to ★. To combine manual and auto code, cut your code first, click the button, then paste after the `#< feature` closing line. Put the `#> feature` auto code block inside a named lookup block inside a `feature` block to re-use the auto code in other features.\n\n**To update auto code in auto features** marked with ★, select the features and <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the <i>Update selected auto features</i> button. <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> to update all auto features. The app updates all `#> feature` auto code blocks. It does not replace manual code or the disabled auto code block that starts with `#/>`.\n\n**To always update all auto features before compilation or export**, turn on <i><b style=\"font-style: normal;\"><b>☰</b></b> › Update on Compile</i> (useful when you keep adding glyphs to your font). Turn this off to only update manually when you click or <b style=\"font-style: normal;\"><b><small>ALT</small></b></b>-click <i>Update selected auto features</i> (faster, useful if your glyph set is stable).\n\n**To reorder feature definitions** (which influences the order in which lookups are applied when the end-user turns on multiple features), <b style=\"font-style: normal;\"><b><small>DRAG-DROP</small></b></b> the feature tags in the list.\n\n**To remove one or more features**, select them in the list, then click <i>-</i>. **To remove all features, including compiled binary data**, choose the <i><b style=\"font-style: normal;\"><b>☰</b></b> › Remove All Features</i>.\n\n**To import feature definitions from an external file**, choose <i><b style=\"font-style: normal;\"><b>☰</b></b> › Import Features...</i> and choose a `.fea`, `.vfc`, `vfj`, `vfb`, `.ufo` or `.txt` file. **To import features from another font that is currently open**, choose <i><b style=\"font-style: normal;\"><b>☰</b></b> › Copy Features From</i> and select the source font. **To export features to a `.fea` file or to a VOLT project `.vtp` file**, choose <i><b style=\"font-style: normal;\"><b>☰</b></b> › Export Features</i>.\n\n#### Editing and testing features\n\n**To edit a feature definition**, click its tag on the list and edit the definition in the features editor. Click <i>FEATURES</i> to see all feature definitions at once, as well as any code that is written after the last feature definition.\n\n**To edit languagesystems and standalone lookups**, click <i>PREFIX</i>. Prefix contains `languagesystem ssss LLL` definitions, which define the scripts (`ssss` 4-letter tags) and languages (`LLL` 3- or 4-letter language tags or `dflt`) in which all features are registered. The `#> languagesystem` auto code block will auto-update the definitions as you add glyphs. For script- and language-specific feature code, use `script ssss` and `language LLL` keywords inside the feature blocks. You can also place standalone named `lookup` definition blocks in the Prefix, and refer to them in feature blocks.\n\n**To use classes or tags** defined in the <i>Classes</i> panel as named classes in your feature code, inside the Prefix add the auto code block `#> otclasses` for OpenType classes, `#> kernclasses` for kerning classes, `#> tags` for tags manually assigned to glyphs. Or enable checkboxes in <i><b style=\"font-style: normal;\"><b>☰</b></b> › Include Classes</i> and add an auto code block `#> classes` in Prefix.\n\n**To use virtual tags** that FontLab automatically assigns to glyphs based on various criteria, include them in the menu or add a `#> vtags` auto code block in Prefix. Then use feature classes like `@ALL` (all glyphs except `.notdef`), `@blank` (whitespace), `@noblank` (have content), `@composite` (have components), `@noncomposite` (don’t have components), `@references` (component sources), `@uc` (uppercase), `@lc` (lowercase), `@fig` (numerals), `@latn`  (4-letter script code).\n\n**To use virtual GDEF tags**, select all or some glyphs in Font window, click <i>Glyph panel › Auto Glyph Definition class</i> to classify them, add a `#> vtags` auto code block, then use the feature classes `@otsimp` (base glyphs), `@otmark` (marks), `@otliga` (ligatures), `@otcomp` (components), `@otnone` (other).\n\n**To test features** in the Glyph window, <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the <i>Compile features</i> button or press <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b>↩</b></b>, then turn on <i>Features</i> in the Glyph window sidebar or in Text mode property bar. If <i>Output</i> panel reports **warnings**, features will compile, but you may want to check them. If it reports **errors**, you must fix them to export the font with features. The feature editor highlights the 1st error, though the error may actually occur earlier in the code, so check the previous feature definition as well.\n\n**To insert a glyph** into the feature editor, type its name as used in the font, or tap <b style=\"font-style: normal;\"><b>/</b></b> to bring up the Quick Find popup. There, type a partial glyph name, Unicode character or a glyph name synonym, choose the glyph using <b style=\"font-style: normal;\"><b>←↑↓→</b></b> and press <b style=\"font-style: normal;\"><b>↩</b></b> to insert the correct glyph name. In the Quick Find popup, press <b style=\"font-style: normal;\"><b><small>ESC</small></b></b> to type `/` into the feature editor, or press <b style=\"font-style: normal;\"><b>/</b></b> to type `slash`.\n\n**To search within the feature definitions**, press <b style=\"font-style: normal;\"><sup>M</sup><b><small>CMD</small></b>­·<b>F</b></b> <b style=\"font-style: normal;\"><sup>W</sup><b><small>CTRL</small></b>­·<b>F</b></b> to jump to the search field, enter the name of a feature, lookup, glyph or class. Keep tapping <b style=\"font-style: normal;\"><b>↩</b></b> or clicking the <i>Search</i> button until you find the right match.\n\n#### Positioning features\n\nFeatures are defined per font. When you export OpenType masters or instances, the app generates the `kern` feature from interpolated kerning, and generates the `mark` &amp; `mkmk` features from interpolated anchors depending on the <i>Features and Kerning</i> section of the export profile. When you export variable OpenType fonts, the app uses the kerning classes of the main master and matches the kerning of the other master (losslessly converts the existing kerning into kerning based the main master’s kerning classes).\n\n**To manually edit the `kern` feature**, choose <i><b style=\"font-style: normal;\"><b>☰</b></b> › Create [kern] Feature</i>. This adds a `kern` feature to the panel based on **current master’s** kerning and classes. **To manually edit the `mark` and `mkmk` features**, choose <i><b style=\"font-style: normal;\"><b>☰</b></b> › Create [mark] and [mkmk] Feature</i>. This adds a `mark` and `mkmk` features to the panel based on **current master’s** anchors. This code will be used for **all masters** and instances.\n\n**To add manual code to autogenerated `kern` feature**, create it in <i><b style=\"font-style: normal;\"><b>☰</b></b></i>, then click <i>Autogenerate code for selected features</i>. In <i>Font Info › Parameters</i>, add a new parameter (e.g. `Lquote`) and set a value. If you have multiple masters, click <i>Match Parameters</i> and adjust the value in each master. At the end of the `kern` code, below `#< feature`, write your manual code that can refer to Font Info parameters, e.g. `pos L quoteright' @ALL ${Lquote};`. Turn on <i><b style=\"font-style: normal;\"><b>☰</b></b> › Update on Compile</i> to always update the auto code on compile and export. Use the same technique for `mark`/`mkmk`. and use Font Info `${parameters}` in other `cpsp` and other positioning features.\n",
  "panel.fontaudit": "FontAudit panel; The **FontAudit panel** lists the FontAudit problems for the current glyph and layer. The list shows the name of the problem, the x,y coordinate the problem exists, and has a <i>Fix</i> button that tries to fix the problem. \n\nTurn on <i>View › Show › FontAudit</i> (<b style=\"font-style: normal;\"><sup>M</sup><b><small>SHIFT</small></b>­·<b><small>CMD</small></b>­·<b>F</b></b> <b style=\"font-style: normal;\"><sup>W</sup><b><small>SHIFT</small></b>­·<b><small>CTRL</small></b>­·<b>F</b></b>) to **visualize** the problems in the Glyph window using colorful FontAudit markers. <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> in the list **to highlight the problem marker in the Glyph window**.\n\n**To see a description** of the problem, hold <b style=\"font-style: normal;\"><b>F1</b></b> over a problem in the panel list, or click a problem marker in the window (which opens a FontAudit problem popup).\n\n**To try to fix an individual FontAudit problem**, click the <i>Fix</i> button in the popup at the right side of the list entry. Fixing may not be successful and may produce other problems.\n\n**To try to fix all the FontAudit problems in the current glyph layer**, click <i>Fix All</i> in the popup or in the panel footer.\n\n**To change which tests are run by FontAudit**, use the panel ++gear-button== or <i>Preferences › FontAudit</i>.\n",
  "panel.fontinfo": "Font Info panel; The **Font Info panel** is a shorter, non-modal alternative to the Font Info dialog, showing the most important font properties. Because it does not show as much information, it is not a replacement for the Font Info dialog—which can be opened by clicking on the <i>i</i> button in the right top corner of the Font Info panel.\n\nUse the Font <i>Info/Parameters toggle</i> on the top-left panel **to choose what information you want to see in the panel**.\n\nThe Font Info section shows the following:\n\n- The **Typographic family name** (TFN or just “Family” or “Family Name”) is the name under which all fonts from one family are grouped in the font menu of a modern application. The Typographic family name must be identical in all fonts that need to appear as one family in the font menu of modern applications. The length of the Typographic family name should be no more than 31 characters. We recommend you use only uppercase and lowercase English letters, spaces and numerals.\n\n- The **Typographic style name** (TSN or just “Style”) is the name under which a specific font within a family appears in the font menu of modern applications. It is sometimes called “Preferred style name”.\n\n- The **Attributes** of a font or master describe its typographic properties. They are declared by the font vendor. The three key attributes are: <i>Weight</i>, <i>Width</i> and <i>Slope</i> and are shown in that order in the panel. There is also <i>Other</i> for custom attributes.\n\n- The **Units Per eM (UPM)** is the basis of all font dimensions. The UPM is the number of font units that the coordinate grid on which the glyphs are drawn and to which all font dimensions relate, including the font height. **To change the UPM**, click <i>Change</i>. This will bring up a dialog where you can enter the new UPM value and choose whether you would  like to only update the UPM, or also scale the glyphs and metrics to the new value.\n\n- **Ascender** shows the position of the font’s ascender line.\n\n- **Descender** shows the position of the font’s descender line.\n\n- **Line Gap** shows the typographically correct line gap value (distance between bottom line of the upper line of text and top line of the lower line of text).\n\n- **Caps Height** shows the height of the font’s uppercase characters.\n\n- **x-Height** shows the height of the lowercase characters.\n\n- **Italic Angles** shows the actual italic or oblique angle for the font. The italic angle is measured in the counterclockwise direction, but FontLab shows it positive here.\n\n- **Caret Offset** is the amount by which a slanted highlight on a glyph needs to be shifted to produce the best appearance. Non-slanted fonts should have a setting of zero.\n\n- **Curve Tension** is a measure of how much a curve deviates from a straight line between two points, from zero to 100%.\n\n- **Vertical and Horizontal Stems** is the place to define PS standard stems used in font hinting procedures.\n\n**To automatically generate any of the information in this section**, click the <i>Auto button</i> next to the appropriate field.\n\nThe Parameters section lists **pre-defined variables** (ascender, descender, x<i>height and caps</i>height), **font guidelines** and **user-defined parameters** that can be used in expressions. \n\n**To define a new parameter**, click the plus-shaped <i>Add parameter button</i>, name the variable and <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the slider to define its value.\n\n**To remove an existing parameter**, select it in the list and click the minus-shaped <i>Remove parameter button</i>.\n\n**To modify the value of a parameter or variable**, enter the new value in the input area, use the number steppers or the slider. Note that changing the value of a pre-defined variable will change your font’s dimensions.\n",
  "panel.fontmap": "Font Map panel; The **Font Map panel** is the functional replacement for the Font Window in FontLab. It looks like the Font Window, and if several fonts are open in FontLab, it shows the contents of the currently selected font. To take advantage of the Font Map panel, switch off the <i>Close font when its Font window is closed</i> option in **Preferences > General**, and open the **Fonts panel** <i>Window › Panels › Fonts</i>.\n\nThe alternative way to open the Font Map panel is to <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the local toolbar of the Glyph window.\n\n**To see an open font in the Font Map panel**, select it in the Fonts panel.\n\n**To preview several fonts together in the Font Map panel**, select them in the Fonts panel.\n\n**To add the same color flag to a set of glyphs in more than one font**, select them in the Fonts panel, and change their color flag. Cells of the selected fonts will get the same color flag.\n",
  "panel.fonts": "Fonts panel; The **Fonts panel** shows all open fonts grouped by families. If you have several fonts open, **use this panel to select which font’s contents will be shown in other panels**, such as the Preview, Font Map and Font Info.\n\n**To open fonts using the Fonts panel**, <b style=\"font-style: normal;\"><b><small>DRAG-DROP</small></b></b> them from a folder to the panel.\n\n**To close fonts using the Fonts panel**, select the font(s) and click the <i>–</i> button in the panel’s footer.\n\n**To duplicate a font**, select it in the Fonts panel and click the <i>Duplicate</i> button in the footer. The duplicate font will appear in the Fonts panel as a member of the same family.\n\n**To change the sort order for your fonts**, click the <i>hamburger</i> button and select Alphabetically or Typographically.\n",
  "panel.gallery": "Gallery panel; The **Gallery panel** is the container of all **named** Elements (linked and unlinked) in your font. \n\nElements are listed alphabetically in the panel, and you can use the **Filter** field to find an element by its name. Along with a preview of the element, each grid cell shows the number of references and the element name is shown at the bottom-left of the panel. **To change the size of the grid cells**, use the <i>Smaller cells</i> or <i>Bigger cells</i> buttons.\n\n**To place an element from the Gallery panel into the current glyph**, <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> and drop it from the panel into the Glyph window, or select the Element in the panel and click <i>Place</i>. The element will be inserted as a linked reference.\n\n**To place an element from the Gallery panel into a single glyph in the Font window**, <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> and drop the element to the glyph cell of your choice.\n\n**To place the same element in multiple glyphs**, select all the glyphs in the Font window, then select the element in the Gallery panel and then click <i>Place</i>.\n\n**To replace an element in a glyph with a different one**, select the element you want to replace in the Glyph window, select the element you want to replace it with in the Gallery panel, and then click <i>Replace</i>.\n\n**To place an element from the Glyph window to the Gallery panel**, select the element in the Glyph window and click the <i>+</i> button. The selected element will get the default name and appear in the Gallery panel.\n\n**To remove an element from the Gallery panel**, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> it to open in the Glyph window and remove its name in the Elements panel.\n",
  "panel.glyph": "Glyph panel; The **Glyph panel** shows all the properties of the current glyph.\n\nThe **Name** field shows a short text identifier for the selected glyph. You can press the <i>Update</i> button to generate a new glyph name based on the glyph’s Unicode codepoint, or edit it manually by typing in the field.\n\nThe **Unicode** codepoint is a hexadecimal number associated with a character. You can enter it manually, or click the update button for FontLab to try to generate a Unicode value based on the glyph name.\n\nThe **Unicode character name** uniquely describes a Unicode codepoint. This field cannot be edited.\n\nNext, are the **Advance width**, and left and right **sidebearings** of the glyph. **To tether the left, right or both glyph sidebearings to the contours**, click the <i>Bind left sidebearing to contour</i> or <i>Bind right sidebearing to contour</i> or both buttons. Once bound, when you edit the contours in the glyph, the selected sidebearing(s) will remain the same.\n\n**Kerning** shows the names of the **first and second kerning classes** (if any) to which the glyph belongs. \n\n**Flag** is the glyph cell coloring, used to visually differentiate groups of glyphs. Use the dropdown **to change the flag color**.\n\n**Tags** are text labels to differentiate groups of glyphs. You can add any custom or predefined “virtual” text tags to the field.\n\n**OpenType class** defines the type of the glyph for the Glyph Class Definition (GDEF) table in the output OpenType font.\n\nThis is the **Index** of the glyph, i.e. the physical ordering of the glyph in the output font.\n\n**Note** is used for adding text comments to the glyph.\n\n",
  "panel.guide": "Guide panel; The **Guide panel** shows the parameters and properties of the currently selected guideline, font metric (like ascender, x-height, etc.), alignment zone or hint and allows you to edit them.\n\n- In the **Name** field, you can enter a name for the selected guideline. Depending on its type, it will have one of the following prefixes — **G** for a glyph (local) guideline, **F** for a font (global) guideline, **E** for an element guideline, **M** for font metrics, **H** for hints, and **Z** for alignment zones.\n\n- Use the **Color** dropdown to assign a color to the selected guideline.\n\n- click the **Lock/Unlock** toggle to lock/unlock the guideline. A locked guideline can be renamed, but cannot be moved.\n\n- **To select the type of guideline** by clicking on one of the buttons – <i>Horizontal</i>, <i>Vertical</i> or <i>Vector</i>. **To generate auto marks**, click <i>Auto markers</i>. **To convert a guideline to short**, click the <i>Short</i> button.\n\n- **To change the position of the guideline**, enter the value in the text field. **To change the point of origin of the vector guideline**, enter the X and Y co-ordinates in the fields respectively.\n\n- The **Expression** field can be used to enter simple expressions that can be used **to calculate the position of the selected guideline**.\n\n- The **Thickness** of the selected guideline is shown in this field. **To change the thickness**, enter the appropriate value in the field.\n\n- If the guideline you have selected is vector, this field appears showing the **current angle of the vector**. **To change the angle of a vector guideline**, enter the appropriate value (in degrees) to this field.\n\n- If you have selected a vector guideline, this field appears showing the **current length of the vector**. **To change the length of a vector guideline**, enter the appropriate value to this field.\n\n- **Guideline tags** are a way to make a font guideline only show up on specific glyphs. \n\n- This field shows the position of current **Guideline markers**, and allows you to edit their positions.\n",
  "panel.history": "History panel; The **History panel** records all operations you perform with glyph contours, glyph metrics, kerning or glyph info. The panel shows a list of operations – those on a blue background are currently applied, and the ones on white have been undone.\n\n- **Record** takes a snapshot of the current glyph outlines and remembers it in memory for further interpolation.\n- **Rewind** interpolates back to the remembered snapshot.\n- **Fast Forward** interpolates from the snapshot (taken with <i>Record</i>) to the current glyph outlines.\n- **Undo** cancels the last operation on the blue background.\n- **Redo** performs the first operation on the white background.\n",
  "panel.image": "Image panel; The **Image panel** can be used to apply bitmap filters to image Elements. The options in this panel will be activated only when there is an image element present in the Glyph window.\n\n**To select a filter to apply**, use the dropdown menu in the local toolbar.\n\n**To show or hide the preview of the filter**, click the <i>Eye</i> button.\n\n**To apply the selected filter**, click <i>Apply</i>.\n\nThe panel has the following filters:\n\n- **Sharpen** makes the image sharper and with higher contrast. Use the <i>Strength slider</i> to choose how strongly the filter should be applied.\n- **Soften** makes the image less sharp, lowers contrast, and blurs it. Use the <i>Strength slider</i> to choose how strongly the filter should be applied.\n- **Gaussian Blur** blurs the glyph using the Gaussian algorithm. Use the <i>Radius slider</i> **to define the blur degree**, and the <i>Fast Blur</i> option **to strengthen the effect**.\n- **Find Edges** filter allows you to get the “contour” of an image.\n- **Reduce Noise** makes images less noisy. Use the <i>Radius slider</i> **to define the best transformation parameters**.\n- **Despeckle** removes small defects due to dust, or scratches, on a scanned image, and also moiré effects on image scanned from a magazine. \n- **Threshold** turns color image into black & white by filling the light pixels of the image with white and dark pixels with black. Use the <i>Threshold slider</i> **to move the boundary between “light” and “dark”** Use the dropdown menu **to choose the method of threshold** – <i>Luminosity</i>\tuses each pixel's red, green and blue channels; <i>Opacity</i> uses each pixel's opacity/transparency component; and <i>Color</i>\tuses each pixel's hue angle. **To fill the result of the threshold filter with a color of your choice**, use the <i>Colorize</i> pop-up menu.\n- **Remove Background** tries to separate the element from its background and then clear the background.\n- **Autotrace** traces bitmap images trying to create smooth and quality outlines. Use the <i>Precision slider</i> **to control the tolerance of the trace** by changing the distance between the generated outline and the edge of the original bitmap. Use the <i>Smoothness slider</i> to help FontLab choose between lines and curves while autotracing.\n",
  "panel.kerning": "Kerning panel; The **Kerning panel** shows the list of kerning pairs defined in the current font, and allows you to preview and modify kerning.\n\n**To turn on preview**, click the <i>Show pair preview</i> button in the panel’s status bar on the bottom-right. Now, you’ll see the preview of the pair you select in the list. If the kerning pair you have selected is comprised of kerning classes, the preview will show all members of the class.\n\n**To search for a kerning pair**, type the first letter of one of the glyph names in the <i>Filter</i> field. **To see all the pairs that contain a particular glyph on the left**, type the full glyph name followed by a space and then `*`. Similarly, **to see all the pairs that contain a particular glyph on the right**, type the `*` followed by a space and then the full glyph name. **To show only particular sers of pairs**, use the <i>All | All</i> dropdown menu – <i>All</i> shows the full list of pairs; <i>Enc</i> shows pairs that belong to the encoding, codepage, etc. currently selected in the Font window; and, <i>Sel</i> shows only pairs including glyphs that were selected in the Font window.\n\n**To select a kerning pair**, click it.\n\n**To select multiple kerning pairs**, hold down the <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> key and select adjacent pairs, or hold down the <i>Cmd</i> to select any non-adjacent pairs in the list.\n\n**To manually adjust kerning for selected pair(s)**, use the left and right **arrow** keys. <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b>-arrow will change the kerning values by 10 units, <b style=\"font-style: normal;\"><b><small>CMD</small></b></b>-arrow will change them by 100.\n\n**To edit the kerning value directly in the table**, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the kerning value, or select a pair and press <b style=\"font-style: normal;\"><b>↩</b></b>.\n\n**To put a kerning pair in the Glyph window**, open a Glyph Window and select the pair in the panel. The same method works for multiple pairs as well.\n\n**To assign a color flag to a kerning pair**, select it from the list in the main area of the panel and choose one of the standard colors or pick a custom color from the color flag menu. If a kerning pair comprises kerning classes that have already been assigned colors, those colors will be shown in this panel. In case you mark such a kerning class in this panel, all three colors will be shown.\n\n**To delete selected pair(s)**, click the <i>–</i> button.\n\n**To access the local kerning menu**, use the <b style=\"font-style: normal;\"><b>☰</b></b> button at the bottom-right of the panel. The following operations are listed in the menu:\n\n- Use **Import Kerning** to import kerning from another font or font master. If the source font includes kerning classes they are imported as well.\n- **Remove All Pairs** removes all kerning pairs from the font.\n- With **Compress to Class Kerning**, you can convert flat kerning (i.e. glyph-to-glyph kerning) into class kerning “safely” — only pairs where all class members have identical flat kerning values will be converted into a class kerning pair. This operation is fully reversible using the <i>Flatten Class Kerning</i> operation.\n- Use **Flatten Class Kerning** to convert all kerning pairs that involve classes (class-to-class, glyph-to-class, class-to-glyph) into a large flat list of glyph-to-glyph pairs.\n- With **Extend Class Kerning** operation, you can convert flat kerning into class kerning “more aggressively” – glyphs in new classes created by FontLab will inherit the kerning of the previously-defined individual glyph kerning pairs.\n- The **Adjust** command brings up a dialog box that allows you to automatically change kerning for selected or all kerning pairs. It has three options – you can adjust positive kerning values by several units or percents, you can adjust negative kerning values by several units or percents or you can round kerning values by the selected number of units. To apply changes, select the corresponding option and click <i>OK</i>.\n- The **Filter** operation opens the dialog box that allows you to remove kerning pairs on the basis of one of these parameters – pairs with small kerning values, pairs containing glyphs from different scripts, or pairs for particular selected script(s).\n",
  "panel.layersandmasters": "Layers and Masters panel; The **Layers and Masters panel** helps you manage the layers and masters in your font. The panel contains a list of all layers and masters for the current glyph. Each item in the list comprises the <i>Name</i> of the layer or master, a <i>Preview</i>, <i>Number of elements</i> in the layer or master, and icons to show whether it is <i>visible</i>, <i>locked</i>, a <i>service</i> layer and if it is shown as a <i>wireframe</i>. Masters have their names displayed in bold, while the special #instances layer has its name shown in grey. Compatible masters have pale green backgrounds in the panel, while incompatible masters have a pale red background.\n\n**To show/hide the properties section of the panel**, click the <i>Show layer properties</i> toggle in the local toolbar of the panel. The following properties are shown in the section:\n\n- An editable text field for the layer’s **Name**. You can also edit the layer’s name right in the layers list by double-clicking it.\n- The **Auto layer toggle**  with an editable text field for the glyph generation recipe. **To make a layer an auto layer or a manual layer**, use the <i>Auto layer toggle</i>. In the auto layer recipe text field, FontLab’s predefined recipes for an auto layer will be shown in grey; your custom recipes in black. **To modify a predefined recipe**, click the <i>Edit recipe</i> button, modify the text in the field and press <i>Enter</i>. **To go back to FontLab’s predefined recipe**, click the cross-shaped <i>Reset recipe</i> button. **To enter a custom glyph generation recipe for an auto layer** that has no predefined recipe, enter the recipe in the field.\n- The layer’s **Transparency slider** that controls the layer’s visibility within the FontLab user interface. This does not affect the font export.\n\n**To switch between layers and masters**, click their names in the panel.\n\n**To modify the order of layers and masters**, <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> and drop them in the panel. The order of masters in the panel is in sync with the order in the Font Info dialog.\n\n**To add a new layer**, click the plus-shaped <i>Add layer button</i> in the status bar. This will bring up a dialog with the following fields and options:\n\n- **Name**, where you can enter a name for the new layer.\n- A set of three icons to define the main **Properties** of this layer — whether it will be a <i>service layer</i>, be <i>locked</i> and if it will be displayed as <i>wireframe</i>. By default, a new layer will be added at the top of the list in the panel. **To put the new layer at the bottom of the list**, click the <i>Put to background</i> button.\n- You can choose whether the new layer should be added to the <i>current glyph only</i>, <i>selected glyphs</i> or <i>all glyphs</i>.\n- **Fill new with content of this font** allows you to copy glyph elements from another opened font to the new layer of the current font, and choose whether you would like this copy to be left, right or center aligned. You can also choose the master of that font. If no other font is open at the time, the contents of the currently selected layer of the same font will be copied.\n- Check the **Make it master layer** if you would like FontLab to name the master in a way that it works as a master. This will be a font master if you add the contents of the opened font, or this a glyph master if you create the layer for just some of the glyphs in the font.\n- If **Use instance layer if available** is checked and the font is axis-based (i.e. a variable font), the #instance layer is used. \n- Check the **Rasterize layer to this PPM** and enter the value you need to put the result of the glyphs outline rasterisation to the new layer.\n\n**To duplicate a layer in the current glyph**, select it in the panel and click the <i>Duplicate button</i> in the status bar.\n\n**To delete a layer**, select it and click the minus-shaped <i>Remove layer(s) button</i> in the status bar. This will bring up a dialog will appear, where you can choose whether you would like the selected layer to be deleted in the current glyph, the glyphs selected in the Font window or Font Map panel, all glyphs, or in the font master.\n\n**To hide/show a layer**, select the layer and click the eye-shaped <i>Show button</i> in the local toolbar, or click the same button on the left of the layer preview. **To hide/show all layers**, hold down <i>Cmd</i> and click the <i>Show button</i> in the local toolbar. \n\n**To change layer opacity**, use the <i>Opacity</i> slider or the <i>Opacity</i> field in the layer properties section of the panel.\n\n**To lock a layer**, select it and click the <i>Lock button</i> in the local toolbar, or click the dot under the Lock icon for that layer. **To unlock a layer**, click the <i>Lock icon</i> in that layer’s row. **To lock all layers**, hold down <i>Cmd</i> and click the <i>Lock button</i> in the local toolbar.\n\n**To make a layer a Service layer**, select it and click the <i>Service button</i> in the local toolbar, or click the dot under the <i>Service icon</i> for that layer. **To remove the Service attribute from a layer**, click the <i>Service icon</i> in that layer’s row, or select it and click the icon in the local toolbar. **To add the Service attribute to all layers**, hold down <i>Cmd</i> and click the <i>Service button</i> in the local toolbar.\n\n**To show a layer as a wireframe**, select it and click the <i>Wireframe button</i> in the local toolbar, or or click the dot under the <i>Wireframe icon</i> for that layer. **To switch off wireframe**, click the <i>Wireframe icon</i> in that layer’s row, or select it and click the icon in the local toolbar. **To show all layers as wireframes**, hold down <i>Cmd</i> and click the <i>Wireframe button</i> in the local toolbar.\n\n**To assign a custom color to a master**, click the color dot in the layer's properties to open the standard Colors dialog box, where you can choose a color.\n\n**To automatically match masters for the whole glyph**, click the <i>Match Masters button</i> in the panel’s status bar.\n\n**To merge all the layers marked visible in the panel**, click the <i>Merge visible layers button</i>.\n\t\n**To show/hide the mask layers in the panel**, use the <i>Show Mask Layers toggle</i>.\n",
  "panel.measurements": "Measurements panel; The **Measurements panel** is a table where you can keep track of the most important proportions and numerical values of your design. \n\nThe panel’s rows are predefined **measurements** for uppercase and lowercase letters: vertical and horizontal round and straight stems and their ratios, counters, overshoots, the contrast and some font-wide dimensions. **To show/hide** some measurements, click the <i>Options</i> button at the bottom. \n\nThese measurements are **for your reference only**, and are independent of the font’s technical values in Font Info. FontLab will save them in your VFC/VFJ, but **not** write any of those values (e.g. stems or Ascender) into Font Info or the exported font. \n\nIf you have multiple masters, the first column shows the measurements for the current master, then values for all masters are shown. To **switch the master**, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the the column heading. \n\n**To enter your own value**, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> a cell. \n\nTo **auto-calculate** some measurements, select the cells in the panel and click the <i>Recalculate</i> button at the bottom. This is useful if you’ve added more glyphs to your font or have entered some custom values that you no longer need. Note: auto-calculation uses Latin glyphs from your font. \n\nIf you need to note down a **custom measurement** that is not in the list, use **any** predefined measurement row to your liking. \n",
  "panel.metrics": "Metrics panel; The **Metrics panel** shows the name and metrics, i.e. the width, and left and right sidebearings, of all the glyphs in the current font, with an option to preview glyphs one at a time.\n\n**To search for a glyph** in the panel, type its name in the <i>Filter</i> field.\n\n**To preview a glyph and its metrics**, select it in the list and use the <i>Show metrics preview</i> to open the preview.\n\n**To edit a glyph’s width or sidebearings directly in the table**, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the value. \n\n**To link the sidebearing(s) of a glyph with another one**, put the second glyph’s name in the sidebearing field instead of a numerical value. \n\n**To bind a glyph’s sidebearing(s)**, add an equal sign before the numerical value.\n\n**To add a glyph to the Glyph window**, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> its name in the panel. If you select the <i>HOH</i> toggle before <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b>ing the glyph name, it will open in the Glyph window with additional characters surrounding it for reference: **HOH** for uppercase glyphs and **non** for lowercase ones.\n",
  "panel.node": "Node panel; The **Node panel** shows all the properties of the selected node and allows one to edit them. Click any node on the contour to see its properties in the Node panel.\n\nThe **Node** field shows the name of the node. Usually nodes do not have names, but if you are going to hint manually or interpolate the font you may need to name your nodes. **To auto-generate the name for a selected node**, click the <i>Generate</i> button to the right of the field. A name will be assigned to the node based on its order in the contour.\n\nThe **Position** fields show the x and y coordinates the node occupies in the glyph space. If the selected node is a Bézier Control Point (BCP), then clicking on the pin button to the right of the co-ordinates will show its relative position from the on-curve point where it originates.\n\nThis field shows the **Type** of the selected node – smooth or corner; and X-servant, Y-servant or Genius. **To change the node type**, click the appropriate icon. **To apply the same change to several nodes at the same time**, select all of them and making the required change only once.\n\n**To convert a corner node into a Smart corner**, select the node and click the <i>Smart</i> button. Note that this option is only activated if the selected corner is not smooth. **To edit the radius of the Smart corner**, type the new value in the <i>R field</i>.\n",
  "panel.output": "Output panel; The **Output panel** is used by the macro system to show the results of macro program interpretation from the <i>Scripting panel</i>, and by OpenType features compiler to show error messages and warnings that come up from the features written in the <i>Features panel</i>.\n\n**To open the contextual menu of the panel**, Right-<b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> anywhere in text area of the panel. The menu has three operations – <i>Copy</i>, <i>Select All</i> and <i>Clear</i>.\n\n**To erase all of the panel's contents**, press <i>Clear</i> in the contextual menu, or click <i>✕</i>.\n",
  "panel.pairsandphrases": "Pairs and Phrases panel; The **Pairs and Phrases panel** can be used with the Spacing modes of the Glyph Window when working on glyph metrics and kerning. \n\n**To find a pair in the list**, type in search words in the <i>Filter</i> field. Remember that this search is case-sensitive.\n\n**To edit the content of the panel**, click the <i>Texts</i> button on the bottom-right. This will open the **Texts** modal, where you can edit the sample texts. **To go back to the original default texts**, click the <i>✕</i> or <i>Reset to defaults</i> button. Click outside the modal to close it.\n\n**To load a custom text file**, click the <i>Open Pairs file</i> button and choose the file in the standard open dialog.\n\n**To browse phrases in the Glyph window with the Metrics or Kerning tool selected**, use , <b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b><small>PG</small>U<small>P</small></b></b>/<b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b><small>PG</small>D<small>N</small></b></b> (<b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b><small>FN</small></b>­·<b>↑</b></b> and <b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b><small>FN</small></b>­·<b>↓</b></b>).\n\n**To open a phrase/pair from the list in the Glyph window**, select it in the panel.\n\nThe panel can show two separate text samples, which can be chosen using the selector at the bottom of the panel. **To see pair phrases used for editing kerning**, select <i>Pairs</i>. **To see text phrases used for metrics editing**, select <i>Texts</i>. **To let the application toggle between the two based on the active tool**, select <i>Auto</i>.\n\nWhen the <i>Pairs</i> option is selected, the panel shows the kerning value for each pair, if defined, and offers the following options:\n\n- **To compress kerning classes**, click the <i>Compress kerning classes</i> button to the right of the <i>Filter</i> field.\n\n- **To autokern one or more pairs**, select the pairs in the list and then click the diamond-shaped <i>Autokern selected pairs</i> button.\n",
  "panel.preview": "Preview panel; The **Preview panel** is a text editor within FontLab, where you can type any text using the current font or a font selected in the Fonts panel, and change its size, alignment, turn its OpenType features on/off, etc.\n\n**To open the sidebar with panel settings**, click the button in the top-right of the panel. It contains the following:\n\n- The **Content** menu with the following options:\n\n1. **Echo Text** shows the current glyph(s) from the Glyph window or glyph(s) selected in the Font window.\n2. **Custom** allows you to type or paste your custom text into the panel.\n3. **Context** shows the current glyph between the reference characters: `nn@oo@HH@OO` where `@` stands for the current glyph. Click the wheel to customize.\n4. **Text Waterfall** displays custom text (or in its absence, the current glyph(s)) in descending sizes\n5. **Glyph Waterfall** displays the current glyph in descending sizes\n6. **Clones** shows all glyphs containing the same element references as the current glyph\n7. **Anchors** shows all virtual composite glyphs with the current glyph as base\n\nWhen the panel has content set to Echo Text and you click the panel and type in some text, content changes to Custom. Click the button in the bottom-right of the panel to set content back to Echo Text.\n\n**To copy the glyphs in the Preview panel to the Glyph window**, open the Glyph window and use upward arrow shaped <i>Copy content to window</i> button, which is available in the Current, Custom, Context, Clones and Anchors modes.\n\n**To open one glyph in the Glyph window**, <b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b><small>2×CLICK</small></b></b> on it in the Preview panel. This works in all modes except Text Waterfall.\n\n- The **Master** menu allows you to choose between the active layer/master of a variable font, and an instance. **To preview the active layer/master** (as selected in Layers and Masters panel), select <i>Active</i>. **To preview the “virtual instance”**, select <i>Instance</i>.\n\n- Use the **Size** menu to choose the font size of the displayed text samples. In the Text Waterfall and the Glyph Waterfall modes, you can set the number of steps in the waterfall, as well as the different text sizes within it. In the other modes, you can choose from a list of pre-defined sizes.\n\n- Use the **Align** options to left, center or right align the text you are previewing.\n\n- From here, you can apply two **Filters** to the glyphs you are previewing: **Inverted Preview** lets you preview your glyphs in white on a black background; **X-Ray** renders the glyphs as simplified vertical bars so you have a general feel for spacing; **Blurred Preview** lets you set a specified degree of blur on the glyphs. All filters can be applied at the same time.\n\n- Use **Horizontal Flip** and **Vertical Flip** to flip your glyphs, to judge your glyph shapes and their stroke balance better.\n\n- click **Features**, to open a dialog with a list of all OpenType features in the font. **To select the features you want to preview**, select them in the dialog. Use the <i>Unselect all features</i> if you want to remove all selections. When previewing, make sure the right script is chosen at the bottom of the dialog. **To turn features off**, uncheck the box after Features in the panel. **To see and edit names of glyphs used in the text**, click the <i>Show glyph names</i> button. Once enabled, two bars will appear at the bottom of the panel with the glyph names. You type in the top bar directly to edit the text and the bottom bar shows the resulting glyph names.\n\n- Use the **Outline** menu to choose if you would like to see the glyph(s) as regular (choose Outline None for that), or unfilled with a Thin, Normal or Thick outline. To see nodes, click the <i>Show nodes</i> button.\n\n- Use the **Tracking** menu to change tracking by predefined values between -100 units to 100 units.\n\n- Use the **Slant** menu to slant the glyphs you are previewing by predefined values between -15° to 15°.\n\n- Use the **Scale** menu to preview the glyphs as horizontally scaled. 100% means that the glyphs are not scaled at all, negative values will make them narrower, and positive values will make them wider.\n\n- Use the **Colors** dropdowns to set the color of the glyph and the background.\n\n- Click **Stroke** to display an additional stroke around the glyphs; move the slider to the left to add stroke thickness in background color so the glyphs appear lighter, move it to the right to add thickness in text color so the glyphs appear bolder. \n",
  "panel.scripting": "Scripting panel; The **Scripting panel** is the place to create and run Python scripts in FontLab.\n\nUse the <i>hamburger</i> menu in the local toolbar to perform the following operations:\n\n- **New Script** closes the currently opened script and clears the panel’s contents allowing you to start a new script\n- **Open Script** closes the current script and opens the standard Open dialog box allowing you to select and open the script file\n- **Save Script** saves changes to the currently opened script\n- **Save Script As** saves the current script to a new file\n- **Clear Python Context** resets the Python dictionary state before running every new script\n- **Clear Python Context Now** resets the Python dictionary state.\n\n**To run the currently edited script**, click the triangle-shaped <i>Run script</i> button.\n\nUse the <i>Search</i> field **to search within the currently opened script**.\n\nclick the first button on the right-hand side of the Scripting panel's local toolbar **to open the List of scripts**. \n\n**To add a folder with scripts**, click the plus-shaped <i>Add scripts folder</i> button. This will bring up the standard Open dialog. If a folder contains at least one file with a .py extension it will appear in the Scripts list. Any scripts you add here will become available in the Scripts Menu, from where you can run them quickly without opening the Scripting panel.\n\n**To remove a folder with all its scripts**, select it in the list and click the minus-shaped <i>Remove scripts folder</i> button.\n\n**To update the list contents (after you moved or renamed script files in Finder)**, click the <i>Refresh folders</i> button.\n\n**To open a script**, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> it in the list.\n\n**To open the Output panel** to see the result of your macro program interpretation, click the <i>Output panel</i> button on the top-right of the panel.\n\n**To open the Python console**, click the <i>Console panel</i> button on the top-right. This is the interactive Python shell where you can communicate with Python using the command line. Unlike the commands you write in the editor that need to be run before you see any response, you can enter Python commands in the Console and get an immediate response.\n",
  "panel.source": "Source panel; The **Source panel** contains the source code of the current glyph and all its layers. In this panel, you can edit a glyph by making changes to its source code.\n\n**To select whether you want to see the source code of the current glyph, layer or element**, use the toggle at the top-left of the panel.\n\n**To apply the changes you have made to the code**, click <i>Apply</i>.\n\n**To revert to back your changes**, click the <i>Revert</i> button.\n",
  "panel.stroke": "Stroke panel; The **Stroke panel** shows stroke attributes for selected elements. \n\n**To add a stroke to a selected element**, select <i>Set stroke</i> in the Style toggle. \n\n**To choose the stroke color**, use the <i>Outline</i> dropdown menu that opens up a palette of colors to choose from. click the <i>ellipsis</i> button in the palette to open the Color panel.\n\nUse the <i>width</i> slider **to modify the stroke width**, or enter a value in the input field on its right.\n\n**To choose between round, flat and square cap**, use the <i>cap</i> toggle.\n\n**To choose between round, flat and miter joins between strokes**, use the <i>joins</i> toggle. If you choose miter, the input field below will become active for you to input a miter value.\n\n**To apply the stroke to the selected element**, click <i>Apply</i>.\n\n**To remove the stroke from a selected element**, select <i>No stroke</i> in the Style toggle.\n",
  "panel.swatches": "Swatches panel; The **Swatches panel** is where you can manage standard and custom swatches of colors, and apply them to contours and their fills at the level of entire elements.\n\n**To choose which palette to view in the panel**, click the <i>Palette</i> dropdown and choose between: <i>Custom</i>, <i>Standard</i>, <i>Light</i>, <i>Dark</i> and <i>Photoshop</i>.\n\n**To select the viewing mode in the panel**, use the <i>Mode</i> toggle to choose between <i>Grid mode</i> and <i>List mode</i>.\n\n**To change the contour color of the element**, click the ring in the top left corner of the local toolbar, select the swatch and click <i>Apply</i>, or <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the color in the list. If the ring is already colored, and you would like to remove the color, click the small circle with the red diagonal line across it.\n\n**To change the fill color of the element**, click the circle in the top left corner of the local toolbar, select the swatch and click <i>Apply</i>, or <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the color in the list.\n\n**To add a new swatch to a palette**, open the Color panel and mix a color of your choice, then press the plus-shaped <i>Add color</i> button in the status bar of the Swatches panel.\n\n**To duplicate a swatch**, select it and then go the palette where you would like to duplicate it and then press the plus-shaped <i>Add color</i> button in the status bar of the Swatches panel.\n\n**To remove a swatch**, select it and press the minus-shaped <i>Remove color(s)</i> button in the status bar.\n\n**To rename a swatch in the palette**, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> its name in the list mode, type the new name and press <i>Enter</i> or click the mouse cursor anywhere else in the window.\n\n**To manage palettes**, click the <i>Hamburger</i> button in the status bar, which will open up the **Palettes dialog**. In this this dialog you can:\n\n- **To preview a palette in the dialog**, click its name.\n- **To add a new palette**, click the plus-shaped <i>Add palette</i> button. A new palette will be added. You can type in the name you would like for it, and hit <i>Enter</i>. Once a panel has been created, you can add swatches to it.\n- **To duplicate a palette**, select a palette in the list and press the <i>Duplicate selected palette</i> button.\n- **To remove a palette**, select a panel in the list and press the minus-shaped <i>Remove selected palette</i> button.\n- **To save a palette**, select it in the list and press the <i>Save selected palette to the file</i> button. The standard Save dialog will open: here you can choose where to save this palette and what to call it. Palette files are saved with .palettes extension.\n- **To open a palette in the Swatches panel**, click the <i>Open palette file</i> button. This will bring up the standard Open dialog, where you can choose any .palettes file to open.\n- **To reset palettes to default**, click the <i>Reset palettes to default</i> button.\n\n**To apply the operations you have done in the dialog**, click <i>OK</i>.\n",
  "panel.tables": "Tables panel; Store, edit and export custom table definitions for arbitrary OpenType tables in the **Tables panel**. Override the tables that FontLab exports by default or add tables that FontLab does not support.\n\nOpen an existing OTF or TTF and FontLab will decompile font tables except those listed in the <i>Preferences › Open Fonts › Do not import these tables to Tables panel</i>. The table definitions in the TTX syntax will appear in the Tables panel.\n\n**To add a definition** for a new table, click <i>+</i>, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> the `xxxx` table tag and type your desired table tag. Then input a valid TTX definition for that table in the editing area.\n\n**To perform a basic verification** of your custom table definition, select it and click **Verify**.\n\n**To remove a table definition**, click <i>–</i>.\n\n**To enable** custom table definitions **for export**, turn on their checkboxes. When you export a non-variable OpenType font (OTF or TTF), FontLab will override the tables it generates with enabled custom tables, and will add any enabled custom tables that are suitable for the format.\n",
  "panel.transform": "Transform panel; The **Transform panel** allows you to apply geometric transformations to a selected area or the whole glyph layer when in the Glyph window, or to several selected cells when in the Font window.\n\nBefore you apply a transformation to a whole layer or selected area, **set the transformation origin using the nine-point reference locator** on the top-left.\n\n**To apply the transformations you have performed**, click <i>Apply</i>.\n\nUse the <i>Reset button</i> **to change all fields back to their original values**.\n\nThe following transformations are available in the panel:\n\n- **Flip**: **To mirror the layer or selection horizontally or vertically**, use the flip buttons.\n\n- **Align**: Use these buttons **to align selected objects vertically or horizontally**.\n\n- <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> (Offset)++: The offset transformation offers two modes: if the offset location icon is visible, you can **offset to the absolute position** defined by the values you enter for X and Y co-ordinates; while if the offset move button is visible, you can **move by the designated distance** based on the the values you enter for X and Y co-ordinates. **To switch between the offset modes**, click the icon that is currently visible. Positive X and Y <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> values move the layer or selection right and up, and negative values move them down and left.\n\n- **Scale**: The scale transformation lets you **scale the layer or selection either proportionally and non-proportionally**. Proportional scaling, the default, is represented by proportional scale icon. click the icon to toggle non-proportional scaling, represented by non-proportional scale icon. Values for scaling can be added in either percentage (displayed as %) or absolute units (displayed as u). Clicking on the currently selected method opens a dropdown menu where you can choose the option you prefer.\n\n- **Rotate**: **To rotate the layer or your selection**, enter the rotation angle in degrees. Positive values will rotate counter-clockwise and negative values rotate clockwise. You can also click the corresponding icon to enter the rotation value.\n\n- **Slant**: **To slant the layer or your selection**, enter the slant angle in degrees. Positive values slant to the right, and negative values slant to the left. You can also click the corresponding icon to enter the slant value.\n",
  "panel.variations": "Variations panel; The **Variations panel** is the primary place where one sets up and controls Variable Fonts.\n\nThe Variations panel has two main viewing modes: \n\n1. **List view** shows all axes at all times as a list. Within this view, you can perform the following operations:\n\n- **To switch between masters and instances**, click the corresponding button below the list.\n- **To add an instance**, switch to the <i>Instances</i> mode, use the slider to pick a position or enter a numeric value in the field and click the + sign below the list. \n- **To remove an instance**, in the <i>Instances</i> mode, select the instance and click the - sign below the list. \n- **To interpolate using different value for X and Y directions**, use the purple and green dials in the panel. The purple dial controls the X direction and the green one the Y direction. The values can be set between 0 to 200, and modified by moving the dial control (represented by a black line) to the left to reduce the value or to the right to increase it. You can also click the number in the middle of the dial to manually enter the value or use the number stepper.\n\n2. **Map view** shows a visual/spatial representation with full detail of up to two axes at once, including position of masters. Within this view, you can perform the following operations:\n\n- **To change the axes you want to see in the map**, click the underlined name of the currently selected horizontal or vertical axes and select a different axis from the list. Any axes that are not being shown in the spatial visualisation, appear as sliders below the map.\n- **To add a virtual instance**, click anywhere on the map and a virtual instance will be added, represented by a blue dot.\n- **To move the position of the virtual instance**, click it and <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> anywhere within the design space. Alternately, click a new position in the design space, and the virtual instance will appear there. You can also click the coordinates of the virtual instance, and enter new values by typing them in.\n\n**To show all opened fonts belonging to the same family in the Variations panel as if they were master fonts**, click the\n<i>Append master fonts</i> toggle. This doesn't create master fonts, but only shows the position of the family members in the design space. \n\n**To automatically sort contours and points when you add existing fonts as masters**, click the <i>Sort Contours and Start Nodes</i> button. This operation will make the order of elements, contours and points consistent. Note that this operation assumes that both masters have the same number of nodes (only on-curve and TT off-curve points, not handles).\n\n**To automatically detect and fix compatibility issues in the nodes of the masters**, click the <i>Check masters geometry</i> button. This operation will detect if there are problems with types of nodes (smooth/sharp), types of segments (line/curve) and take care of situations where elements have been rotated. If something is wrong with nodes and contours compatibility FontLab will try to fix this automatically.\n\n**To put the virtual instance back to its default position**, click the <i>Reset</i> button.\n\n**To add a glyph master**, click the plus-shaped <i>Add master</i> button in the panel’s toolbar. This will bring up a dialog where you can name the new master, decide whether it is for the current glyph, selected glyphs or all glyphs in the font and choose if the layer should be added even if it exists in the glyphs or not. The new master is added at the position of the “virtual” instance.\n\n**To add a font master**, click the <i>Generate instance as master or font</i> button at the far right of the local toolbar. This will bring up a dialog where you can choose whether you want to create a new font master or an instance font at the position of the virtual instance. click <i>Master</i> or <i>Font</i> to choose what kind of master you want to add.\n",
  "panel.view": "View panel; The **View panel** is used to toggle the visibility, snapping behavior and lock status of various details of the Glyph window. The panel is divided into three parts. The top part contains buttons that control details that help in drawing and editing contours:\n\n* **Preview Rounding** turns on the Rounding Coordinates mode that turns off fractional precision for outline editing and transformations.\n*\t**Power Nudge**\tturns on the Power Nudge editing mode, which automatically identifies additional nodes and handles that should be nudged along with your selected nodes, and moves them to produce the best possible result.\n*\t**Show Tunni Lines** allows you to edit curves using Tunni Lines.\n*\t**Suggest Nodes**\tturns on Suggest Nodes mode, where FontLab shows dotted lines suggesting where to put nodes so they are aligned to existing nodes.\n*\t**Suggest Bounds** turns on Suggest Bounds mode, which adds a smart guide on the edge of the element and on the element center.\n*\t**Suggest Tangents** turns on Suggest Tangents mode, which suggests that some points that are configured like tangent points, maybe ought to be actual tangent points.\n*\t**Suggest Stems**\tturns on Suggest Stems mode, which adds a smart guide on a distance to the vertical/horizontal line that is equal to the thickness of a standard stem.\n\nThe second part of the panel allows you to do all the actions available in the <i>View › Show</i>, <i>View › Snap</i> and <i>View › Lock</i> menus along with letting you choose the outline or mask layer for editing. **To choose an outline or mask layer for editing**,  click its name in the panel. The chosen layer  will be displayed in bold. This part of the panel is organized like a table:\n\n- The first column controls an item’s **visibility in the Glyphs window**. It corresponds to commands in <i>View › Show</i>. \n- The second column controls the **“snap to” feature**, and corresponds to commands in the <i>View › Snap</i> menu.\n- The third column lets you **lock items**, and corresponds to the commands in <i>View › Lock</i> menu. Outline cannot be locked. The Grid and the Global Mask are always locked so the corresponding checkboxes are not available.\n\nWith the panel you can easily control all items at once using the clickable icons above the list – <i>Show</i>, <i>Snap</i> and <i>Lock</i>.\n\nThe third part of the panel controls the visibility of the following items:\n* **Nodes**\tmakes all nodes visible\n*\t**Coordinates**\tshows coordinates for selected nodes\n*\t**Handles**\tmakes all handles visible\n*\t**Curvature**\tmakes curvature or curve tension visible\n*\t**Anchor cloud** shows the “cloud” of anchored elements\n*\t**Kerning classes**\tmakes the cloud of all glyphs belonging to the same kerning class visible in Kerning mode\n*\t**Node links** shows green arrows that link nodes to Power Guides\n*\t**FontAudit**\tshows FontAudit arrows that point to odd points and suspicious curves or technical errors\n*\t**Measurement line** shows the Measurement Line, which is an optional horizontal line you can use to force the calculation of sidebearings at a particular position, instead of from the farthest extremes of the glyph.\n*\t**Element frame**\tshows gray rectangles around an element with element name if assigned, and number of references\n*\t**Element references** shows red arrows that connect Element References\n*\t**Character placeholders** shows the light gray template image showing what character should go in that glyph cell\n*\t**Hints and Metrics shadows**\tshows light gray “shadows” of hints and alignment zones\n*\t**Smooth outline** shows the outlines rendered smooth, but this can slow performance down\n*\t**Metrics table**\topens the Metrics table where you can edit spacing and kerning\n*\t**Text bar** opens the Text Bar, a horizontal text field where you can edit the “source” of the text that is shown in the Glyph window\n*\t**True fill**\ttoggle can be used to switch the glyph fill to 100% opaque, while keeping it possible that other items like nodes, handles, curvature, etc. can also be made visible\n*\t**Master relations** shows lines connecting corresponding nodes of different masters\n* **Cousins**\tturns Cousins on/off\n",
  "reference.glyphrecipes": "Custom Glyph Recipes; In <i>Font › Generate Glyphs › Custom</i>:\n\n- Put multiple glyph names in one or more lines to use built-in glyph recipes.\n- Turn **on** <i>Use simple (FLS5) syntax</i> and put each glyph recipe in a separate line to mix both simple and extended syntax: a recipe prefixed with `!` uses extended syntax (`!Aacute = A + acute`), otherwise simple syntax (`A+acute=Aacute`).\n- Turn **off** <i>Use simple (FLS5) syntax</i> to only use extended syntax (one glyph recipe per line).\n\n#### Simple syntax\n\n- attach **mark**: `A+dieresis` — `_anchor` in mark will snap to `anchor` in base glyph if present\n- specify positioning if no anchors present: `A+^>dotaccentcomb`\n  - place at **origin**: `|`, **left**-align to box: `<`, **right**-align: `>` — otherwise center\n  - place at **baseline**: `~`, **raise** by _caps height – x-height_: `^` — otherwise raise if base is uppercase\n  - extra **shift** by UPM size ‰: `A+|-200~50acutecomb`\n- build **ligatures**:\n  - marks attach to each base component: `f&f`, `f_f&i`, `T+acutecomb&A+gravecomb`\n  - marks attach to first component, wrap glyph names that contain `_` in `'`: `f_f`, `'f_f'_i`\n- spaces **not** permitted\n\nType _simple_recipe_ into **auto layer** recipe field: `A+acute`.\n\nType newline- or space-separated _simple_recipe_`=`_result_glyphName_ entries into <i>Font › Generate Glyphs › Custom</i> — with <i>Use legacy (FLS5) code</i> **on**: `A+acute=Aacute`.\n\n#### Extended syntax\n\n- **ligatures**: `= f & i`, with kerning: `= A &\\ V`\n- attach **mark** at 0,0: `= A + ringcomb + acutecomb`\n- attach `_top` mark anchor at `top` anchor: `= A + ringcomb@top`\n- attach mark at `x,y`: `= A + acute@200,-100`\n- attach a mark at % of boxes: `= A + acute@10%,80%`\n- use named **parameters**: _guideName_, `descender`, `xHeight`, `capHeight`, `ascender`, `left`, `right`, `innerLeft`, `innerRight`, `width`, `bottom`, `top`, `origin`, `center`: `= a + ogonek@center,innerRight`\n- **flip** vertically: `= M@,~`\n- flip horizontally: `= A + grave@~center,top`\n- flip H & V: `= g + commaaccent@~center,~top`\n- apply transformation **matrix**: `= A + acute@1, 0, 0, 1, 100, 100`\n- use **expressions**: `` = A + ring@center,`top+10` + acute@center,`top-10` ``\n- refer to different **preceding** glyph: `= A + acute@50%,top + ogonek@A:innerRight`\n- set advance **width**: `= A + acute ^ 400` or `= A + acute ^ A * 2`\n- set **sidebearings**: `= A + acute ^ 30, 30` or `= A + acute ^ A / 3, B * 2`\n- spaces **are** permitted but not required\n\nType `=`_extended_recipe_ into **auto layer** recipe field: `= A + acute`.\n\nType newline-separated _result_glyphName_ `=` _extended_recipe_ entries into <i>Font › Generate Glyphs › Custom</i> — with <i>Use legacy (FLS5) code</i> **off**: `Aacute = A + acute`.\n\n#### Both syntaxes\n\n- add `Custom note` to glyph: `= A+acutecomb #!Custom note`\n- comment (ignored): `A+acute # comment`\n",
  "reference.markdown": "Markdown and HTML in glyph notes; <h1>Markdown and HTML in glyph notes</h1>\n\nIn glyph notes, you can use a subset of Markdown and HTML. In both Markdown and HTML, there is a concept of _blocks_ and of _inline elements_.\n\nBlocks occupy the full width of the document. Each new block creates a line break. Examples of blocks include paragraphs, headings, tables and lists.\n\nInline elements are pieces of formatting that flow with the text inside a block and don’t create a line break. Typical examples of inline elements are emphases (bold or italic) and links.\n\n<h1>Markdown blocks</h1>\n\nMarkdown is plain text with a few non-alphabetic characters that are used to apply formatting.\n\nType Enter twice to get a blank line, which starts a new _Markdown block_. Each Markdown block has a blank like above it and below it.\n\nTo make the largest H1 heading, like the one above, make a block and start the line with one hash (`#`) followed by a space.\n\n<pre>\n# Markdown blocks\n</pre>\n\nTo make a paragraph of text, put a blank line, type your text, and put another blank line using Enter. A paragraph is the most basic Markdown block.\n\nAdd a blank line to start a _new paragraph_.\n\nAdd another blank line to start a new paragraph.\nAdd a simple linebreak to stay in the same the paragraph.\n\nTo get the above result, type:\n\n<pre>\nTo make a paragraph of text, put a blank line, type your text (...).\n\nAdd a blank line to start a *new paragraph*.\n\nAdd another blank line to start a new paragraph.\nAdd a simple linebreak to stay in the same the paragraph.\n</pre>\n\n## Markdown lists\n\nTo get a H2 heading, start a new Markdown block with two hashes (`##`) followed by a space.\n\n<pre>\n## Markdown lists\n</pre>\n\n### Unordered Markdown lists\n\nA new Markdown block that starts with three hashes (`###`) gives a H3 heading.\n\n<pre>\n### Unordered Markdown lists\n</pre>\n\nTo make _unordered_ (bulleted) Markdown lists, start a new block and prefix each line with an asterisk (`*`), a hyphen (`-`) or a plus (`+`). Indent sub-levels with at least two spaces.\n\n-   Unordered list item with `-`\n-   Another unordered list item with `+`\n    -   Unordered sub-list item with `-` indented by two spaces.\n    -   The next sub-list item must use the same indent.\n-   Another unordered list item with `*`\n\n    Paragraphs indented the same way as a list item will align to that list item.\n\n    If you indent a paragraph, each indented line after a break creates a new line.\n    Note that this line is separate, but within the same paragraph.\n\nTo get the above result, type:\n\n<pre>\n- Unordered Markdown list item with `-`\n+ Another unordered list item with `+`\n  - Unordered sub-list item with `-` indented by two spaces.\n  - The next sub-list item must use the same indent.\n* Another unordered list item with `*`\n\n  Paragraphs indented the same way (...)\n\n  If you indent a paragraph, each (...)\n  Note that this line is separate (...)\n</pre>\n\n### Ordered Markdown lists\n\nTo make ordered Markdown lists, use numbers followed with a period (`.`). The actual numbers don’t matter, the list will be automatically numbered. Indent sub-levels with at least two spaces.\n\n1.  First ordered list item\n2.  Another item\n\n-   Unordered sub-list.\n\n1.  Actual numbers don't matter, just that it's a number\n\nTo get the above result, type:\n\n<pre>\n1. First ordered list item\n2. Another item\n  * Unordered sub-list.\n1. Actual numbers don't matter, just that it's a number\n</pre>\n\n## Other Markdown headings\n\n#### Heading 4\n\n<pre>\n#### Heading 4\n</pre>\n\n##### Heading 5\n\n<pre>\n##### Heading 5\n</pre>\n\n###### Heading 6\n\n<pre>\n###### Heading 6\n</pre>\n\n## Blockquotes\n\n> Blockquotes are indented paragraphs.\n> This line is part of the same indented paragraph.\n\nNormal paragraph break.\n\n> Since this is a block, **use Markdown**\n> and <font color=\"#ff3e00\">HTML</font> inline.\n\n<pre>\n&gt; Blockquotes are indented paragraphs.\n&gt; This line is part of the same indented paragraph.\n\nNormal paragraph break.\n\n&gt; Since this is a block, **use Markdown**\n&gt; and &lt;font color=&quot;#ff3e00&quot;&gt;HTML&lt;/font&gt; inline.\n</pre>\n\n## Horizontal rule\n\nPut three or more hyphens (`---`), asterisks (`***`) or underscores (`___`) into a line surrounded by blank lines to make a horizontal rule.\n\n---\n\n<h1>Inline elements</h1>\n\nInside any Markdown text (also inside tables), you can surround some text with simple Markdown codes or with HTML tags to apply additional formatting. Text wrapped this way is an inline element. It flows with the text and doesn’t create a line break.\n\n## Common Markdown and HTML inline elements\n\n| Markdown/HTML          | Description                                |\n|:-----------------------|:-------------------------------------------|\n| `**abc**`              | surround with two asterisks **for bold**   |\n| `__abc__`              | surround with two underscores **for bold** |\n| `<b>abc</b>`           | HTML `b` <b>is bold</b>                    |\n| `<strong>abc</strong>` | HTML `strong` <strong>is bold</strong>     |\n| `_abc_`                | surround with one underscore _for italic_  |\n| `*abc*`                | surround with one asterisk _for italic_    |\n| `<i>abc</i>`           | HTML `i` <i>is italic</i>                  |\n| `<em>abc</em>`         | HTML `em` <em>is italic</em>               |\n| `<small>abc</small>`   | small <small>is small text</small>         |\n| `<sub>abc</sub>`       | sub <sub>is subscript</sub>                |\n| `<sup>abc</sup>`       | sur <sub>is superscript</sub>              |\n| `<nobr>abc</nobr>`     | no-break <nobr>keeps words together</nobr> |\n| `<link>abc</link>`     | link <link>is invisible</link>             |\n\n## Other inline HTML elements\n\n| HTML tag                 | Description                            |\n|:-------------------------|:---------------------------------------|\n| `<address>abc</address>` | address <address>is italic</address>   |\n| `<cite>abc</cite>`       | cite <cite>is italic</cite>            |\n| `<var>abc</var>`         | variable <var>is italic</var>          |\n| `<dfn>abc</dfn>`         | definition <dfn>is italic</dfn>        |\n| `<kbd>abc</kbd>`         | keyboard <kbd>input is monospace</kbd> |\n\n<h1>Code</h1>\n\nTo format an inline piece of text as `monospace`, surround it with backticks (\\`) like so <code>\\`abc\\`</code> or with the HTML `code` tag like so `<code>abc</code>`.\n\nTo make a code block, surround your block with the HTML `pre` tag. Markdown also allows surrounding code blocks with three backticks (\\`\\`\\`) but this doesn’t work in glyph notes.\n\n<pre>\nThis is an HTML code block with &lt; and &gt; and &amp;.\n  Indents and line breaks are shown as they are\n  and **Markdown formatting** is ignored.\n</pre>\n\nTo get the above, type the following.\nInside the `pre` tag, type `<` as `&lt;`, `>` as `&gt;` and `&` as `&amp;`.\n\n<pre>\n&lt;pre&gt;\nThis is an HTML code block with &amp;lt; and &amp;gt; and &amp;amp;.\n  Indents and line breaks are shown as they are\n  and **Markdown formatting** is ignored.\n&lt;/pre&gt;\n</pre>\n\n<h1>Tables</h1>\n\nYou can use an intuitive Markdown syntax to make a simple, borderless, compact table.\n\n- The first row is the header row. Use vertical bar (`|`) to separate the columns.\n- The bars don’t need to align, and the outer bars (`|`) are optional, but each row must contain the same number of bars.\n- The second row must use at least three hyphens (`---`) to separate the header from the actual cells in each column. Optionally use `:` to align columns.\n- Subsequent rows are table cells.\n- You can use Markdown and HTML inside the cells.\n\n| Left-align   |     Center     |    Right-align |\n|:-------------|:--------------:|---------------:|\n| FontLab      | **ultra bold** | type designers |\n| Fontographer |     medium     |      designers |\n| TypeTool     |    _light_     |       students |\n\nTo get the above, type:\n\n<pre>\n| Left-align   |     Center     |    Right-align |\n|:-------------|:--------------:|---------------:|\n| FontLab      | **ultra bold** | type designers |\n| Fontographer |     medium     |      designers |\n| TypeTool     |    _light_     |       students |\n</pre>\n\n<h1>Using HTML</h1>\n\n## Styling HTML\n\nWhen you use HTML tags instead of Markdown:\n\n1. You can use the HTML `div` tag to create an unstyled HTML block, and use CSS to apply\nsome styling to all HTML blocks (lists, paragraphs) inside that block.\n\n2. You can align text by adding the `align` attribute with the possible values `left`, `right`, `center`, `justify`\nto the `h1–h6`, `p`, `div`, `dl`, `dt` block tags.\n\n3. You can wrap some inline text with the HTML `span` tag like so `<span>abc</span>`  and apply CSS styling.\n\n4. To apply CSS styling, add `style` attribute to the tag, and use these CSS properties:\n\n| CSS property                                                     | Description                           |\n|:-----------------------------------------------------------------|:--------------------------------------|\n| `color: #rrggbb`                                                 | Text foreground color                 |\n| `background-color: #rrggbb`                                      | Background color                      |\n| `background-image: <uri>`                                        | Background image                      |\n| `font-family: 'Family Name'`                                     | Font family name                      |\n| `font-size: <size>pt`, `<size>px`                                | Font size, relative or in pt/px       |\n| `font-style: normal`, `italic`, `oblique`                        | Upright, italic or oblique font style |\n| `font-weight: normal`, `bold`, `100–900`                         | Text font weight                      |\n| `text-decoration: none`, `underline`, `overline`, `line-through` | Lines under, over or through text     |\n| `font: <style> <weight> <size> <family>`                         | Font shorthand property               |\n| `text-transform: uppercase` , `lowercase`                        | Show text as uppercase or lowercase   |\n| `font-variant: small-caps`                                       | Show text as small caps               |\n| `margin-top: <len>px`                                            | Top paragraph margin in px            |\n| `margin-bottom: <len>px`                                         | Bottom paragraph margin in px         |\n| `margin-left: <len>px`                                           | Left paragraph margin in px           |\n| `margin-right: <len>px`                                          | Right paragraph margin in px          |\n| `text-indent: <len>px`                                           | First line text indentation in pixels |\n| `word-spacing: <len>px`                                          | Set the width of a word space         |\n| `font-kerning: normal`, `none`                                   | Lets you turn kerning on or off       |\n| `white-space: normal`, `pre`, `nowrap`, `pre-wrap`               | Treating whitespace                   |\n| `float: left`, `right`, `none`                                   | Let text flow around a table or image |\n| `page-break-before: auto`, `always`                              | Page break before a paragraph/table   |\n| `page-break-after: auto`, `always`                               | Page break after a paragraph/table    |\n\n##### Examples\n\n<h2 align=\"center\">Centered HTML Heading 2</h2>\n\n<pre>\n&lt;h2 align=&quot;center&quot;&gt;Centered HTML Heading 2&lt;/h2&gt;\n</pre>\n\n<h3 style=\"font-family: Georgia\">HTML Heading 3 with font</h3>\n\n<pre>\n&lt;h3 style=&quot;font-family: Georgia&quot;&gt;HTML Heading 3 with font&lt;/h3&gt;\n</pre>\n\n<p align=\"right\" style=\"color: #ff3e00; background-color: #eaebec;\nfont-variant: small-caps;\">Right-aligned paragraph set in colored\nsmall caps on a background</p>\n\n<pre>\n&lt;p align=&quot;right&quot; style=&quot;color: #ff3e00; background-color: #eaebec;\nfont-variant: small-caps;&quot;&gt;Right-aligned paragraph set in colored\nsmall caps on a background&lt;/p&gt;\n</pre>\n\n## HTML font element\n\nThe HTML `font` tag is no longer recommended in HTML, but you can use surround inline text with it and use attributes to change the text font `face`, `size` and `color` inline. In addition, you can use the `style` attribute with CSS properties.\n\n| Attribute | Explanation           |\n|:----------|:----------------------|\n| `face`    | font family name      |\n| `size`    | font size (unit-less) |\n| `color`   | `#rrggbb`             |\n\nQuick brown <font face=\"Georgia\" size=\"5\" color=\"#ff3e00\" style=\"text-decoration: overline\">font</font> jumps.\n\n<pre>\nQuick brown &lt;font face=&quot;Georgia&quot; size=&quot;5&quot; color=&quot;#ff3e00&quot;\nstyle=&quot;text-decoration: overline&quot;&gt;font&lt;/font&gt; jumps.\n</pre>\n\n## Styling HTML lists\n\n### Unordered HTML lists\n\nIn unordered HTML lists, use `<ul type=\"\">` with the values `square`, `disc` or `circle`.\n\n<ul type=\"square\">\n  <li>Unordered list item with square</li>\n  <li>Another list item</li>\n</ul>\n<ul type=\"disc\">\n  <li>Unordered list item with disc</li>\n  <li>Another list item</li>\n</ul>\n<ul type=\"circle\">\n  <li>Unordered list item with circle</li>\n  <li>Another list item</li>\n</ul>\n\n<pre>\n&lt;ul type=&quot;square&quot;&gt;\n  &lt;li&gt;Unordered list item with square&lt;/li&gt;\n  &lt;li&gt;Another list item&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul type=&quot;disc&quot;&gt;\n  &lt;li&gt;Unordered list item with disc&lt;/li&gt;\n  &lt;li&gt;Another list item&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul type=&quot;circle&quot;&gt;\n  &lt;li&gt;Unordered list item with circle&lt;/li&gt;\n  &lt;li&gt;Another list item&lt;/li&gt;\n&lt;/ul&gt;\n</pre>\n\n### Ordered lists\n\nIn HTML ordered lists, use `<ul type=\"\">` with the values `1`, `a`, `A`.\n\n<ol type=\"a\">\n  <li>First ordered list item</li>\n  <li>Another item</li>\n</ol>\n\n<pre>\n&lt;ol type=&quot;a&quot;&gt;\n  &lt;li&gt;First ordered list item&lt;/li&gt;\n  &lt;li&gt;Another item&lt;/li&gt;\n&lt;/ol&gt;\n</pre>\n\n<h1>Styling HTML tables</h1>\n\nTo create a table with styling (borders, padding etc.), you need to use HTML tables.\n\n### Table attributes\n\n| attribute     | meaning                                |\n|:--------------|:---------------------------------------|\n| `border`      | `0` for no border, `1` for 1px border  |\n| `bgcolor`     | `#RRGGBB`                              |\n| `cellspacing` | space between cells, `val` in pixels   |\n| `cellpadding` | outer inside the cell, `val` in pixels |\n| `width`       | relative (`75%`) or absolute (`260`)   |\n| `height`      | absolute (`260`)                       |\n\n### Table cell attributes\n\nIn HTML tables, you can add the following attributes to the `td` and `th` tags:\n\n| attribute | meaning                                        |\n|:----------|:-----------------------------------------------|\n| `width`   | relative (`20%`), absolute (`50`) or no value) |\n| `bgcolor` | `#rrggbb`                                      |\n| `colspan` |                                                |\n| `rowspan` |                                                |\n| `align`   | `left`, `right`, `center`, `justify`           |\n| `valign`  | `top`, `middle`, `bottom`                      |\n\n### Table CSS properties\n\n| CSS                                               | Description                                |\n|:--------------------------------------------------|:-------------------------------------------|\n| `border-color: #rrggbb`                           | Table border color if `border=\"1\"` or more |\n| `border-style: none`, `solid`, `dotted`, `dashed` | Table border style if `border=\"1\"` or more |\n| `padding: <len>px`                                | All cell padding in px                     |\n| `padding-top: <len>px`                            | Top table cell padding in px               |\n| `padding-bottom <len>px`                          | Bottom table cell padding in px            |\n| `padding-left <len>px`                            | Left table cell padding in px              |\n| `padding-right <len>px`                           | Right table cell padding in px             |\n| `vertical-align: top`, `middle`, `bottom`         | Vertical text alignment in table cells     |\n\n#### Example\n\n<table width=\"100%\" border=\"1\" cellspacing=\"0\" cellpadding=\"5\"\nstyle=\"border-style: dotted; border-color: #d1b434; padding:20px;\">\n  <thead>\n    <tr>\n      <th align=\"left\">Tables</th>\n      <th align=\"center\">Are</th>\n      <th align=\"right\">Cool</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td align=\"left\">col 3 is</td>\n      <td align=\"center\">right-aligned</td>\n      <td align=\"right\">$1600</td>\n    </tr>\n  </tbody>\n</table>\n\nTo get the above result, type:\n\n<pre>\n&lt;table width=&quot;100%&quot; border=&quot;1&quot; cellspacing=&quot;0&quot; cellpadding=&quot;5&quot;\nstyle=&quot;border-style: dotted; border-color: #d1b434; padding:20px;&quot;&gt;\n  &lt;thead&gt;\n    &lt;tr&gt;\n      &lt;th align=&quot;left&quot;&gt;Tables&lt;/th&gt;\n      &lt;th align=&quot;center&quot;&gt;Are&lt;/th&gt;\n      &lt;th align=&quot;right&quot;&gt;Cool&lt;/th&gt;\n    &lt;/tr&gt;\n  &lt;/thead&gt;\n  &lt;tbody&gt;\n    &lt;tr&gt;\n      &lt;td align=&quot;left&quot;&gt;col 3 is&lt;/td&gt;\n      &lt;td align=&quot;center&quot;&gt;right-aligned&lt;/td&gt;\n      &lt;td align=&quot;right&quot;&gt;$1600&lt;/td&gt;\n    &lt;/tr&gt;\n  &lt;/tbody&gt;\n&lt;/table&gt;\n</pre>\n\n<h1>Remarks</h1>\n\n## Links and images\n\nMarkdown lets you include [links](https://www.fontlab.com/) and images ![icon](https://res.cloudinary.com/fontlab/image/fetch/f_auto,w_32,c_scale/https://www.fontlab.com/img/icon-fontlab-vi.png \"title\") but links and images don’t work in glyph notes.\n\n<pre>\nMarkdown lets you include\n[links](https://www.fontlab.com/)\nand images\n![icon](https://www.fontlab.com/img/icon-fontlab-vi.png &quot;title&quot;)\nbut links and images don&#x2019;t work in glyph notes.\n</pre>\n\n## Mixing Markdown and HTML\n\nYou can use HTML tags inside Markdown, and you can use Markdown inside inline HTML, but you cannot use Markdown inside HTML blocks.\n\nSo `_italic <sup>superscript</sup> text_` will produce _italic <sup>superscript</sup> text_,\nand `<i>cited **bold** text</i>` will produce <i>cited **bold** text</i>, but\n\n<pre>\n&lt;div style=&quot;color: #ff3e00&quot;&gt;\n  some **bold** text in a `div`\n&lt;/div&gt;\n</pre>\n\nwill ignore the Markdown formatting and will produce\n\n<div style=\"color: #ff3e00\">\n  some **bold** text in a `div`\n</div>\n\n## Escaping characters in Markdown\n\nTo use characters that are used in Markdown, “escape” (prefix) them with `\\`.\n\n| escape   | escape result         |\n|:---------|:----------------------|\n| `\\\\`     | \\\\ : backslash        |\n| `\\` \\` \\ | \\` : backtick |       |\n| `\\*`     | \\* : asterisk         |\n| `\\_`     | \\_ : underscore       |\n| `\\#`     | # : hash              |\n| `\\+`     | + : plus              |\n| `\\-`     | - : hyphen            |\n| `\\.`     | . : dot               |\n| `\\!`     | ! : exclamation       |\n| `\\{\\}`   | {} : curly braces     |\n| `\\[\\]`   | \\[] : square brackets |\n| `\\(\\)`   | () : parentheses      |\n",
  "sketchboard.focus": "Sketchboard; The **Sketchboard** is a new type of window in FontLab. It is an infinite sheet of virtual paper, on which you can organize your graphical assets: sketches, scans, bitmaps and outline graphics (monochrome or color). On the Sketchboard, you can create multiple frames of sample texts in different sizes using any fonts which are currently open in the application. You can edit glyphs within these frames as if you were in a Glyph Window for that font.\n\nBy default, the Sketchboard opens every time you start FontLab. You can control this with <i>Preferences › General › Open Sketchboard at startup</i>. Use <i>Window › Open Sketchboard</i> to open the Sketchboard window anytime.\n\nUse <i>File › Import › Artwork</i> (or ) to import artwork to the Sketchboard. FontLab allows you to import bitmap images in all major image formats, and drawings in EPS, SVG and AI formats.\n\n<b style=\"font-style: normal;\"><b><small>DRAG-DROP</small></b></b> a font from the Fonts panel to create a text frame. Or activate a Text tool and <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b>/<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> anywhere on Sketchboard. You need to have at least one font open.\n\nWith a text frame active, click <i>Font</i> to change the font, or click the font in the Fonts panel. Use the slider at the left to adjust text size.\n\n**To lock/unlock a text frame**, click the Lock button. Text in a locked frame cannot be changed, but you can still change the frame shape, or remove the frame.\n\n**To convert a text frame into a Glyph window**, click the maximize button. \n\n**To remove the text frame**, click the close button in its upper left corner.\n\nUse <i>File › Export › Window Contents</i> to export the content of your Sketchboard. \n\nUse <i>Window › Clear Sketchboard</i> to clean up sketchboard.\n",
  "tool.brush": "Brush tool; The Brush tool works somewhat like the brush tool in any bitmap editing program. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>B</b></b> to activate it (hold the key to activate it temporarily). \n\nYou begin a brush stroke by holding the mouse button, draw the stroke by dragging, and finish drawing it by releasing the button. <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>DRAG</small></b></b> on a canvas to resize the brush tip. \n\nThe results depend on the brush mode selected in the Property bar.\n\nWith the **Simple brush** mode, the result of your drawing is immediately converted to “outline” contours, and cannot be changed for contours that you have already drawn. Use the <i>Contour tool</i> to edit the contours.\n\nWith the **Power brush** mode (default), the result of your drawing is a skeleton contour with a **Power Brush** filter applied. \n\nIn this case, you can edit the skeleton contour with the Contour tool, as well as edit the size and shape of the brush applied to this stroke using the Property bar or the <i>Brush panel</i>.\n\nEvery time you draw a Power brush contour, you create a new element which includes the contour and the Power brush filter. \n\n**To remove the Power brush filter** and only keep the underlying skeleton contour, select the contour and click the **Remove** button in the Property bar or the Brush panel.\n\n**To convert the Power brush to final “outline” contours**, select the contour and click the <i>Expand</i> button in the Property bar or the Brush panel, or choose <i>Element › Expand Filters</i> from the menu.\n\n",
  "tool.contour": "Contour tool; Use the Contour tool to edit contours and other object in glyph layer ‣ Activate: tap <b style=\"font-style: normal;\"><b>A</b></b> or click 1st Toolbar icon.\n\n#### Node\n\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> **node**: select ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>CLICK</small></b></b>: add to/remove from selection.\n- <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> **node**: convert sharp—smooth ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>CLICK</small></b></b> node: align handles/segments to H/V axis ‣ <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>2×CLICK</small></b></b> **sharp**: normalize sharpness ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>ALT</small></b>­·<b><small>2×CLICK</small></b></b> sharp: make Smart Corner ‣ <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>2×CLICK</small></b></b> **smooth**: G2 harmonize node ‣ <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>ALT</small></b>­·<b><small>2×CLICK</small></b></b> smooth: G3 harmonize handles ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>ALT</small></b>­·<b><small>2×CLICK</small></b></b> smooth: make Genius.\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> node(s): move with handles ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>DRAG</small></b></b>: move with handles along H/V axis ‣ <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b>: move without handles ‣ <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>CTRL</small></b>­·<b><small>DRAG</small></b></b> node(s): move & nudge handles of adjacent segments ‣ <b style=\"font-style: normal;\"><sup>M</sup><b><small>CMD</small></b>­·<b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> **smooth** node(s): move & normalize smoothness ‣ <b style=\"font-style: normal;\"><b>←↑↓→</b></b>: move, <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b>/<b style=\"font-style: normal;\"><sup>M</sup><b><small>CMD</small></b></b>: faster.\n- <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> **smooth** node: slide within segment, **sharp** node: slide within or beyond segment.\n- <b style=\"font-style: normal;\"><b><small>BKSP</small></b></b> node(s): remove & keep the path unchanged ‣ <b style=\"font-style: normal;\"><b><small>DEL</small></b></b>/<b style=\"font-style: normal;\"><b><small>FN</small></b>­·<b><small>BKSP</small></b></b>: break contour & delete adjacent segments.\n\n#### Handle\n\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> **handle**: select ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>CLICK</small></b></b>: add to/remove from selection ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> handle: retract\n- <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> **handle of sharp** node: align angle to opposite ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>2×CLICK</small></b></b> **handle**: align angle to H/V axis ‣ <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>2×CLICK</small></b></b> **handle of smooth** node: slide node to extremum\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> **handle(s)**: move ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>DRAG</small></b></b> **handle**: move & keep angle ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>DRAG</small></b></b> **handles**: move along H/V axis ‣ <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> handle: move & move opposite handle, **of sharp** node: align opposite angle, **of smooth** node: make opposite handle length equal ‣ <b style=\"font-style: normal;\"><b>←↑↓→</b></b>: move, <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b>/<b style=\"font-style: normal;\"><sup>M</sup><b><small>CMD</small></b></b>: faster\n- <b style=\"font-style: normal;\"><b><small>BKSP</small></b></b>/<b style=\"font-style: normal;\"><b><small>DEL</small></b></b> handle(s): convert curve to line segment\n\n#### Segment\n\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> point on an **unselected** segment: edit segment ‣ <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> **segment**: select it if <i>Preferences › Editing › Select segment on outline click</i> is **on**, edit segment with <b style=\"font-style: normal;\"><b>←↑↓→</b></b> if it’s **off** ‣ <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> **selected** segment: duplicate\n- <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> **curve**: convert PS—TT curve, **line**: convert to curve ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> **line**: convert to smooth curve ‣ <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> segment: add node ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>CTRL</small></b>­·<b><small>ALT</small></b>­·<b><small>CLICK</small></b></b>: add extremum\n- <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> segment: select entire contour ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>2×CLICK</small></b></b>: add to/remove from selection\n- <b style=\"font-style: normal;\"><b><small>BKSP</small></b></b> segment(s): remove nodes & keep the path unchanged ‣ <b style=\"font-style: normal;\"><b><small>DEL</small></b></b>/<b style=\"font-style: normal;\"><b><small>FN</small></b>­·<b><small>BKSP</small></b></b>: break contour at adjacent nodes & delete segments\n\n#### Canvas\n\n- <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> **near** segment: select entire contour ‣ <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> near segment: add to/remove from selection\n- <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> **near line**: convert to curve, **near curve**: Balance segment\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> from canvas over **nodes & handles**: **marquee**-select nodes, and if <i>Preferences › Editing › Ignore handles on node marquee selection</i> is **off**, also select handles ‣ <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> over **handles**: select handles ‣ <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> **freeform**-select **nodes & handles** ‣ Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> on drag: add to/remove from selection ‣ <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> **canvas**: deselect\n",
  "tool.element": "Element tool; The Element tool is used to deal with Elements. Click the second Toolbar arrow icon or tap <b style=\"font-style: normal;\"><b>V</b></b> to activate it (hold the key to activate it temporarily).\n\nAn element may be a set of one or more contours, a bitmap image, or a sticker.\n\n<b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> an element to select it, hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to add or remove from the current selection. Nearest node will be highlighted and can be used to properly align element (or selection) to guides and other snap-to structures.\n\nUse <b style=\"font-style: normal;\"><b>←↑↓→</b></b> to move the element (selection). Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> or <b style=\"font-style: normal;\"><sup>M</sup><b><small>CMD</small></b></b> to accelerate movement.\n\n<b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> an element to activate the Contour tool and edit element contours. If the element is locked, has a reference and base glyph is available, that glyph will open for editing next to the current glyph.\n\nIf current element is a group or filter, click any of components to activate it (go one level down). Tap <b style=\"font-style: normal;\"><b><small>ESC</small></b></b> to go one level up.\n\n",
  "tool.ellipse": "Ellipse tool; The **Ellipse tool** draws ellipses, ovals and circles. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>O</b></b> to activate it (hold the key to activate it temporarily). \n\n<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> to create an ellipse. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to create a circle, and <b style=\"font-style: normal;\"><b><small>ALT</small></b></b> to start drawing from the center. \n\nHold <b style=\"font-style: normal;\"><b><small>CMD</small></b></b> to create a “white” ellipse that will be unfilled if it’s inside another contour.\n\n<b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> to add an ellipse which properties you define in the pop-up dialog box.\n\nIn the Property bar, choose between a traditional “geometric” ellipse, or a “curved” ellipse, which uses the font **Tension** parameter.\n\nWhen you draw an ellipse, it will be added to the current element. To start drawing in the new element, tap <b style=\"font-style: normal;\"><b><small>ESC</small></b></b> or choose <i>Glyph › New Element</i> from the menu before you start drawing.\n\n",
  "tool.eraser": "Eraser tool; The Eraser tool is used to erase nodes and/or simplify paths. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>2</b></b> to activate it (hold the key to activate it temporarily). \n\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> or <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> over nodes to remove it. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to keep “strategic” nodes. \n- <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>DRAG</small></b></b> to resize the Eraser. \n- <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>CLICK</small></b></b> a node, and then click another node on the same contour, and the Eraser will simplify the path between those two nodes\n- **<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> on empty canvas** to “draw” a rectangular selector, release the mouse button to remove all nodes inside that selector. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to protect “strategic” nodes.\n- <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> on canvas to “draw” a freeform selector, release the mouse button to remove all nodes inside that selector. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to protect “strategic” nodes. \n\n",
  "tool.fill": "Fill tool; The **Fill** tool is used to fill or unfill contours and contour-like areas by simple <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> or <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>CLICK</small></b></b>. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>F</b></b> to activate it (hold the key to activate it temporarily). \n\nContour-like areas may be formed by self-intersecting contours, closed or open contours. A contour-like area which can be filled (or unfilled) is highlighted every time you move the mouse (with or witout <b style=\"font-style: normal;\"><b><small>ALT</small></b></b>) over it. \n\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> to fill the contour-like area\n- <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> to unfill\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> to fill many areas\n- <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> to unfill them\n",
  "tool.guides": "Guides tool; The **Guides tool** is used to measure distances between different objects in the drawing area. It may be also use to create pins, anchors and element guides. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>G</b></b> to activate it (hold the key to activate it temporarily).\n\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> from any object on canvas to any other object **to measure distance**. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to constrain direction.\n- <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> to create an **element guide**.\n- <b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>CLICK</small></b></b> to add an **anchor**.\n- <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> to add a **pin**.\n",
  "tool.kerning": "Kerning tool; Kerning tool activates the Kerning mode of the Glyph window. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>K</b></b> to activate it.\n\nKerning pairs can exist between two individual glyphs, two classes, a class and a glyph, or a glyph and a class. Use <i>Font › Generate Kerning Classes...</i> to automatically group similar glyphs into kerning classes, or use the <i>Classes</i> panel to create and edit kerning classes.\n\n**To add a kerning pair**, <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the second glyph in the pair and then <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> it closer or farther to the previous glyph in the string. You also can <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the “thumb” below the pair. If either of the glyphs is in a class, a pair will be added for that class rather than the glyph.\n\n**To create exceptions** from a class kerning pair, hold a modifier key and kern.\n\n- **To turn off the first class**, so you kern the first individual glyph with the second class, hold <b style=\"font-style: normal;\"><b><small>CTRL</small></b></b>.\n- **To turn off the second class**, so you kern the first class with the second individual glyph, hold <b style=\"font-style: normal;\"><b><small>ALT</small></b></b>.\n- **To turn off both classes** and kern both individual glyphs against each other, hold <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>ALT</small></b></b>.\n\nCreating an exception adds a new pair that you can subsequently edit in a normal way.\n\n**To edit an existing kerning pair** (between classes or glyphs), <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the second glyph in the pair and then <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> it closer or farther to the previous glyph in the string. You also can <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the “thumb” below the pair. If either glyph is in a class and a pair exists for that individual glyph, you will be editing that pair. If either glyph is in a class and there is no kerning pair for that individual glyph, you will be editing the class-based pair.\n\nYou can also edit the kerning value this by using <b style=\"font-style: normal;\"><b>←</b></b> for moving the glyphs closer and <b style=\"font-style: normal;\"><b>→</b></b> for moving them farther. The amount kerned while using the cursor keys can be controlled by keyboard shortcuts:\n\n- : 1 unit\n- : 10 units\n- : 100 units\n\n**To delete a particular kerning pair** (whether it involves classes or simple pairs):\n\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the second glyph in the pair and type 0 (zero) in the kerning value field in the Property bar.\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the second glyph in the pair and then on the <b style=\"font-style: normal;\"><b>✕</b></b> button next to the kerning value field in the Property bar.\n",
  "tool.knife": "Knife tool; The **Knife tool** is used to insert nodes and break contours. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>J</b></b> to activate it (hold the key to activate it temporarily). \n\n**<b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> a node** to break the contour at that node.\n\n**<b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> a contour segment** to insert the node. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to insert a node at the closest extremum.\n\n**<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> from the empty canvas** to form a “knife line.” After you release the mouse, new nodes will be added at all points where this line crossed the outline. Hold down <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to constrain the direction of the “knife line” to 90-degree increments.\n\n<b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> to add nodes and break contours with the knife. Cutting across a contour in this way will change a closed contour into two open contours.\n\n<b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>DRAG</small></b></b> to “cut apart” the glyph. Cutting across a contour in this way will change a single closed contour into two closed contours.\n\n",
  "tool.magnet": "Magnet tool; The **Magnet tool** is used to link/unlink nodes to **Power Guides** and to add **hints**. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>U</b></b> to activate it (hold the key to activate it temporarily). \n\nEvery node may have one vertical and one horizontal link. \n\n<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> from the node to a guide **to link the node to the guide** and make it a power guide. Any node linked to a power guide will follow if you move the guide. If node had a link, it will be replaced with the new one. **<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> to the canvas** to unlink the node. \n\nUse <i>Glyph › Disconnect Power Guides</i> to remove all links in the current layer.\n\nUse <i>Glyph › Add Power Guides</i> to automatically add power guides.\n\n<b style=\"font-style: normal;\"><b><small>SHIFT</small></b>­·<b><small>DRAG</small></b></b> from node/handle to another point or to canvas: add hint.  point: add ghost hint",
  "tool.metrics": "Metrics tool; Metrics tool activates the metrics mode of the Glyph window where you can edit glyph sidebearings and advance width. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>M</b></b> to activate it (hold the key to activate it temporarily).\n\n#### Editing with mouse\n\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the sidebearing lines of active and inactive glyphs.\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the spacing triangles of an active glyph.\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the image of the active glyph within its advance width, <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> to change the width (turn this off in <i>Preferences › Spacing</i>). \n\n#### Editing with keyboard\n\n- Hold <b style=\"font-style: normal;\"><b><small>CTRL</small></b></b> and use s to change the left sidebearing by 1 unit. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to accelerate by 10 units.\n- Hold <b style=\"font-style: normal;\"><b><small>ALT</small></b></b> and use  to change the right sidebearing by 1 unit. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to accelerate by 10 units.\n- Hold <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>ALT</small></b></b> and use  to move the glyph within the advance width by 1 unit without changing the width. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to accelerate by 10 units.\n- Hold <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>ALT</small></b></b> and use  to increase or decrease the advance width by 1 on each side. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to accelerate by 10 units.\n",
  "tool.pen": "Pen tool; The traditional Bézier **Pen tool** in FontLab is accessible via <b style=\"font-style: normal;\"><b>P</b></b> and through the toolbar. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>P</b></b> to activate it (hold the key to activate it temporarily). \n\n#### New contour\n\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the canvas to start creating a new contour. Move the mouse to the position of the next node.\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> to create a line point.\n- **Hold** the mouse button and <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the mouse to define a curve. New curve handle will be created when you release the mouse button. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> while dragging to to constrain the direction of the line or a handle to axes or 45 degrees. Hold <b style=\"font-style: normal;\"><b><small>ALT</small></b></b> while dragging to move the handle without affecting the handle of the previous curve.\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the starting node of the contour to close it. Or hold the mouse button and <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> to close the contour and adjust direction of the first node handles.\n- Tap <b style=\"font-style: normal;\"><b><small>ESC</small></b></b> to stop drawing the contour without closing it.\n\n#### Existing contour\n\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the segment **to add a node**.\n- **<b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the first or last** node of an open contour to continue it.\n- **<b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the node** to retract the handles. If there are no handles to retract, the node is removed.\n- **<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the node** to make it smooth and adjust handles direction.\n- <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> the node to make it corner and adjust one handle. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to constrain handle direction.\n\n",
  "tool.pencil": "Pencil tool; With the Pencil tool you can create new contours and modify existing contours in a freehand manner. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>N</b></b> to activate it (hold the key to activate it temporarily). \n\n#### New contour\n\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> (“draw”) on a canvas to create a new contour. \n- <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>DRAG</small></b></b> to add a straight line to the contour. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to constrain its direction to axes.\n- End your drawing line on a starting point to close the contour. \n\n#### Existing contour\n\nTurn on <i>Preferences › Editing › Pen and pencil tools can change contour</i>.\n\nPosition mouse over an existing contour (or its edge nodes) and start drawing: new stroke will join the contour. End the stroke over the same or another contour to join there.\n\n",
  "tool.rapid": "Rapid tool; With the **Rapid tool**, you can quickly draw smooth curves. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>5</b></b> to activate it (hold the key to activate it temporarily). \n\n<b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> for a line, <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> for a curve. The app knows which nodes should be extremes, and automatically makes smooth curves where needed. Rapid is great for quick drawing of consistent elements, or for intelligent manual tracing of a scan or background image.\n\nThe Rapid tool draws curves with tension based on the **Tension** parameter in the **Font info** panel or dialog box. The default is a \"normal\" curve, but you can set a higher percentage to get a super-elliptical curve.\n\n#### Adding Nodes\n\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> to add a line.\n- <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> to add a smooth curve.\n- <b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> to add a tangent node.\n\nFor every curve segment created, a single control point is added.\n\n- **<b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the first node** of a new contour to close the contour.\n\nIf <i>Preferences › Editing › Rapid tool remembers last state</i> is on, the Rapid tool adds straight nodes until you <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> (or <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>CLICK</small></b></b>), then it adds smooth nodes until you <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> (or <b style=\"font-style: normal;\"><b><small>CTRL</small></b>­·<b><small>CLICK</small></b></b>) again. Setting this preference gives it two modes, which you can switch back and forth.\n\n#### Adding Control Points\n\n<b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> to add a control point. If control points are added sequentially, the tool will add the intermediate nodes.\n\n#### Adjustments\n\nAt any time during drawing with the Rapid tool, both nodes and control points can be adjusted:\n\n- <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> to move the point.\n- <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> to convert straight nodes to smooth and vice-versa.\n- <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b>\" the contour segment to insert a node.\n\n",
  "tool.rectangle": "Rectangle tool; The **Rectangle tool** draws rectangles and squares. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>I</b></b> to activate it (hold the key to activate it temporarily). \n\n<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> to create a rectangle. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to create a square, and <b style=\"font-style: normal;\"><b><small>ALT</small></b></b> to start drawing from the center. \n\nHold <b style=\"font-style: normal;\"><b><small>CMD</small></b></b> to create a “white” rectangle that will be unfilled if it’s inside another contour.\n\n<b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> to add a rectangle which properties you define in the pop-up dialog box.\n\nWhen you draw a rectangle, it will be added to the current element. To start drawing in the new element, tap <b style=\"font-style: normal;\"><b><small>ESC</small></b></b> or choose the <i>Glyph › New Element</i> menu item before you start drawing.\n\nThe <i>Eraser</i> toggle button activates the rectangle eraser which, instead of drawing new rectangles, will cut out rectangular shapes out of existing contours. \n\n",
  "tool.rotate": "Quick Rotate tool; The **Quick Rotate tool** is used to quickly rotate the active contour selection or element, depending one the currently active tool. Tap <b style=\"font-style: normal;\"><b>R</b></b> to activate it (hold the key to activate it temporarily). \n\n**Hold the mouse button** and <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> to rotate current selection or element. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to constrain rotation to 15 degree increments.\n\n",
  "tool.scale": "Quick Scale tool; The **Quick Scale tool** is used to quickly scale the active contour selection or element, depending one the currently active tool. Tap <b style=\"font-style: normal;\"><b>S</b></b> to activate it (hold the key to activate it temporarily). \n\n**Hold the mouse button** and <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> to scale current selection or element. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to constrain proportions. Hold <b style=\"font-style: normal;\"><b><small>ALT</small></b></b> to constrain the movement direction to 45 degrees and the scale factor to 100%, 200%.\n\n",
  "tool.scissors": "Scissors tool; The **Scissors tool** allows you to manually create an overlap or an unlinked corner. Click its Toolbar icon or tap <b style=\"font-style: normal;\"><b>Q</b></b> to activate it (hold the key to activate it temporarily).\n\n**click a corner** to unlink a corner. You now have greater freedom to control the shape of that corner. **<b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> a corner** to create a looped corner, similar to an unlinked corner but closed. Both methods create a <i>Fill</i> filter so that only the correct areas are filled. Use <i>Element › Expand Filters</i> to convert these areas to simple contours.\n\n**<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> from one node to another** to create an overlap between these two nodes, i.e. to divide the contour into two overlapping contours.\n\n**<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> from the empty canvas** to marquee-select the nodes where the contour should be divided. You may select 2 nodes to divide a contour into two (e.g. create an overlap between the middle bar of the “E” and the rest), or 4 nodes to create an overlap on an intersection (as in X).\n",
  "tool.slant": "Quick Slant tool; The **Quick Slant** tool is used to quickly slant (skew) the active contour selection or element, depending one the currently active tool. Tap <b style=\"font-style: normal;\"><b>D</b></b> to activate it (hold the key to activate it temporarily). \n\nYou have the ability to slant vertically as well.\n\n**Hold the mouse button** and <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> to slant selection or element. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to constrain slant direction to horizontal or vertical.\n\nThe starting mouse position defines the slanting origin point.\n\n",
  "tool.text": "Text tool; The **Text tool** is used to switch the Glyph window to its Text mode, so you can type in the Glyph window and in the Sketchboard. Click the <i>T</i> Toolbar icon or tap <b style=\"font-style: normal;\"><b>T</b></b> to activate it, tap <b style=\"font-style: normal;\"><b><small>ESC</small></b></b> to return to the previous tool. \n\nWith the Text tool, you can type or paste any text. If your font does not contain glyphs for some characters, character templates will appear instead. <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> a character template to create an actual glyph for it, so you can start designing it.\n\nPress <b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b>L</b></b> to input a glyph that is related to the character before the text cursor. Press and hold any letter key to input glyphs related to that letter. Tap <b style=\"font-style: normal;\"><b>/</b></b> to input a glyph by its glyph name. Tap ++#++ to input a glyph by its Unicode codepoint. Press <b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b>F</b></b> to input a glyph using various criteria. \n\n",
  "tool.transform": "Free transform; Use Free tranform to apply transformation to selected contours or elements. Use <i>Tools › Free Transform</i> (<b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b>T</b></b>) to activate or simply <b style=\"font-style: normal;\"><b><small>2×CLICK</small></b></b> selected contours.\n\nControls for contour transformation have **blue** color, element transformation is **green**. The green rectangle means the transformation applies **only** to this particular instance of the element. Other elements referencing to the same contours will stay unchanged.\n\n<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the body of the control area to **move** selection. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to constrain movement. \n\n<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> corners to **scale**. Hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to scale unproportionally. <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> edges to scale in one direction. \n\n<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> near the contours to **rotate**. \n\n<b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b><small>DRAG</small></b></b> controls on any edge to **slant**.\n\n<b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b><small>DRAG</small></b></b> corners to apply **perspective transformation**, hold <b style=\"font-style: normal;\"><b><small>SHIFT</small></b></b> to allow free movement.\n\n<b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> the <b style=\"font-style: normal;\"><b>✕</b></b> control to define center of rotation.\n\nTap <b style=\"font-style: normal;\"><b>↩</b></b> to accept (or <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> the empty canvas), tap <b style=\"font-style: normal;\"><b><small>ESC</small></b></b> to cancel the transformation.\n",
  "tool.zoom": "Zoom tool; Use the Zoom tool to change view area of the Glyph window. \n\nPress <b style=\"font-style: normal;\"><b><small>CMD</small></b>­·<b><small>SPACE</small></b></b> to activate zoom tool, then <b style=\"font-style: normal;\"><b><small>CLICK</small></b></b> to zoom in or <b style=\"font-style: normal;\"><b><small>DRAG</small></b></b> to define are which you want to zoom. <b style=\"font-style: normal;\"><b><small>ALT</small></b>­·<b><small>CLICK</small></b></b> to zoom out.\n\nTap <b style=\"font-style: normal;\"><b>Z</b></b> to quickly zoom in the area below cursor. Tap <b style=\"font-style: normal;\"><b>X</b></b> to zoom out. These keys are active in any tool and any mode.\n",
  "welcome": "Welcome to FontLab!; Open or create a new font using the **File** menu, or using the **Welcome** dialog, which you can open from the _FontLab_ menu on Mac or _File_ menu on Windows.\n\n#### Learn FontLab\n\nMove your mouse pointer over a user interface element such as a text field or a button, and wait for a while to see a short **tool tip**.\n\nPoint at a UI element and **hold F1** to see an extended **help tip** that appears until you release the key. We have added help tips to many UI elements, with more to come! On macOS, you may need to use <b><small>FN</small></b>·<b>F1</b> — to use just <b>F1</b>, turn on <i>Apple menu › System Preferences… › Keyboard › Keyboard › Use F1, F2, etc. keys as standard function keys</i>.\n\n**Tap** (briefly press) **F1** (or <b><small>FN</small></b>·<b>F1</b>), or click the circled **?** in top-right of this panel, to turn on **Quick Help mode** that shows help tips as you explore the user interface with your pointer. Tap the key again to turn Quick Help mode off. To show help tips in **large font size**, turn on <i>Preferences › General › Show keystrokes</i> and <i>Apply</i>.\n\nPress <b><small>SHIFT</small></b>·<b>F1</b> or <b><small>SHIFT</small></b>·<b><small>FN</small></b>·<b>F1</b> to open this **Help panel**. Then open a tool or a dialog, or click an open panel, and read its description in the Help panel. Press the key combination again to hide the Help panel.\n\nFrom the **Help** menu, choose **User Manual** to open the FontLab help center for more extensive documentation. Choose **Support** to contact us directly with questions or problem reports. Choose **Forum** to ask other users for tips and suggestions, or share your own!\n"
}