{
"Access panels" : "**Клацніть правою кнопкою миші** на заголовку будь-якої панелі, щоб отримати список усіх панелей.",
"Add a guide that goes through two nodes" : "Select two nodes and choose **Tools > Add Guide** to add a glyph guide that goes through those nodes.",
"Add a precise ellipse or rectangle" : "Tap **O** for the Ellipse tool or **I** for the Rectangle tool and click anywhere in the glyph canvas, then enter the width and height numerically to place the shape precisely.",
"Add missing node on extremum" : "**Shift+Ctrl+Alt-click** a PS curve segment to add a node at the horizontal or vertical extremum (whichever is closer), or tap **J**, hold **Shift** and click the segment. Repeat to add the other one.",
"Align handles" : "**Shift-double-click** a handle to make it horizontal or vertical, **Alt-double-click** a handle to slide its node to the closest extremum position. Select many handles with **Alt-lasso** and tap **[**, **]** or **|** to align them all.",
"Align nodes" : "**Shift-double-click** a node that is nearly aligned with another node to align in perfectly. Select several nodes and tap **[**, **]** or **|** to align them all.",
"Assign a dynamic glyph width" : "When editing a glyph, tap **M**, then **;** to autospace the glyph. Then turn on both **Bind** buttons in the property bar, and tap **A**. Edit your glyph, and the width will change dynamically.",
"Balance a curve segment" : "Hold **L** to show Tunni lines temporarily or tap it to show permanently. **Double-click** on the blue dashed Tunni line between two handles to make their length proportionally equal.",
"Change multiple kerning pairs" : "In the Kerning panel, select several kerning pairs and use the **← →** arrow keys to change the kerning value of all selected pairs at once.",
"Convert line to curve" : "**Alt-drag** the outline of a line segment to convert it to curve, **Alt-click** to make a flat curve, **Shift+Alt-click** to make a curve that joins smoothly. **Alt-drag** a sharp node to drag out a handle.",
"Copy glyph metrics across masters" : "To copy widths or sidebearings of your current master to other masters, use **Tools > Metrics > Match metrics** and turn on **All Masters**. Or link metrics across masters: in your Bold “a”, type _Regular - 10_ into the LSB field. Whenever you **Font > Update Metrics** while in the Bold master, the left sidebearing of the Bold “a” will update to be 10 units less than the Regular “a” LSB.",
"Copy-paste family dimensions" : "Ensure consistent linespacing values across font masters or different fonts with the copy-paste buttons in **Font Info > Family Dimensions**.",
"Create new glyphs" : "Open a Glyph window, type any text, and if any glyphs are missing, double-click on the character placeholders to create them. Or double-click on empty glyph cells in the Font window.",
"Customize keyboard shortcuts" : "Choose **Tools > Commands**, type in a menu item name and in the bottom box press the keyboard shortcut to assign to that menu item. Then, click **Set** and **Close**.",
"Duplicate a node" : "Click a node or a TT off-curve point, and press **Cmd+D** (Mac) or **Ctrl+D** (Win) to duplicate it. This makes two nodes on top of each other.",
"Export a font with your settings" : "In **Font > Profiles**, select a built-in profile, duplicate it with *+* and customize the settings. Then select your custom profile in **Font > Export Font As**.",
"Focus on a section of your glyph set" : "Use Font window filters. Type _lowercase_ into the Font window Search box, click Category and the window will first show (filter) your font’s lowercase glyphs. Set the filter dropdown in the property bar to Categories and choose Lowercase, and you will also see empty cells for all potential lowercase characters. Toggle **All Glyphs** in the History sidebar to hide the unfiltered glyphs.",
"Input glyphs and texts" : "In Font or Glyph window, tap **/** and enter a glyph name or its character to jump to that glyph. Click the **Text** tool to type longer texts into your Glyph window or type them into the Preview panel (**/** works there, too). To enter glyphtext (i.e. to mix characters, /glyphnames and \\uXXXX Unicodes), turn on **View > Text Bar** and the **abc** icon in the Preview panel’s sidebar.",
"Insert a node" : "**Ctrl+Alt-click** the outline to add a node in that place or hold **J** and click. Decide if the node should be added in current master or all masters via **Preferences > Variations**.",
"Kerning classes with multiple masters" : "When you work on a font with multiple masters, kerning classes are master-specific. Once you’ve set up the kerning classes in your main master, switch to another master and use the **Classes panel** hamburger menu to **Import Classes** from your main master.",
"Make a super-smooth node" : "**Alt-double-click** a smooth node to put it into a super-smooth location (G2-smooth). **Shift+Alt+double-click** to convert into a Genius node.",
"Measure stems and counters" : "Turn on **View > Measurement Line** or create a guide, and **double-click** on it. Move it, and you’ll dynamically measure stems, counters, and — with **Edit Across Elements** and **Glyphs** on — also inter-glyph whitespace.",
"Nudge a node" : "**Ctrl+Alt+drag** a node to move it but also proportionally move (nudge) the handles of adjacent curve segments.",
"Open Font Info panel" : "**Alt-double-click** on the property bar of the Font Window to open the Font Info panel.",
"Open Font Map panel" : "**Double-click** on the property bar of the Glyph Window to open the Font Map panel.",
"Open Fonts panel" : "**Double-click** on the property bar of the Font Window to open the Fonts panel.",
"Open Glyph panel" : "**Alt+double-click** on the property bar of the Glyph Window to open the Glyph panel.",
"Place a node at extremum" : "**Shift+Ctrl+Alt-click** a curve segment to insert a smooth node at an extremum. **Alt-double-click** a handle of a smooth node to slide the node to an extremum.",
"Power nudge nodes" : "Turn on **Contour > Power Nudge** and move one or more nodes, and some of the closest nodes and handles will intelligently move. Turn off for traditional editing.",
"Preview a glyph" : "Press **Space** while in Font window or Font Map panel to get a quick glyph info preview, use arrow keys while pressing Space to navigate.",
"Preview filled text" : "In Glyph window, tap **Shift+Space** to see the glyphs fully filled. Hold **Space** to see them filled but hide nodes or guides. Or tap *T* and wait a few seconds so the text cursor disappears.",
"Quickly autospace or autokern" : "Tap **M**, then **;** (semicolon) to autospace the current glyph. Tap **K**, then **;** to autokern the current pair.",
"Remove a node" : "Click a node and tap **Backspace** to remove a node, or hold **2** and click. Decide if the node should be removed in current master or all masters via **Preferences > Variations**.",
"Remove nodes or segments" : "Select nodes or segments. Tap **Backspace** to remove them but keep the contour closed. Tap **Delete** or **Fn+Backspace** to remove them an break (open) the contour.",
"Reshape a curve segment" : "**Alt-drag** the outline of a curve segment to freely change its shape, **Shift+drag** to keep all handle directions, **drag** to keep handle directions on smooth nodes.",
"Run menu actions using keyboard" : "Press **Shift+Cmd+P** (Mac) / **Shift+Ctrl+P** (Win), type a portion of a menu command, pick the right command with arrow keys and tap **Enter** to run it.",
"Script-specific guides and zones" : "Assign script or category tags: *latn*, *cyrl*, *uc*, *lc*, *fig*, *sc* etc. in **Font Info > Zones** and **Guides** (check **Classes panel > Virtual Tags** for the full list.) Zones and font guides with these tags will only show up where needed!",
"See snapping candidates" : "Turn on the menu items in **View > Suggest** and in **View > Snap**. Move nodes around, and when you approach objects (guide, zone, stem, edge) to which your node can snap, these objects will appear.",
"See which glyphs changed recently" : "In Font window, set **Encoding: None** and **Sorting: Age** to view the recently modified glyphs first. Set **Cell caption: Age** and turn on the **List sidebar** to see the modification date and time. Works great with UFO!",
"Select a node that is on top of another" : "When nodes from different contours are on top of each other, move your mouse along the right contour towards the node, then click to select the node you want.",
"Select all glyphs from a class" : "Select one or more classes in the **Classes** panel and click on the **Select glyphs** button to select all glyphs that belong to those classes.",
"Select nodes and contours" : "**Drag** over nodes to select them, **Alt-drag** to select nodes and/or just handles, **Shift-click** on segments to select them one by one, **Alt-click** near a segment (but not on it) to select the entire contour.",
"Slide node along curve" : "**Shift+Alt-drag** a node to reposition the node on a segment, or to continue a curve on a corner or open contour. ",
"Switch between font masters" : "When you work on a font with multiple masters, you can switch to the previous master with **Alt+,** and to the next master with **Alt+.**. With **Alt+1**–**Alt+9**, you can switch directly to one of the first nine masters.",
"Temporarily activate tools" : "Press and hold a key to temporarily activate a tool: **2** for Eraser, **J** for Knife, **G** for guides and measurement etc. Release to return to previous tool.",
"Trim rectangular areas" : "Tap **I** to activate the Rectangle tool and click the Eraser toggle in the property bar. Now you can trim (cut out) rectangular areas out of your glyph drawing.",
"View a detailed list of all glyphs" : "In Font window, turn on the **List sidebar** and choose different **Cell captions**. Then click the sidebar columns to sort the list by sidebearings, width, Unicode names, scripts and categories or kerning classes.",
"View font in real point size" : "In Glyph window, open the content sidebar with the top-left button and set the point size. Then use the **View > Actual Text Size** zoom level.",
"View visually related glyphs as you edit" : "Turn on **View > Cousins** to see a stack of visually related glyphs in the background of the glyph you edit. Edit the relationships between cousins and how they’re shown in **Preferences > Cousins**.",
"Work with integer coordinates" : "In the **Contour > Coordinates** menu, turn on ****Round when Editing**** to restrict all node, handle, guide etc. coordinates to integer font units (no fractional coordinates). To make sure existing glyphs have integer coordinates, select all glyphs in Font window and run **Contour > Coordinates > Apply Rounding** on each layer.",
"Work with the grid" : "Turn on **View > Show > Grid** and **View > Snap > Grid** to work with a grid. Customize it in **Preferences > Grid**: set its distance and angle, and reduce the opacity of the grid lines to reduce the visual clutter and only see a dot-based grid."
}