{
"Access panels" : "Чтобы получить доступ к перечню всех панелей необходимо **кликнуть правой кнопкой мыши** на заголовке любой панели.",
"Add a guide that goes through two nodes" : "Чтобы добавить направляющие для глифов, проходящее через эти узлы следует выделить два узла и перейдите к пункту меню **Инструменты > Добавить направляющие**.",
"Add a precise ellipse or rectangle" : "Для того чтобы создать \"овал (круг)\" необходимо кликнуть на клавиатуре клавишу **O**. Чтобы нарисовать \"Прямоугольник\" следует воспользоваться клавишей **I**. После выбора соответствующего инструмента необходимо кликнуть в любом месте на глифе или холсте, в результате чего будет выведено диалоговое окно для ввода значений ширины и высоты для будущей фигуры.",
"Add missing node on extremum" : "Чтобы добавить узел на горизонтальном или вертикальном экстремуме (в зависимости от того, что находится ближе), следует воспользоваться комбинацией клавиш ****Shift+Ctrl+Alt** кликнув на сегменте кривой. Также операцию можно осуществить нажав на клавишу **J** и удерживая нажатой клавишу **Shift** кликнуть на сегменте. Чтобы добавить еще один узел операцию следует повторить.",
"Align handles" : "Чтобы перевести направляющую в горизонтальное или вертикальное положение необходимо удерживая клавишу **Shift дважды кликнуть** на соответствующей направляющей. Для того чтобы переместить направляющую для узла в ближайшее положение экстремума следует удерживая клавишу **Alt дважды кликнуть** по направляющей. Чтобы выровнять несколько или все направляющие следует их выбрать с помощью клавиши **Alt-lasso** и кликнуть на клавише **[**, **]** или **|**, .",
"Align nodes" : "Чтобы добиться идеального выравнивания узла, который не выровнен по отношению к другим узлам следует удерживая клавишу **Shift дважды кликнуть** на соответствующем узле. Чтобы выровнять все узлы следует выбрать несколько узлов и кликнуть на клавише **[**, **]** или **|**.",
"Assign a dynamic glyph width" : "Чтобы автоматически выделить глиф при его редактировании нажмите клавишу **M**, а затем **;**. Далее активируйте две кнопки **Привязать**, расположенные на панели свойств и нажмите клавишу **A**. Отредактируйте глиф, после чего его ширина будет изменяться динамически.",
"Balance a curve segment" : "Удерживая клавишу **L**, можно временно отображать линии Tunni, чтобы они отображались постоянно, следует кликнуть по одной из них. Чтобы длина линий Tunni были выровнены пропорциональной необходимо **дважды кликнуть** на синей пунктирной линии Tunni, которая расположена между двумя маркерами.",
"Change multiple kerning pairs" : "Выбрав несколько пар на панели кернинга и используя клавиши со стрелками **← →**, можно одновременно изменить значение кернинга для всех выбранных пар.",
"Convert line to curve" : "Удерживая нажатой клавишу **Alt**, перетащите сегмент контура, чтобы преобразовать его в кривую. Кликнув по нему, удерживая клавишу **Alt**, можно создать плоскую кривую, Кликнув по нему, в сочетании с клавишами **Shift+Alt**, можно создать плавно соединительную кривую. Удерживая нажатой клавишу **Alt**, перетащите заостренный узел, для вытягивания направляющих.",
"Copy glyph metrics across masters" : "Чтобы скопировать ширину или полуапрошы из текущего мастера в другие мастера, воспользуйтесь пунктом меню **Инструменты > Метрики > Сопоставить метрики** и включите опцию **Все мастера**. Или же свяжите мастера между собой, для этого: выделите начертание Bold буквы “а” и введите в поле LSB параметр _Regular - 10_. После чего каждый раз, находясь в мастере с начертанием Bold, когда вы будете использовать опцию **Шрифт > Обновить метрики**, значение для левого полуапроша буквы “a” с начертанием Bold будет уменьшаться на 10 единиц, по сравнению со значением LSB в начертании Regular буквы “а”.",
"Copy-paste family dimensions" : "Чтобы обеспечить соответствие значений в межстрочном интервале между мастерами шрифта или разными шрифтами, с помощью кнопок копировать и вставить, необходимо перейдите в пункт меню **Сведения о шрифте > Размеры для семейства**.",
"Create new glyphs" : "Откройте окно с глифами, введите любой текст, и если какие-то глифы отсутствуют, дважды кликните по соответствующему символу-заполнителю, чтобы его создать. Так же можно в окне шрифта дважды кликните по пустым ячейкам глифа.",
"Customize keyboard shortcuts" : "Чтобы назначить для определенного пункта меню горячие клавиши, следует перейти в пункт меню **Инструменты > Команды**, и в нижнем поле выбрать необходимое сочетание клавиш. Затем нажать кнопки **Установить** и **Закрыть**.",
"Duplicate a node" : "Кликните по узлу или точке отклонения TT от кривой и нажмите **Cmd+D** для (Mac) или **Ctrl+D** для (Win), чтобы его продублировать. Это приведет к созданию двух узлов, которые будут расположены друг над другом.",
"Export a font with your settings" : "В меню **Шрифт > Профили** выберите один из встроенных профилей, продублируйте его воспользовавшись клавишей *+* и осуществите настройку соответствующих параметров. В результате один из пользовательских профилей можно будет выбирать через пункт меню **Шрифт > Экспортировать шрифт как**.",
"Focus on a section of your glyph set" : "Используйте фильтры в окне шрифта. Для этого находясь в данном окне, в поле поиска введите значение _lowercase_, после чего кликните на **Категории**, в результате будут отображены (отфильтрованы) существующие глифы относящиеся к нижнему регистру. В раскрывающемся списке с фильтрами, который расположен на панели свойств, выберите опцию **Категории и строчные буквы**, в результате чего помимо уже имеющийся  строчных символов так же будут отображены пустые ячейки для всех потенциальных глифов, которые относятся к нижнему регистру. Переключите опцию **Все глифы**, находящейся на боковой панели с историей, чтобы скрыть не отфильтрованные глифы.",
"Input glyphs and texts" : "Находясь в окне шрифта или глифа кликните на клавишу **/** и введите имя для глифа или его символа, чтобы перейти к соответствующему глифу. Выберете инструмент **Текст**, чтобы ввести более длинный текст в окне глифа или на панели предварительного просмотра (клавиша **/** так же работает на данной панели). Чтобы ввести глифтекст (т.е. смешать символы, /glyphnames и \\uXXXX Unicodes) следует включить опцию **abc**, она расположена на боковой панели предварительного просмотра. Ее можно активировать через пункт меню **Вид > Панель текст**.",
"Insert a node" : "Используя комбинацию клавиш **Ctrl+Alt** кликните по контуру, чтобы добавить узел для текущей области. Так же соответствующий узел можно добавить кликнув по контуру, удерживая клавишу **J**. Чтобы сделать выбор между добавлением узла только для текущего мастера или во все мастера, необходимо использовать пункт меню **Настройки > Вариации**.",
"Kerning classes with multiple masters" : "Когда вы работаете над шрифтом с несколькими мастерами, то классы кернинга зависят от мастера. После того, как вы настроили классы кернинга в главном мастере, переключитесь на другого мастера и используйте панель **Классы** в меню, чтобы **Импортировать классы** из вашего основного мастера.",
"Make a super-smooth node" : "Чтобы перевести узел в абсолютно прямое положение (G2-сглаженное)  необходимо сделайте двойной клик по ровному узлу с сочетании с нажатой клавишей **Alt**. Сделав двойной клик по ровному узлу в сочетании с нажатой комбинацией клавиш **Shift+Alt** можно преобразовать его в уникальный узел.",
"Measure stems and counters" : "Активируйте опцию **Вид > Измерительная шкала** или создайте направляющие, после чего **дважды кликните** по ним. Перемещая их, даст вам возможность динамически осуществлять замеры для штамбов, контуров. Так же включив параметры **Правка между элементами** и **Глифы** можно производить замеры между глифами.",
"Nudge a node" : "Чтобы переместить узел, или же пропорционально ему переместить (сдвинуть) маркеры соседних сегментов в кривой необходимо выбрать соответствующий узел в сочетании с комбинацией клавиш **Ctrl +Alt**.",
"Open Font Info panel" : "Чтобы открыть панель содержащую сведения о шрифте необходимо удерживая клавишу **Alt** сделать двойной клик на панели свойств, расположенной в окне шрифта.",
"Open Font Map panel" : "Чтобы открыть панель с картой шрифтов необходимо **дважды кликнуть** на панели свойств, которая расположена в окне глифа.",
"Open Fonts panel" : "Чтобы открыть панель со шрифтами необходимо **дважды кликнуть** на панели свойств, расположенной в окне шрифтов.",
"Open Glyph panel" : "Чтобы открыть панель с глифами необходимо удерживая клавишу **Alt** сделать двойной клик на панели свойств, которая расположена в окне глифа.",
"Place a node at extremum" : "Кликнув по сегменту кривой в сочетании с комбинацией клавиш **Shift+Ctrl+Alt**, можно вставить прямой узел в экстремуме. Если дважды кликнуть по направляющей прямого узла с использованием клавиши **Alt**, можно сдвинуть узел к экстремуму.",
"Power nudge nodes" : "Если активировать опцию **Контур > Режим соразмерной правки **, то  при перемещении одного или нескольких узлов, а также для некоторых соседних узлов и направляющих будет применяться режим соразмерного редактирование. Если данная опция будет отключена то для соответствующих узлов и направляющих будет применено стандартное редактирование.",
"Preview a glyph" : "Чтобы быстро получить сведения о глифе находясь в окне шрифта или на панели карты шрифта, необходимо на клавиатуре нажать **Space**. Используя клавиши со стрелками, кликая по клавише Space, можно осуществлять навигацию.",
"Preview filled text" : "Чтобы увидеть глифы с полной заливкой, необходимо, находясь в окне глифа, нажать комбинацию клавиш **Shift+Space**.  Если удерживать клавишу **Space**, то можно увидеть глифы с полной заливкой, но при этом будут скрыты все узлы или направляющие. Если необходимо чтобы на экране был скрыт текстовый курсор, то следует нажать клавишу *T* и подождать несколько секунд.",
"Quickly autospace or autokern" : "Чтобы автоматически выделить текущий глиф следует нажать на клавише **M**, затем на клавише **;** (это точка с запятой). Чтобы автоматически выбрать текущую пару необходимо использовать клавишу **K** и затем нажать **;**.",
"Remove a node" : "Чтобы удалить узел необходимо клинкуть по нему и нажать **Backspace**, или же удерживая клавишу **2** кликнуть по узлу. Чтобы определить следует ли удалить узел в текущем мастере или во всех мастерах необходимо воспользоваться пунктом меню **Настройки > Вариации**.",
"Remove nodes or segments" : "Чтобы удалить узлы или сегменты, но при этом чтобы контур остался закрытым, следует выбрать соответствующие узлы или сегменты и нажать клавишу **Backspace**. Если необходимо удалить их и при этом разорвать (открыть) контур, следует нажать клавишу **Delete** или **Fn+Backspace**.",
"Reshape a curve segment" : "Для того чтобы свободно изменять форму сегмента кривой в контуре необходимо в сочетании с нажатой клавишей **Alt** переместить его.  Чтобы сохранить все направляющие дескрипторов, следует переместить его в сочетании с нажатой клавишей **Shift**. Если следует сохранить направления дескрипторов в прямых узлах нужно просто **переместить** сегмент.",
"Run menu actions using keyboard" : "Для того чтобы запустить команду необходимо нажать комбинацию клавиш **Shift+Cmd+P** для (Mac) / **Shift+Ctrl+P** для (Win), после чего ввести часть команды и с помощью клавиш со стрелками выбрать необходимую команду и нажать **Enter**.",
"Script-specific guides and zones" : "Можно назначить теги для скриптов или категории: *latn*, *cyrl*, *uc*, *lc*, *fig*, *sc* и т.д. Для этого необходимо перейти в пункт меню **Сведения о шрифтах > Зоны** и в разделе **Направляющие** (проверить опцию **Панель классов > Виртуальные теги** чтобы была возможность получить доступ к полному списку). В результате чего области и направляющие для шрифтов с этими тегами будут отображаться только там, где это необходимо!",
"See snapping candidates" : "Включите следующие пункты меню **Вид > Предложить** и ** Вид> Привязать**. В результате чего при перемещении узлов, когда вы будете приближаться к таким объектам как: направляющие, области, штамбы, ребра, к которым можно привязать узел, эти объекты будут отображаться на экране.",
"See which glyphs changed recently" : "Если в окне шрифта установить типы **кодировки: нет** и **сортировки: период**, то в результате можно просмотреть недавно измененные глифы. Если установить тип для **заголовка ячейки: период** и включить боковую панель **список**, то можно увидеть сведения о дате и времени изменения глифа. Данная опция прекрасно работает с UFO!",
"Select a node that is on top of another" : "Чтобы выбрать необходимый узел который, относится к разным контурам и находятся друг над другом, следует навести курсор мыши вдоль правого контура по направлению к узлу, после чего кликнуть на нем.",
"Select all glyphs from a class" : "Чтобы выбрать все глифы, принадлежащие к конкретным классам, необходимо выбрать один или несколько классов на панели **Классы** и нажать на кнопку **Выбрать глифы**.",
"Select nodes and contours" : "Чтобы выбрать узлы необходимо **перемещаться** по ним курсором мыши. Для того чтобы выбрать узлы и/или только направляющие необходимо **переместиться по ним, в сочетании с нажатой клавишей Alt**. Чтобы выбрать подряд идущие сегменты необходимо **поочередно кликнуть по ним в сочетании с нажатой клавишей Shift**. Чтобы выделить весь контур, следует кликнуть рядом с сегментом (но не по нему)  **одновременно удерживая нажатой клавишу Alt**.",
"Slide node along curve" : "Чтобы переместить узел в сегменте, продлить кривую на угловом отрезке или открытом контуре, то для этого следует переместить узел в сочетании с клавишей **Shift+Alt**.",
"Switch between font masters" : "При работе со шрифтом с использованием нескольких мастеров, можно переключаться между мастера. Для этого чтобы переключиться на предыдущего мастера следует использовать комбинацию клавиш **Alt +,**. На следующего мастера можно перейти с помощью комбинации клавиш **Alt+.**. Используя комбинации клавиш **Alt+1**–** Alt+9**, можно переключиться непосредственно на один из первых девяти мастеров.",
"Temporarily activate tools" : "Чтобы временно активировать инструменты следует нажать и удерживать: для ластика клавишу **2**, для ножа клавишу **J**, для направляющих и осуществления измерений клавишу **G** и т.д. Отпустив один из них можно возвращаться к предыдущему инструменту.",
"Trim rectangular areas" : "Чтобы обрезать (вырезать) прямоугольную область из текущего глифа, следует нажать соответствующие клавиши. Сначала нажать клавишу **I**, чтобы активировать инструмент \"прямоугольник\", и после этого кликнуть на инструменте \"ластик\", который расположен на панели свойств.",
"View a detailed list of all glyphs" : "В окне шрифта включите боковую панель **список** и выберите различные **заголовки ячеек**. Затем кликните по боковым панелям, чтобы отсортировать список состоящий из полуапрошов, имен в Юникоде, скриптов и категорий или классов кернинга.",
"View font in real point size" : "В окне глифа откройте боковую панель с помощью кнопки, которая расположена в верхнем левом углу и установите размер для точки. Затем используя пункт меню **Вид > Фактический размер для текста** можно настроить уровень масштабирования.",
"View visually related glyphs as you edit" : "Чтобы увидеть перечень визуально связанных глифов на фоне редактируемого глифа необходимо включить параметр, расположенный в пункте меню **Вид > Дочерние**. Отредактировать отношения между дочерними элементами и как они будут отображаться, можно с помощью пункта меню **Настройки > Дочерние**.",
"Work with integer coordinates" : "Чтобы все координаты для узлов, направляющих и т.д. были представлены в виде целых значений (а не в виде десятичных) следует в пункте меню **Контур >  Координаты** включить опцию **Округлять при правке**.  Чтобы убедиться, что для существующих глифов применены целые значения координат, следует выбрать все глифы в окне шрифта и выполнить команду для каждого слоя **Контур > Координаты > Применить округление**.",
"Work with the grid" : "Для работы с сеткой необходимо включить опцию **Вид > Отображать > Сетка** и **Вид > Привязать > Сетка**.  Настройки можно осуществить через пункт меню **Настройки > Сетка**, это даст возможность: установить расстояние и угол для сетки, уменьшите непрозрачность линий для сетки, снизить визуальную хаотичность а также чтобы отображалась только точечная сетка."
}